[
    {
        "id": "1ktr92w",
        "title": "Percy Jackson but for adults",
        "score": 31,
        "num_comments": 32,
        "link": "https://www.reddit.com/r/booksuggestions/comments/1ktr92w/percy_jackson_but_for_adults/",
        "content": "I was an avid reader as a child, and one of my favourite series as I’m sure many of you in your younger teenage years must have adored as well is Percy Jackson.\n\nI’ve recently started getting back into reading and I’ve started with classic literature, been reading Dostoevsky, Kafka, Camus, Sylvia Path, Oscar Wilde, Ozamu Dazai and while they’re absolutely splendid authors\n\nIt’s a very tolling read, I want something that is a bit light, very pulling and maybe a 3-5 book series?\nNeeds to be captivating, good plot and character building and obviously story line should be amazing.\n\nSingle story books also work, would also like a book that leaves you thinking about the ending in a good way\nNot necessarily philosophical, but just wow types.\n\nLooking forward to your suggestions:)\n\n",
        "comments": [
            "You might want to look into The Expanse. On the surface an engaging, complex, yet easily digestible sci-fi adventure, a little deeper and it's a pretty thoughtful examination of the human condition and how it always has been (and always will be) pretty much the same, just with shinier toys and pointier sticks. It's a nine book series with novellas interspersed. FWIW, Percy Jackson was one of my favorite series as a kid, and The Expanse is one of my favorite series as an adult.",
            "checkout the Red Rising trilogy",
            "Dungeon crawler Carl. It’s 7 books so far but SO captivating you’ll fly through them.",
            "Maybe the name of the wind gives similar vibes",
            "Stephen Frye. Mythos . A retelling of the Greek Myths.",
            "Jim Butcher’s Calderon series follows our hero all the way through school, apprenticeship and adulthood. Some people say it develops too slowly. Other people enjoy the writing and character development🧐",
            "Iron druid chronicles\n\nBook 1 - Hounded\n\nAtticus O'Sullivan, last of the Druids, lives peacefully in Arizona, running an occult bookshop and shape-shifting in his spare time to hunt with his Irish wolfhound. His neighbors and customers think that this handsome, tattooed Irish dude is about twenty-one years old - when in actuality, he's twenty-one centuries old. Not to mention: He draws his power from the earth, possesses a sharp wit, and wields an even sharper magical sword known as Fragarach, the Answerer.\n\nUnfortunately, a very angry Celtic god wants that sword, and he's hounded Atticus for centuries. Now the determined deity has tracked him down, and Atticus will need all his power - plus the help of a seductive goddess of death, his vampire and werewolf team of attorneys, a sexy bartender possessed by a Hindu witch, and some good old-fashioned luck of the Irish - to kick some Celtic arse and deliver himself from evil",
            "If you liked Percy Jackson, the author also has an 'grown up' series with Tres Navarre.  Starts with Big Red Tequila.  Solid reads.",
            "Vorkosigan saga.",
            "Check out the Sword of Shannara series. Each book is its own self-contained adventure, and the next book in the series is about the main character's kid's adventure. You can keep reading the series or stop whenever you want and be satisfied with the ending. It is a fantasy, set in a post-apocalyptic future, where humanity is still recovering from bombing itself back into the dark ages. Old magic was rediscovered, and radiation mutated humans into dwarves, trolls, gnomes, etc.",
            "Have you tried reading Percy Jackson again？"
        ]
    }
]