[
    {
        "id": "1khk1bi",
        "title": "My niece wants to start reading \"big girl books\" and I'm not sure what to recommend",
        "score": 148,
        "num_comments": 680,
        "link": "https://www.reddit.com/r/suggestmeabook/comments/1khk1bi/my_niece_wants_to_start_reading_big_girl_books/",
        "content": "\n\nSo, my niece is 8 years old, soon to be 9 and she has taken after me, being a huge nerd and bookworm. But so far all her books have been in the \"diary of wimpy kid\" style. Illustrated, stylized and '\"easy\"(i love the series btw). Now she wants to graduate to \"big girl books\".  Her parents are readers but much prefer non fiction and asked me for help getting her books. \n\nShe is quite smart for her age. She liked the harry potter movies and wants to read the series. I read them when I was 10 and i could grasp everything quite well. I think she can handle them, and she wants to try, so that's one. \n\nHowever, i'm completely lost on what else to recommend. I never really read children's and tween's books when i was younger, i totally skipped to teen/adult books as early as 11 (and probably read a lot of things I shouldn't have so I'm not about to recommend those and have her parents mad at me lol). My mom trusted me and left me quite free to pick what I wanted, but my brother (probably because he knows the amount of shit I have read) wants to vet the books before he buys them.\n\nSo please, give me your best recommendations of children's books(that do not treat children like they are dumb) for a quite smart almost-nine year old.\n\nFor more info: she loves dinosaurs and all sorts magical stuff. She is also in a magical girl phase. ",
        "comments": [
            "Take her to the library and let her run amok in the kid’s section.\n\nIt might also help to think about what she in particular enjoys. I know a lot of kids that age like things like Percy Jackson and Warrior Cats. If you could get your hands on Dinotopia or similar that might be fun, or a more recent kid’s series about dinosaurs. \n\nIf she still wants something illustrated, but more cerebral, something like A Wolf for a Spell by Karah Sutton, A Wolf Called Wander by Roseanne Parry, or the works of Brian Selznick might be good!",
            "At the same age, my niece (now 15) loved Lemony Snicket’s Series of Unfortunate Events and all the Ronald Dahl books, esp Matilda and James & the Giant Peach.",
            "Ella Enchanted, The Hobbit, Matilda, A Wrinkle in Time, Tuck Everlasting… I read all of those between 7-10! I hope she loves them as much as I did.",
            "Roald dahl books: Matilda, Charlie and the chocolate factory, the BFG, Georges marvellous medicine, James and the giant peach all great for that age! \n\nClassics: Alice in Wonderland, the secret garden, the little princess, Anne of green gables, Heidi, the wizard of oz, the wind in the willows, the little prince, the lion the witch and the wardrobe\n\nJaqueline Wilson books: The story of Tracey Beaker, The Double Act, Hetty Feather, Buried Alive, the illustrated mum, the suitcase kid, cliff hanger. \n\nYou’ve already got some great recommendations for fantasy, but for the others I’d start there.",
            "Little Women by Louisa May Alcott\n\nLittle Princess, Secret Garden by Frances Hodgson Burnett\n\nAll Narnia books by C.S.Lewis\n\nAnne of Green Gables series by Lucy Maut Montgomery\n\nThe Railway Children, Five Children and It, The Phoenix and the Carpet by Edith Nesbit",
            "Anything by Tamora Pierce that is set in the realm of Tortall (I suggest starting with The Lioness quartet).\n\nThe Rangers Apprentice series by John Flanagan.",
            "Terry Pratchett, THE WEE FREE MEN.",
            "Nancy Drew series, Percy Jackson, The princess diaries, Dear America series, Redwall, Warrior cats. ",
            "Can recommend cornelia funke (attention to age recommendations) or astrid lindgren!",
            "The Babysitter's Club series\nA Series of Unfortunate Events\nThe Wild Robot Series \nCharlotte's Web",
            "Mrs Frisby and the rats of NIHM was the first real thing I read back in third grade when I was about 8 !",
            "Diana Wynne Jones! Start with Charmed Life.",
            "Susan Cooper’s The Dark is Rising series.\n\nI generally enjoyed Jessica Day George’s books, though they may be for slightly older readers.\n\nAnything by Beverley Cleary, Judy Blume, or Diana Wynne Jones.\n\nTerry Pratchett’s Tiffany Aching books might be slightly too old for her, but you can give those a try. \n\nI’ve heard good things about Ursula Vernon’s Hamster Princess books, but I haven’t read them; I do really like the adult books she writes under the T. Kingfisher pen name. \n\nThe Wayside School books are fun; I just got those for my 10 y/o niece. I also just gave away my collection of Oz books to my friend’s 7 y/o daughter, who is also a big reader.",
            "I loved a Series of Unfortunate Events when I was roughly her age. Could also try Charlotte's Web, or if she is into non-fiction at all, the Horrible Histories series.",
            "Percy Jackson by Rick Riordan\n\nRedwall by Brian Jacques\n\nCry of the Icemark by Stuart Hill",
            "Tamora pierce! I started with her circle of magic books at 9 and they remain some of my favourites almost 3 decades later",
            "Redwall series by Brian Jacques is a lot of fun, good animals live in a big Abbey and bad animals try to conquer it. The world is a bit bigger than that, but it's the main location. There are battles, feasts, quests, feasts, mysteries and more feasts.",
            "Enchanted Forest Chronicles are great - the first is Dealing with Dragons. \n\n\nVery wholesome animal series - Heartwood Hotel - the first one is A True Home by Kallie George\n\n\nEnid Blyton books, Roald Dahl books...\n\n\nMystwick School of Musicraft, A Wish in the Dark (Soontornvat), where the mountain meets the moon by Grace Lin all have some magical elements. \n\n\nVery thoughtful of you! I hope you find something she enjoys!",
            "Here’s some of my and my kids’ faves:\n\n- The Evolution of Calpurnia Tate\n- Green Glass House\n- Mr Limoncello’s Library\n- The Wild Robot\n- Swallows and Amazons\n- Anne of Green Gables\n- The Explorer",
            "Anne of Green Gables!",
            "All the Ramona books by Beverly Cleary.",
            "Holes",
            "The Hobbit!",
            "Dianna Wynne Jones books!",
            "She might like Howl's Moving Castle by Diana Wynne Jones. It was the inspiration for the Ghibli movie.",
            "The chronicles of prydain by Lloyd Alexander would be a great way to go",
            "Percy Jackson and the Olympians! This author also has a ton of other series and helps other folks get published and they’re all great \n\nThe Warriors series - cat books CERY good. There’s also a bear version and a dog version \n\nAnimorphs is genuinely wonderful imo \n\nI really liked horror as a kid (still do) there was a book called “deep and dark and dangerous” and the author wrote lots of other “scary” books for kids. \n\nReady player one \n\nI would also just take her to the library and let her grab what looks interesting and then slightly vet them just to ensure they’re appropriate. There are SO many phenomenal middle aged books out there. Help her come up with a list of her to reads! You could also make a cute bucket list or bingo card of things she wants to read! A summer one would be fun. Library’s frequently have kids reading challenges and the librarians can ABSOLUTELY help point yall in the right direction. \n\nI was also given free rein access to any book I wanted at a very young age and it wasn’t the best for me. I had read several Stephen king books by the time I was 10 years old bc it’s what I saw adults reading lolol",
            "Things my 7-11 year old daughters are loving :\n\nEverything by Kate DiCamillo\n\nThe Vanderbeekers series\n\nB is for Betsy series\n\nSarah, Plain and Tall and following books (shorter books but what lovely storytelling!)\n\nEverything by E. Nesbitt; Five Children and It is a perfect place to start \n\nIn Grandma’s Attic series by Arleta Richardson\n\nThe Fabled Stables series by Jonathan Auxier\n\nBetsy and Tacy series\n\nHow to Train Your Dragon series (so much better than the movies!!)\n\nThe Year of the Book and series by Andrea Cheng\n\nThe Incorrigible Children of Ashton Place series\n\nThe Green Ember and series by S. D. Smith\n\nNathan Hale’s Hazardous Tales are great non-fiction",
            "Check out Chris Colfer’s “Land Of Stories” series. Three books telling the story of some children who get swept away into the fantasylands of their favorite stories and have to help characters and find their way back home. *The Wishing Spell* is the first in the series. ",
            "Gordon Korman was a fav when I was young",
            "I’m pretty sure I read The Westing Game at that age. And Little House on the Prairie books.",
            "I started to read Tamora Pierce at that age, who is probably to date the author who had the biggest impact on me. The protagonists of her series Circle of Magic are around your niece's age. There are serious themes in her work but they're handled in a way that's a lot more healthy than Harry Potter imo.\n\n\nThere's an Arthurian series that was great, too. The Squire's Tale by Gerald Morris, and I think he's since put out a series for younger kids.",
            "T. Kingfisher’s A WIZARD’S GUIDE TO DEFENSIVE BAKING.  (I recommend everything by T. Kingfisher, but some of her books might suit your niece better in another couple of years.)\n\nDiane Duane’s Young Wizards series—at least the first three books.\n\nMadeleine L’Engle, A WRINKLE IN TIME and sequels, with a caution for heavy religious content if that might be an issue.\n\nSeconding on Diana Wynne Jones and Susan Cooper, and for it-feels-like-magic-but-isn’t, L.M. Montgomery (Anne of Green Gables and other books).",
            "Inkheart might be the perfect book to start with, as there is a young female protagonist, the story revolves around books, and it has a very magical setting.  I'm in my 30s, and my copy is very weathered after seeing years of use.\n\n* also Tress of the Emerald Sea is a fun read as well, but I'm not sure at what age it is best read",
            "The Dark is Rising sequence by Susan Cooper\n\nWeirdstone of Brisingamen by Alan Garner\n\nI saw someone recommend Ronia the Robber's Daughter by Astrid Lindgren which is great - also look at her other books. \n\nThey're possibly *slightly* on the young side, but Tove Jansson's Moomin books are great fun. Lots of good characters in them.",
            "The best people to ask are booksellers and librarians. They tend to be in the know about what books kids are reading right now.\n\nOtherwise you get a ton of recommendations from people for books that they read as kids. \n\nFor chapter books that have been super popular lately, I always recommend the Wings of Fire by Tui Sutherland. A lot of kids have gone into withdrawals now that she seems to have taken a break after book 15. \n\nGrace Lin has a gorgeous new book coming out soon. She has a wonderful lyrical style with gorgeous hand drawn illustrations at the start of each chapter. She’s won a ton of awards for her earlier stuff too. \n\nMy niece is a little older, but she blazed right through the Onyeka books by Tola Okogwu. A British Nigerian girl discovers that because of an accident in Nigeria before she was born, she’s inherited a mutation. Which for her shows itself in psycho-kinetic hair. Adventures happen. \n\nAmie Kaufman is super popular in Australia. But I’m not sure how much her books are available elsewhere? The Elementals was a great trilogy. Two street kids get caught up in a war when one transforms into a dragon, and the other into an ice wolf. Groups  that have been at war for years. \n\nJessica Townsend’s Nevermoor books are just as popular with the adults as the kids. Book four just dropped and it’s been selling like crazy.",
            "All the Little House books but do them in order. They get progressively more mature as Laura Ingals grows older. \n\nAnything by Madeliene L’Engle. \n\nAny Margarite Henry book you can find. Misty of Chincoteague is a great place to start. \n\nThe Wind in the Willows. \n\nPippy Longstocking \n\nThe original Doctor Doolittle books \n\nRoald Dahl. \n\nThe Little White Horse\n\nBlack Beauty \n\nSwiss Family Robinson",
            "Island of the Blue Dolphins",
            "The Rescuers and The Borrowers by Mary Norton. Two wonderful series- The Borrowers are best. Chronicles of Narnia. Also Arthur Ransom's Swallows and Amazons. Enid Blyton's Famous Five.",
            "The Phantom Tollbooth",
            "Stig of the dump, Carbonel and Green Smoke. The lion The witch & the wardrobe books. All fairly old so may be hard to find.",
            "I absolutely adored Wendelin van Draanen's Sammy Keyes series when I was her age.\n\nAlso, Ronia, the Robber's daughter by Astrid Lindgren is a phenomenal book.",
            "Pages & Co series by Anna James\n\nThe Strangeworlds Travel Agency series by LD Lapinski\n\nAnything by Katherine Rundell\n\nAnything by Katherine Webber\n\nThe Mapmakers by Tamzin Merchant\n\nAnything by Abi Elphinstone",
            "The Spiderwick Chronicles by Holly Black and Tony DiTerlizzi: Fairy folklore-based fantasy for your niece’s age group. Technically illustrated, but in a much more fancy way than what she’s probably used to and with a lot more “exotic” mythological creatures than other books (I’d never heard of a pooka before reading these).\n\nSir MacHinery by Tom McGowen: Dwarves mistake a robot for a Scottish clansman when they misread the label (machinery) on the box he came in, and get him into all sorts of crazy adventures while trying to fulfill their impression of him as a fearsome knight. Very much a comedic fantasy, but still a magical adventure nonetheless.\n\nThe Fairy Rebel by Lynne Reid Banks: A fairy reveals herself to a human family in defiance of her evil queen’s edict. A darker fantasy story, but still kid friendly. If your niece has ever shown any interest in Westerns, the same author wrote The Indian In The Cupboard about a magical cupboard that makes action figures (many of which are cowboys and Indians) come to life.\n\nThe Hobbit by J.R.R. Tolkien: I’d hold off on Tolkien’s other stuff till she’s a little older, but 9 is about the right age for his first novel. The writing style is a bit old fashioned, though. Also, there are exactly zero female characters so it might not keep the interest of a female reader. The Lord Of The Rings I’d say is more for 12 years old and up, and The Silmarillion is for 15-16 and up (darker, more mature themes and more graphic violence, especially in The Silmarillion).\n\nThe Plant That Ate Dirty Socks by Nancy MacArthur: A boy about your niece’s age acquires magic beans that when planted become enormous, voracious, talking plants. One of the funniest books I read in elementary school, it’ll crack her up.\n\nBunnicula by James & Deborah Howe: Comedy (stay away from the 1982 movie though, it’s much scarier) about a dog and cat trying to protect their humans from the newest pet in the household: a vampire rabbit. It’s harmlessly goofy and therefore a good way to ease her into horror if that’s something anyone wants to happen.",
            "When I was that age I adored the Paddington Bear books. They introduced some fairly sophisticated situations, like an auction at a fancy auction house. I was an avid reader and went through those books in record time. They used to make me laugh till I cried. I also read some more advanced books because I was bored and just read whatever my Dad had on his bookshelves, like The Voyage of the Beagle and Children's Complete Abridged Shakespeare. This was also around when I read the Narnia series, Thimble Summer, Harriet The Spy, Octagon House, Roller Skates by Ruth Sawyer, Little House On The Prairie, Strawberry Girl by Lois Lenski.",
            "Ramona series by Beverly Cleary",
            "The Wings of Fire series by Tui T Sutherland is worth looking into.  I only discovered them as an adult, but I would have adored them around that age too.  In a sentence, the books are about young dragons seeing something wrong with the world and deciding that it shouldn't be that way; there are a lot of very healthy approaches to complex issues.",
            " ursula k le guin!! i remember reading catwings and wizard of earthsea around that age",
            "Tamora pierce! Female heroines that kick ass! Mostly starting around her age group as well",
            "I think all of Gail Carson Levine (Ella Enchanted’s author) would be great as well! \n\nThe song of the Lioness by Tamora Pierce and her other series as well. \n\nFor a more recent fun magical adventures Amari’s Supernatural Inverstigations by B.B. Alston",
            "The Enchanted Forest Chronicles by Patricia C Wrede! The first one is called Dealing with Dragons",
            "Holes!",
            "Warrior Cats were a huge hit in this house",
            "A series of unfortunate events, Percy Jackson & the olympians, Junie B. Jones, The magic treehouse, the tail of Emily Windsnap, Warrior cats, Artemis Fowl, Harry Potter, the Kane chronicles, the ranger’s apprentice, Disney Fairies Tales of Pixie Hollow, Leven Thumps, The Secrets of Droon, Fairy Realm, Roald Dahl’s works, The Chronicles of Narnia, Wizard of Oz series, The Spiderwick Chronicles, The Guardians of Childhood, Treasure Island/The Sea Cook: A Story for Boys. \n\nMaturity varies; all suggestions subject to parental discretion, of course.",
            "A Series of Unfortunate Events \n\nOne of my favorites!",
            "Michelle Harrison, A Pinch of Magic series\n\nRick Riordan, Percy Jackson series - she’ll love this, it’s great for her age and stage. \n\nCressida Cowell, Wizards of Once series",
            "What about The Spiderwick Chronicles?",
            "My daughter loved these at that age. She also loved the Pamela Butchart books. They might be a bit on the young side for your niece, but they're really funny, especially recommend To Wee or Not to Wee.\n\nThe Scarlet and Ivy books by Sophie Cleverly\nLockwood & Co by Jonathan Stroud \nA Series of Unfortunate Events by Lemony Snicket\nAnything by Roald Dahl\nMurder Most Unladylike series by Robin Stevens\nPercy Jackson books by Rick Riordan",
            "My fav series when I was younger was called Dragon Slippers by Jessica Day George. I loved it and thought the way the dragons were done was so creative.",
            "The extremely inconvenient adventures of Brontë Mettlestone\n\nThe phantom tollbooth\n\nThe Laura ingalls wilder books",
            "The Tiffany Aching books by Terry pratchett - they are written to be like Harry potter for girls, Tiffany is about ten when she sees her little brother abducted by Jenny green teeth and because the grown ups dont believe her she goes into fairy armed with a cast iron skillet, this is a series where she has a pet cheese that bites\n\nThey start with her at about ten and end at eighteenish when she graduates as a witch in the shepherds crown.\n\nThe first one is the wee free men",
            "Beverly Cleary! My boys (10&6) and I listened to the Ramona and Henry Huggins collections during a road trip. It was a lot of fun.",
            "Friday Barnes\n\n\nJunie B Jones\n\n\nJudy Moody\n\n\nTales of a 4th Grade Nothing\n\nRamona\n\n\nNanny Piggens\n\n\nWings of Fire\n\n\nBabysitter Club Graphic Novels",
            "Tamora Pierce's  \"Alanna: The First Adventure,\"",
            "Anne of Green Gables \nSecret Garden \nLittle Princess \nBaby Sitters Club \nAnything by Rick Rhiordan Presents \nAnything by Rick Rhiordan",
            "Roald Dahl is a must read.  I'd suggest other classic authors for elementary ages like Beverly Cleary and Judy Blume.  The Chocolate Touch was also a fantastic book.",
            "Ramona. ",
            "When I was that age, I was all about the Baby-Sitters Club! My niece is 7 and loves the younger spin-off.",
            "I loved the Babysitters Club and Boxcar Children at that age. Magic Treehouse too for the magic aspect. \n\nRamona Quimby books hold up, as does the Amber Brown series. Both really relatable series for little girls! \n\nBill Wallace was a favorite author too and my second grade teacher often read his books aloud to us (she knew him personally). I still love to reread those as an adult. Some of them may be a little scary, and some have sad themes, but they’re really excellent and I highly recommend them. Most if not all of these have boy protagonists. \n\nAlso I recommend Lemons by Melissa Savage. I read it a few years ago and I wished it had been published when I was a kid. One of the best middle grade novels I’ve read. It’s about a girl (about 10yo I think) who loses her parents and goes into foster care (I think a kinship placement with an uncle?) and searches for Bigfoot.",
            "I was a huge reader as a kid and I was also \"that horse girl\" in school, so a lot of the books I read at that age were about horses! If she has any interest in that sort of thing there are a few really great series for young readers.\n\n- Thoroughbred\n- The Saddle Club\n- Pony Pals\n- Heartland\n- Phantom Stallion\n- Misty or Chincoteague\n- Spirit: Stallion of the Cimarron\n\nI also loved a variety of other books, here are some I can remember:\n\n- Harry Potter (I think she's at a great age to start this, I was around 9 when I started reading it and I had the most magical childhood because of it. I'm still a huge potterhead to this day.)\n- The Hobbit\n- Guardians of Gahoole series\n- The Unicorn Chronicles \n- Nancy Drew\n- A Series of Unfortunate Events\n- Ella Enchanted\n- The Princess Diaries\n- The Chronicles of Narnia",
            "Okay I actually think I might be more equipped to answer this than I thought I was. I started reading YA way to early 😂\n\nI 100000% am gonna have to rec The Magic Treehouse books, there are a bunch of them and they’re so fun!!! Brother sister duo going on all kinds of adventures!! They literally have one called Dinosaurs Before Dark 😭 my brother and I user to love them \n\nSimilarly anything by Rick Riordan. His books are just soooo big they can feel daunting even to me now. I feel the same about all large books, even Chris Colfers series which I just bought 😂\n\nThere’s also a series called Tales from Alcatraz. I read some of the Al Capone ones when I was around that age and I remember liking it. \n\nWonder by RJ Palacio also might be a good read for her around this age or a little older. I think I read that around 10 and narrator is about 10 too.\n\nI also saw people rec’d Nancy Drew, Bunnicula, Mrs Peregrine, unfortunate events, Roald Dahl and I totally agree!!!!!!",
            "Series of Unfortunate Events",
            "Percy Jackson, Anne of Green Gables, Sisters Grimm (LOVED this one in elementary school!!!), Ella Enchanted, Mouse and the Motorcycle series by Beverly Clearly, any books by Judy Blume, Poppy by Avi",
            "Georges secret key books are good as well as being educational \nMeg Cabot books in general, though just do a quick skim of some of them\nThe hobbit/lord of the rings/austen books/jane eyre/the secret garden/little women might be a bit dense but they’re favourites for a reason \n\nOther than that, holes, his dark materials, Artemis fowl , the trylle trilogy, geek girl series, animorphs, Percy Jackson (and extended universe), ink heart series, seven tears into the sea, looking for jj, twinmaker \n\nKeep in mind that the more she reads the more likely it is that she’ll seek out books with more complex or dark themes, so it’s important that she understands how to recognize things that make her uncomfortable /she’s not ready for without assigning morality to it (kids famously love doing what they’re told not to)\n\nOne last point, please keep in mind the current optics of supporting j k rowling’s work. In the past few years she has gained a reputation for spreading misinformation and targeting vulnerable groups, especially LGBT people, and has made it clear that she views support of her work as support of her actions and uses the money she earns to support hate causes. If you’d really like to share Harry Potter with her, then I suggest buying second hand",
            "The Guardians of Ga’hoole series by Kathryn Lasky.",
            "percy jackson",
            "The Golden Compass!",
            "Mrs Frisby and the Rats of NIMH by Robert C O'Brien\n\nThe Prydain Chronicles by Lloyd Alexander",
            "It's an old series but I loved Nancy drew mysteries. Felt grown up reading them as a kid about her age and they tame/clean",
            "the warrior cats series is SOO LONG and so so good. there's some magical aspects to it here and there (especially later in the series when some characters actually have powers). i am 25 and still claim it's my fav book series just bc they meant so much to me for so long (and still do!)",
            "All of the Anne of Green Gables books. All of the Little Women books. I read all of my mom’s Penny Parish books and Ethel M Dell books at that age. My kids read all of the Trixie Belden books and the Ranger’s Apprentice series s well as everything by Rick Riordan.",
            "My child really liked the diary style books as well and some other books she has liked that are more “books” are the Princess in Black series, Thea Stilton and Geronimo Stilton books, and the Dragon Girls books.",
            "Judy Blume! Go old school not this new school rubbish",
            "Any book by Beverly Cleary or Andrew Clements, Stuart Little by EB White, Pippi Longstocking",
            "Try- \nFrom the Mixed-Up Files of Mrs. Basil E. Frankweiler (about siblings who run away and live in the Met) \nStargirl\nAny Newbury Award book\nNonfiction",
            "When I was that age, Harry Potter was all the rage. \n\nHowever, I also really loved _Inkheart_ by Cornelia Funke, _The Neverending Story_ by Michael Ende, and _City of the Wild Beasts_ by Isabel Allende.",
            "As someone who loved Magical Girls at age nine, The Girl Who Could Fly By Victoria Forester",
            "A Series of Unfortunate Events, which had my kids spellbound at that age.\n\nMaybe Deltora Quest if she likes magic stuff. And Rangers Apprentice, although I can’t remember how suitable that is for an 8yo - I think my daughter wasn’t much older than that when she read them, and she only just got rid of her copies at the age of 26 lol\n\nOh! And Angie Sage’s Septimus Heap books are delightful.\n\nHonestly there are so many amazing books out there for kids I’m a little jealous they weren’t around in the 70s when I was the right age. Doesn’t stop me reading them though 😁",
            "If her parents are fans of non-fiction, perhaps some accurate historical fiction written for her age group would be good.  Marsha Forchuk Skrypuch writes historical fiction about children who live through things like WW2.  She's a children's librarian, so the details are age-appropriate and not traumatic, while still being historically accurate.  She also includes some historical background info to help children understand how things like this can happen in a society.  As a bonus, many of her main characters are girls.",
            "Oldie but goodies are NANCY DREW Mysteries and CHERRY AMES , nurse.",
            "Not ‘Big Girl’ book, but wonderful story. “The Eyes and the Impossible,” by Dave Eggers. This has become my favorite (audio)/book of ALL TIME! The audiobook is narrated by the main character; a talking dog. He and his friends, seagulls, racoons, bison, goats, horses, birds of other kinds, squirrels and other land, sea and air animals and fo wl live in a huge parcel of park/forest suttounded by a body of  water, face everyday challenges. One day the dog concocts an almost impossible plan. Will he succeed? I’m not telling.",
            "Any thing by Brandon mull is safe for that age range. I would recommend starting with candy shop war or fable haven. The first is (slightly) more grounded fiction still magic and a touch of time travel.  while the latter is dragons, fairys,, and things that go bump in the night. Could get scary though depending on her tolerance.",
            "I’m so sad no one has recommended the Penderwicks books. They are so fantastic. Almost like a modern little women, with four female siblings, having realistic adventures. A lot of what is here is fantasy and sci-fi so this would be if she is not into those genres.",
            "My top choices would be Ms Peregrines Home for Peculiar Children and A Series of Unfortunate Events, they both have movies as well and the book series are amazing too!",
            "Judy Blume\nThe Great Brain Series\nSome books by Norma Klein (some are more teenage/young adult)",
            "Catherynne M Valante’s Fairyland series is honestly my go-to for this age! It starts with The Girl who Circumnavigated Fairyland in a Ship of her Own Making. \n\nIt’s very Alice in Wonderland but with the underlying story of a girl who grows in independence. It’s great for building vocabulary while also being everything a children’s book should be.",
            "Percy Jackson! Those books got my sister into reading and they honestly hold up as an adult. Totally a good one to look into!",
            "Dark is Rising series, \nPern books by Anne McCaffery, \nNarnia, \nThe Hobbit,",
            "If you can find them, all of the Ralph Moody books were great-Little Britches, Man of the Family, Mary Emma and Company.. there were 7 or so. Based on Ralph's life growing up in early 20th century Colorado\n\nAlso, the Chronicles of Narnia, of course",
            "My son read Harry Potter at that age. He also loved Percy Jackson",
            " Chronicles of Narnia, Anne of Green Gables, Harry Potter.  Kenneth oppel has some good series too, eg. airborn. Nim’s Island.",
            "Keys to the kingdom by Garth Nix. Smaller and more accessible to the age than harry potter\n\nEdited to add: The tale of Emily Windsnap ( A girl who discovers she is half mermaid)",
            "Lunar Chronicles series by Marissa Meyer (fairy-tale meets sci-fi)",
            "Percy Jacson and the Lightning Theif by Rick Riordan. Amazing series, great writer. One of my all time favorites",
            "When I was her age, I read Jurassic Park by Michael Crichton. You might see if she’s into that. Also really dug Roald Dahl. There’s also the Sabriel young adult series by Garth Nix for fantasy.",
            "*The Chronicles of Narnia*\n\n\n\n\n*The Hobbit*\n\n\n\n\n*Wayside School* series\n\n\n\n\n*The Doll People* series\n\n\n\n\n*The Princess and the Goblin*\n\n\n\n\n*Pippi Longstocking*\n\n\n\n\n*Pollyanna*\n\n\n\n\nThe Oz books are pretty good, too, and I remember I absolutely *loved* Mary Poppins when I was a kid — the characters do things like go visit the constellations or get kidnapped by the people painted on plates. 🥴 Also, if she can handle some tragedy, *A Little Princess* is amazing.",
            "Impossible Creatures by Katherine Rundell\n\nGreenwild by Pari Thomson\n\nThe Wingfeather Saga series by Andrew Peterson",
            "The Wee Free Men by Terry Pratchett\n\nAnd if she likes it,  there is more.",
            "Warriors series - about clans of feral cats.\nA Wrinkle in Time \nIsland of the Blue Dolphins\nMrs Frisby and the Rats of NIMH",
            "I loved James Herriot’s books. They are not written specially for children, all the main characters are adults.",
            "Goosebumps",
            "Don’t forget the classics",
            "My favourite middle grades are —\n\nThe Leviathan Trilogy by Scott Westerfeld (it has illustrations, but it’s very good - there is an animated trailer if you want to get the vibe)\n\nThe Mapmaker’s Trilogy by S.E. Grove\n\nArtemis Fowl by Eoin Colfer\n\nLockwood & Co by Jonathan Stroud (this is very good but a little spooky)\n\nWhen she gets a couple of years older —\n\nThe Bartimaeus series by Jonathan Stroud\n\nThe Thief series by Megan Whalen Turner",
            "I’d drop everything and give her a classic. They kind of avoid them in school now and it’s such a shame, I think it really stunts bright kids’ reading capability. \n\nA Little Princess is a great place to start, it’s gripping and not too difficult. The Chronicles of Narnia are short, easy reads as well, but more challenging than the Wimpy Kid books. Little Women is wonderful but might be too slow if she’s not used to big books. My kid dropped it in the middle and I’m still a bit heartbroken.\n\nKatherine Rundell is completely wonderful, and unlike anyone else writing for children now. Wolf Wilder made a big impression on my then-8 year old.\n\nDiana Wynne Jones wrote tons of fantasy for children and it’s all good. Fast-moving, well-plotted, not too heavy.\n\nIf you want something funny, the Arabel and Mortimer books by Joan Aiken are fabulous.\n\nI notice all these are British! There are great American and Canadian children’s books too…Anne of Green Gables of course, and I remember liking Caddie Woodlawn, The House of Dies Drear, and The Sherwood Ring for historical stories. The Ramona books are great too, funny and real.",
            "spiderwick chronicles!",
            "Heidi, Black Stallion, Cricket in Times Square, Stuart Little, The Borrowers, Nancy Drew series, 5 Little Peppers and How They Grew, Goosebumps, The Little Princess, Wrinkle in Time, Mary Poppins series",
            "Alanna by Tamora Pierce (and the other 3 books in the series)",
            "Percy Jackson",
            "So many of my suggestions were already mentioned but the Wings of Fire series was my daughter’s favorite for awhile.",
            "Try the Inkheart series by Cornelia Funke. They're even about a girl who's a bookworm!",
            "Since I’m old I’m part of the cohort that jumped to adult books around age 11. I read a lot of classics and also a lot of “trash” like Peyton Place, Valley of the Dolls, The Carpetbaggers, etc.  I know that those who came later were widely exposed to the Flowers in the Attic books. I learned some stuff (of different levels of validity) about sex and drugs from the books with the gaudy covers but to be fair  I got some weird and scary vibes from assorted classics. Do older children really benefit from having their reading so carefully kept in the “safe” written for kids or more than 100 years old lane? I’m not  thinking so much of the 8 year old who is referenced in the post as middle school aged children since these questions come up a lot.",
            "City of Ember! The Giver! Both have series that are very entertaining",
            "If there is any interest in graphic novels, The Babysitters Club graphic novels are excellent.  \nMy smart, book-loving almost nine year old adores both the older kid version and the 'little sister' version (written about an 8-yr old).\n\nAlso anything by [Raina Telgemeier ](https://goraina.com/)(who does a few of the babysitters ones as well). Smile, Sisters, and Guts are read over and over in our house. My boys loved them as well.\n\n[Elise Gravel](https://elisegravel.com/en/) also does some great stuff that is quirky and silly but targeting around this age. My daughter enjoyed the Olga series, but we are also into the bug and mushroom books (non-fiction).\n\nThese are all a level up in complexity from the Wimpy Kid books.",
            "The Raina Telgemeier books are fabulous for tweens. They are about middle school girls. \n\nRick Riordan - the Percy Jackson series \n\nThe Wings of Fire series (comes in both graphic novel and regular print)",
            "Her elementary school librarian should be able to direct her to something that would interest her.  I started on light chapter books on biographies and a whole new world opened up to me.  Nancy Drew was my sneak reads.",
            "Jurassic Park was my first “grown up” book. I was maybe 10? I loved it then and love it now. It’s kid appropriate, even tho it can get a little complicated with the science stuff at times. But not so much that it’s unenjoyable if you don’t understand it all. I wish I could read it again for the first time!",
            "Harriet the Spy",
            "How about Nancy Drew?",
            "Check out Tamora Pierce’s books!",
            "Maybe Jane Austen?  It’s for adults, but from what I recall there is nothing scandalous or explicit.",
            "My favorite series at that age was The Tail of Emily Windsnap (not a typo, a mermaid pun). Adventure/mystery. It felt “older” at that age, lol",
            "Anne of Green Gables!",
            "Don’t forget about the classics! They’ll stretch her vocabulary and teach her about different eras in time, while still protecting her from gratuitous language, violence or sexual situations. \n\nBlack Beauty, Little Women, Little Men, or any Louisa May Alcott books, The Boxcar Children series, The Little House series, Anne of Green Gables, Biographies geared for children, A Little Princess, Lemony Snicket, etc…\n\nYour local librarian will enjoy suggesting books!",
            "Everything by Eva Ibbotson! Charming and fun stories, many with magical elements. \n\nSharon Creech is another favorite author, especially Ruby Holler. \n\nThe Birchbark House by Louise Erdrich is a great historical fiction choice!",
            "i capture the castle!",
            "Rowan of Rin by Emily Rodda and Dragon Keeper by Carole Wilkinson are brilliant stories for that age, especially if she’s into fantasy and adventure. maybe the Narnia series too?",
            "Dragon's Green - Scarlett Thomas\n\nAmari and the Night Brothers - B.B. Easton",
            "You may have some luck with YA books that are also enjoyed by adults.  Maybe the folks in r/YAlit will have suggestions. \n\nI recently read a wonderful YA book that didn’t have dumb dialogue and was well written. It was a very unique story that deals a lot with empathy and understanding. \n\n{{Insignificant Events in the Life of a Cactus by Dusti Bowling}}",
            "When I was her age I loved the book ballet shoes by Noel Streatfeild. It definitely has Little Women vibes all over it but it might be a little More suitable for her age.",
            "Spy Kids series by Stuart Gibbs, super fun, still very much like a Diary of a Wimpy Kid vibes but full on chapter books with no illustrations.\n\nAnd if for whatever reason they're into Audibles, Netherwings by Django Wexler was 😻 human kids discovering magic worlds, dragons and dragon riders, magic school and adventure as they train and defend themselves.",
            "Ronia the robber's daughter - Astrid Lindgren \nI've always loved Swedish children's media, because they take children so seriously. And Astrid Lindgren is the best. She even is on their 20 kronor bills.\n\nThe cat who came in off the roof - Annie MG Schmidt  \nThis is the mother of Dutch childrens literature, absolutely love her books. I am Dutch and grew up with all her stories. \n\nMomo - Michael Ende (also: Neverending story)\nThis is originally German and even though it is 50 years old it doesn't feel that at all.",
            "I loved the Enid Blyton boarding school series at that age, the Naughtiest Girl, Mallory Towers etc",
            "This is what my parents did. \n\n\nThey would take me to a library or a book store and let me select the book that catches my eye. Since I was only allowed on the children, young reader section,they didn't have to worry about me reading adult books.  They also used to blame the librarian saying that is his rule. \n\n\nThat way I read a variety of books based on what caught my eyes - Harry Potter series, Narnia, david copperfield, Oliver Twist, Tom Sawyer, The Great Expectations etc.  \n\n\nMake it an interactive bonding activity with her and let her choose , I cherished it and I hope she will too.",
            "You have a lot of great recs already, but I also wanted to throw in the Ranger’s Apprentice series by Jon Flanagan! I loved these books around her age. It’s adventure and historical fiction, well written and clever.",
            "So many great recommendations here!!\n\nSome of the classics like: The Little White Horse, Chronicles of Narnia, Little Women, Ballet Shoes, Anne of Green Gables, I Capture the Castle etc were ones I devoured over and over again when that age.\n\nI also second the Horrible History books as an entry to non-fiction. The one about Isaac Newton is 🤌🏼\n\nThen I also really loved some modern young fantasy books like the Inkheart trilogy and Pirates!",
            "Books that ignited my love for the fantasy genre when I was a child:\n\n*The Neverending Story* by Michael Ende\n\n*Momo* by Michael Ende\n\n*The Letter for the King* by Tonke Dragt\n\n*The Song of Seven* by Tonke Dragt\n\n*Dragon Rider* by Cornelia Funke\n\n*The Magician's Nephew* by C.S. Lewis (the prequel to *The Lion, The Witch and the Wardrobe*)",
            "My daughter is 7 and we are reading The Princess and the Unicorn. There are six books and it’s a cute story has some illustrations but not full page, it’s like a unicorn in between paragraphs.",
            "Dear America series. It is historical fiction.",
            "One of the first “big girl” books I read when I was around 8 years old was actually “Freak Friday”. I distinctly remember not knowing how to pronounce the name “Annabel” though lol",
            "Deltora Quest!",
            "At 8 my daughter was reading the Elric Saga.\n\nSome Classics might go over well.\n\nHeidi\n\nSecret Garden\n\nToby Tyler\n\nMaybe try some of those and see how she gets on?",
            "Atwood.",
            "Another author- Maria Parr: Adventures with Waffles and Lena, The Sea, and Me are delightful, as is Astrid the Unstoppable. Hilarious stores but meaningful as well.",
            "Two more with smart-girl protagonists are Emmy and the Incredible Shrinking Rat series, and the Very Nearly Honorable League of Pirates series. (I think book 1 is called Magic Marks the Spot; author is Caroline Carlson)",
            "Animorphs! I started reading that at her age and my reading level was a few years older.",
            "When k was younger I read a lot of Sabrina the teenage witch books. I don’t know what age they were for. I also read full house books. \n\nBaby sitters club. Baby sitters little sister.\n\nAlso the Bailey school kids",
            "Sophie’s world, maybe Coraline, the invention of Hugo Cabret",
            "I was around her age when the Artemis Fowl books started coming out and I loved them. I’m in my 30s and still do. I also read and loved the Narnia books around her age too. The Wizard of Oz and the Percy Jackson series might be good too. \n\nThe best thing ever was just to browse the library and pick books based on their covers (yes, I’m one of those people) and check out as many as I could carry. (I use the Libby app now.)",
            "The Mysterious Benedict Society, Percy Jackson series, Warrior cats books, and Spiderwick chronicles were my favs when I was ~8-11 years old.",
            "Mysterious Benedict Society\n\nAnything by Wendy Mass.  the Candymakers is especially great. \n\nLeon and the spitting image \n\nI actually really enjoyed all the American girl doll books around that age. Each doll has an associated book series and it was nice historical fiction for me at the time\n\nThe babysitters club\n\nThe boxcar children",
            "If she starts the Harry Potter books that would be a good start. It’ll take a while to read all 7. My 9 year old daughter is on the third one now. I think it’s a good series to transition to more grown up books.",
            "Dragon of the lost sea by lawrence yep. He also wrote some of the american girl doll books that were recommended. And some amazing historicals.",
            "Zoey and Sassafras is a nice series that’s an in-between. There’s magic and science and I like them as an adult reading to a kid. ",
            "You might also consult with those who are raising her. They might have some good suggestions and be happy you're spending the money instead of them!",
            "Some of my favorite series were The Incorrigible Children at Ashton Place, The Mysterious Benedict Society and The Sisters Grimm",
            "The Nevermoor series, Worst Witch might be a bit young for her but still fun. Artemis Fowl, maybe Skulduggery Pleasant (might be a little bit old for her I guess but worth a look). \n\nI also read a tip that for advanced readers, classics are useful as there’s not usually age-inappropriate content but they’re more challenging to read.",
            "Take her to the library or bookstore and let her explore!! But also this is the age where I got hooked on Nancy Drew and the Hardy Boys.",
            "Little house books",
            "Babysitters’ Club \n\nSweet Valley Twins",
            "Amari and the Night Brothers by BB Alston\n\nThe Descendants series by Melissa de la Cruz(especially if she’s seen the movies. The books are prequels and in-between).\n\nA Little Princess\n\nEdge of Extinction by Laura Martin",
            "Island of the Blue Dolphins by Scott O’Dell",
            "Dig into some older female fantasy authors that don’t get as much attention now, like Patricia McKillip. I have a niece in the same position and I recommended to start with The Alphabet of Thorns.",
            "I’d take her to the library and pick anything she wanted to try",
            "Enid Blyton was my favourite author as a kid, I was in love with the Magic Faraway Tree.",
            "The Anne of Green Gables series! She’s at the perfect age for a bookworm to start diving into this  amazing, wonderful world.",
            "A lot of classics in these recs! If she is just transitioning from graphic novels to full bore novels, smaller/shorter books she can finish quickly may be helpful. Some series my kids have enjoyed are:\n\nZoey and Sassafras\nMagic Treehouse\nHow to Train Your Dragon (series is very different from the movies)",
            "Brava for helping to encourage a reader!\n\nI was like you - graduated to adult books when I was about ten and no one ever monitored what I brought home from the library.  \n\nSo...let your niece explore \"big girl\" books. If she picks up some crap, it's not the end of the world. It will educate her on what is good and what she wants to read. (One of mt first \"big girl\" books was a bio of Jean Harlow. My eyeballs almost fell out of my head. But I survived.)\n\n\nHave you tried the \"Half Magic\" books by Edgar Eager? A little bit dated but lots of fun.  Also try some YA biographies of people and ease her into nonfiction.\n\nTell your niece I said \"Have a great time exploring!\"",
            "These were (and still are) some of my favourites:\n\nA Handful of Time by Kit Pearson. A 12-year-old finds a pocket watch that can send her back in time to the summer her mother was 12.\n\nThe Guests of War trilogy by Kit Pearson (The Sky is Falling, Looking at the Moon, The Lights Go On Again). It follows the story of two children from a small village in England who are sent to Canada for the duration of WWII.\n\nAnything by Judy Blume. She's such a treasure.",
            "My niece is 7 and is currently doing really well with the Narnia series, but I also got her these books called Inspiring Stories for Awesome Girls and she really seems to love them.",
            "A Wizard of Earthsea by Ursula LeGuin",
            "Tamora Pierce!!!!!\nCircle of Magic would be perfect",
            "Charlotte’s Web\n\nThe Pippi Longstocking books",
            "One of my favorite fantasy books from a younger age (maybe a liiiiittle older than her) was “The Blue Sword” by Robin McKinley! It has a female protagonist, and while there’s some small slightly romantic moments, it really doesn’t deal with romance whatsoever. Just pure fantasy goodness!",
            "Has she already read Beverly Clary and Judy Bloom?",
            "At her age, I loved reading \"A series of unfortunate events.\" It's really funny and teaches a lot of cool words and concepts.",
            "The Litttle Broomstick by Mary Stewart was my favourite book when I was around 10. Also Double Spell (sometimes called Twin Spell) by Janet Lunn, if you can find it. (I also was a book-obsessed nerdy girl, about a thousand years ago.)",
            "[removed]",
            "Secret Garden, The little princess, the hunger games series, The Catcher and the Rye, and The Lion the Witch and the wardrobe are some good ones to start with.",
            "These are all great suggestions, and I don't have much to add except for The True Confessions of Charlotte Doyle by Avi, which I was fully obsessed with at that age. Avi's other work is fantastic and worth picking up, as well. \n\nLois Lowry is another author with a whole list of hits to choose from, and many of her books feature female main characters. \n\nI've seen The Hobbit suggested a lot, and I did enjoy that as a kid, but it also dragged for me quite a bit at the end. My mom finally suggested I skip the chapter I found boring and see if it got better after that, which it did. I hadn't known you could just do that. Anyway, if she reads it, she will probably enjoy it, but you might check in with her.",
            "A Wrinkle In Time was a favorite of mine!",
            "House in the Cerulean Sea!",
            "Anything by Beverly Cleary",
            "Try the books of Edward Eager, like \"Half Magic.\" They are from a long-ago time but eternally great reading IMHO.",
            "If they’re still in print, I’d recommend Bruce Coville’s books, specifically the he My Teacher is an Alien series and The Monster’s Ring. Also, they may be a little old fashioned for her, but I loved The Boxcar Children at that age.",
            "I Survived series",
            "Angie Sage: Magyk etc (Septimus Heap books)\n\nEoin Colfer: Artemis Fowl etc\n\nCornelia Funke: the Inkheart trilogy",
            "The Warrior Cats series",
            "Terry Pratchett has several YA books- Only You Can Save Mankind and the rest of the Johnny Maxwell books, The amazing Maurice and his Educated Rodents (a take on the Pied Piper of Hamlin), and his Bromeliad Trilory (Truckers, Diggers, Wings). There’s also the Tiffany Aching books but I always hesitate to recommend them because the rest of the series is so rich and these were among the very last books he wrote. Worth the journey to get to them. \n\nWould also suggest a collection of classic short stories. The different use of language could be a lot of fun for her.",
            "Mistborn, get her into Sanderson early",
            "I really enjoyed The Magician's House quartet, by William Corlett, when I was that age. The first book in the series is called The Steps Up the Chimney.",
            "You are trying to recommend “nonfiction” to a child that idolizes stories like “Harry Potter” and “magical girls”?\n\nYou certainly do have a divide between what the parents wish for and what this child is excited by.\n\nTerry Pratchett - “The Wee Free Men” and “The Amazing Maurice”. The other books by this author are meant for older readers, but her parents might appreciate the subliminal messaging.\n\n“13 Things Mentally Strong People Don’t Do” - Amy Morin… this book is completely aimed at adults, but you said you wanted this child to grow, so it’s ok if she doesn’t understand the whole book immediately.\n\n“The Help” is a book as well as a movie.\n\n“Lord of the rings” is not “real” but it is a “cult classic” although I’m not sure it still will be by the time she is old enough that everyone has had the option to waste hours on these and then throw an overnights party to exclaim over the cinematic effects of the movies. Being able to discuss cult classics with other readers is a good thing.\n\nThe trouble with 9 is that I don’t want to recommend books with “dark” experiences for this age group. People get hurt. That’s a fact of life. There’s only so much time that you want to spend on this…\n\nTamora Pierce I would recommend the “protector of the small” quartet, but while the other quartets are a delight, they are NOT “practical” until you get to the “Terrier” series and that is… perfectly appropriate if her parents ignore background slang about extramarital sex. The lack of practicality is mostly because Tamora Pierce put magic systems in the stories…\n\n“Black beauty” and “Misty” were more practical books than Pierce’s “immortals” quartet, but I still love that series.\n\nCheck if they still have a “Battle of the Books” club. If they do, the club reading list includes current award winning books that may not be what she would typically read, but there is a team quizbowl to win as motivation and if she can’t join a team, she can pretend to run a quizbowl against her family members, if they can also make time to read the books.\n\nI am trying to think of what else I could possibly give you that resembles reality and is meant for a 10 year old. It’s up to you if you actually want to give her “the sisterhood of the traveling pants” but to me they should NOT have put the episode with the camp counselor in that book, even if it was a real life possibility.\n\nI am not sure that I remember well enough what is in this book, but I was old enough to be able to read “Desperate Pastor’s Wives” by that age, although whether it can be recommended depends on your views of religion, because some things definitely went wrong in those women’s lives, but for me this was like talking to an adult and it helped a bit to understand what it is like to grow up. \n\nIt’s still one of the gentlest books I know for “real life”.\n\nThe rest of it is a grand adventure.",
            "Animorphs!!",
            "Definitely Coraline or The Ocean at the End of The Lane by Neil Gaiman if she’s a brave girl.",
            "My 9yo loved/binged:\nThe one and only Ivan (and sequels)\nOut of my mind (and sequels) \nWonder (and follow up(s))",
            "Percy Jackson series\nThe Tale of Emily Windsnap series \nThe Princess Diaries Series",
            "The Phantom Toll Booth, Winnie the Pooh, House at Pooh Corner, Beverly Cleary Ramona books, all the Mary Poppins books, Pippi Longstocking books",
            "Both my daughter and granddaughter read *Watership Down* at 8. My daughter is 40 now and it’s still her favorite book. My granddaughter and three of my grandsons tore through all the Harry Potter books when they were 8-9. They all enjoyed, ”The Life of Pi,” and two of them read “Lord of the Rings,”and were totally entranced by that world. \n\nTry these, and treasure the fact that your child loves books! It’s wonderful.My grandkids and I have a tradition. If they come to stay with me, we make bread, and curl up reading our books together. By teatime our bread is done and we use a cookie cutter to make cute little veggie (like cucumber-onion,radish, or watercress) sandwiches. As we have tea we tell each all about our books.",
            "The Percy Jackson books. \n\nOsmo Unknown and the Eightpenny Woods by Catherynne Valente - I actually recommend this to everyone because it’s such a good book.",
            "The Worst Witch series by Jill Murphy\n\nTerry Pratchett had some books for children (Truckers and its sequels Diggers and Wings).",
            "So many people recommending really old classics which are often great stories but don't have much in common with the world kids are living in right now.  And none of the other kids at school are reading those books.  There has been a renaissance in books for kids this age.  So many excellent stories out right now.  Go to a Barnes & Noble or similar bookstore and see what they have.",
            "Anne of green gables, the secret garden… these are “big girl books” that are classic for a reason!",
            "I started reading the works of Carlos Ruiz Zafón around that age and it truly changed my life. \n\nFor a 9yo I would get her any book from the Mist Trilogy, then “Marina” — I’d start with “The Prince of Mist,” but they are all independent novels, so whichever you prefer. They are all incredible!",
            "Swiss Family Robinson for both a classic and a great read. My daughter loved it at about 11 but it sounds like your niece would like it at a younger age.",
            "I started reading the warrior cats series at her age. Also Boones series, Nancy Drew series, the Among series [bit darker]",
            "Chronicles of Narnia \n\nOr - the complete opposite\n\nHis Dark Materials",
            "All of Sanderson \n\nRed Rising \n\nWheel of Time",
            "The Frog Princess series by E. D. Baker\n\nKendra Kandlestar series by Lee Edward Fodi \n\nHetty Feather series by Jacqueline Wilson. Most Jacqueline Wilson books tbh. Just be sure they’re the ones for younger readers \n\nMaybe the Little House on the Prairie series by Laura Ingalls Wilder\n\nThe Chronicles of Narnia by C. S. Lewis? I was about her age when I read my first Chronicles of Narnia book\n\nBack Home by Michelle Magorian\n\nMalory Towers series, St Clare's series, Famous Five series, Secret Seven series, all by Enid Blyton\n\nPercy Jackson series, Heroes of Olympus series, Trials of Apollo series by Rick Riordan\n\nThe Tripods series by John Christopher\n\n\nThese are the ones I remember that I haven’t seen mentioned yet",
            "Akata Witch by amnesia Okorafor YA magic-school in Nigeria",
            "Sherwood Smith,\n\nTamora Pierce,",
            "I was 8yo when I moved on to the babysitters club books - this was 30+ years ago, when Ann M. Martin was still writing the series. Pretty easy to find the books used.\n\nChris Colfer is a good one to look at, his The Land of Stories mini-series would be right up your niece’s alley. The series start out when the two main characters - twins named Conner and Alex - are 12 (iirc), and they age throughout the books. Honestly, the first two books are clunky, writing-wise, but Chris’s writing improves with the later books. Being she enjoyed the HP movies, I think she’d enjoy it.\n\nMay I also recommend the Miss Peregrine series by Random Riggs? It’s more YA-level. She may not be ready for Miss Peregrine, but it’s a great one to store in the banks for the future.",
            "The Arthur Ransome books (Swallows and Amazons series, 12 books.) Different from a lot of modern children's fiction, with no magic or superheroes but just children growing up in the north of England. I enjoyed them a lot at that age and read them to my own sons.",
            "The Ramona books!",
            "Can't recommend enough:  the Penderwicks series by Jeanne Birdsall.  Stories about a regular family doing regular things, they,'re contemporary books but feel like Louisa May Alcott.  The Charlie Bone and Septimus Heap series if she likes magic.  Similar to Harry Potter but a little less intense.",
            "Percy Jackson. The Babysitters Club. Eragon. \n\nYou could also try something like Goodreads and put in some of the books she's liked in the past to get suggestions. That way, parents can do some research on the book and see what people have said about them.",
            "Goosebumps! If she likes scary/ mystery. And I read Number the Stars and The Giver by Lois Lowry in 4th grade. Definitely more “grown up” themes.",
            "The Library of Ever by Zeno Alexander might be right up her alley.\n\nThe Wild Robot\n\nThe One and Only Ivan\n\nFlora and Ulysses \n\nThe Seventh Most Important Thing\n\nYou might look at books that won or were nominated for the Newbery Award. They are middle grade books awarded for storytelling!",
            "My favorite book at that age was “From the Mixed Up Files of Mrs. Basil E. Frankweiler”",
            "My cousin (so my Dad’s niece) was like this and for Christmas the year she was 8 soon to be 9, she asked him (he’s a bibliophile) for books, so he gifted her Dante’s Inferno. Yes, that sounds wild. Yes, she read it and they had a long conversation about it at Easter. \n\nLast week we had the honor of watching her PhD defense at the University of Chicago. She’s grown up to be a wonderfully intelligent, capable woman.",
            "The Inkheart trilogy was my favorite around that age. Suzanne Collins also wrote a series for middle grade readers called Gregor the Overlander",
            "The Anne of Green Gables series, by L. M. Montgomery. They're sort of rite of passage books for girls ... they got me through a very rough time in my adolescence. They will expose your daughter to the realization not everyone grows up with a nuclear family, that compassion and responsibility are not automatically acquired with maturity.\n\nYes, they're dated ... but wonderfully so.",
            "Tamora Pierce’s Tortall Series is excellent and age appropriate. Start with Alannah the first adventure.",
            "I was a big Harry Potter fan and also loved all the Sherlock Holmes books",
            "The Giver, A Wrinkle in Time, Tuck Everlasting\n\nAnything Goosebumps, especially the “choose your own adventure”",
            "Winterhouse is a really good book for kids to read, my girls loved it. And the sequel. I think there are 3 but we only read 2. \n\nEventually you should recommend her Wildwood by Colin Melody. It's definitely thick and has great vocab, so maybe in a year or two that could be a gift.",
            "You could always try the 39 clues series",
            "I really really loved Mrs. Frisby and the rats of NIMH by Robert C O’Brien at that age, although his other books weren’t quite it for me. \n\nMost of Avi’s books I really enjoyed around then too, and Roald Dahl.\n\nI LOVED Diana Wynne Jones, especially the chronicles of chrestomanci! \n\nThe spiderwick chronicles were also really cute! I think they’re by Holly Black (don’t have her branch out into her YA books, they get weird).\n\nI started reading Harry Potter in like second grade, so she’s ready for the first couple, but also I do think that the last couple might be scary and hard to understand at that age! I was lucky in that they were still coming out when I was growing up, and the fifth one came out between fourth and fifth grade for me, and then the others kind of happened with my reading/maturity level. I don’t know how you and/or her parents want to manage slowing her down so she doesn’t get to the scary ones too quickly, but like do remember how wild the last two got!",
            "I loved the Septimus Heap series at her age.",
            "I remember reading lockwood and co, its mystery and a great start!",
            "Also Small Spaces, this one really got me into reading",
            "It's kind of niche, but there's a great series called Brookfield/Ashbury by Jaclyn Moriarty. It is basically a YA series about a pen pal project between the students of a private and public high school.\n\nshe has another series called the colors of madeline, which is more of a fantasy about people from a different realm slipping into ours because of cracks between the worlds.\n\nthere's also Are you there god its me Margaret. its like mean girls lite, and talks about a lot of 'growing up' stuff in a great way, despite coming out in the 70s",
            "Gregor the Overlander by Suzanne Collins, absolutely amazing five book series I read around that age as a kid who also read Harry Potter around that age—I have the books and still reread them as an adult \n\nAnimorphs was so fun at that age\n\nThe Sisters Grimm and Fablehaven and Inkheart all amazing fantasy books!",
            "I’ve heard that Legend Born is really good but idk if it’s YA or appropriate. \n\nIf she hasn’t read Percy Jackson try that, similar enough to Harry Potter but actually has complex characters of different races/genders/ethnicities/sexualities and is definitely YA and doesn’t have much detailed gore, I loved it when I was 10 and Percy set my standards for any future boyfriends.\n\nSisters Grimm ( I think that’s what it’s called) YA, focused on fairy tale retelling type stuff. I also loved it\n\nKeeper of the Lost Cities. I loved it at that age and still love it now. That series changed my life and I was obsessed for months.",
            "If your niece likes poetry, or might, my 8 year old just finished Where the Sidewalk Ends by Shel Silverstein. She took it to school so she could keep reading. ",
            "What I read as a child...  Roald Dahl books, The Chronicles of Narnia, The Babysitter's Club...",
            "I recommend the NIm’s Island books by Wendy Orr - they are lovely and perfect for that age.",
            "Redwall by Brian Jacques (this is a series and it's fantastic)\n\nThe Indian in the Cupboard by Lynne Reid Banks\n\nNatalie Babbitt books like \"Tuck Everlasting,\" \"The Search for Delicious,\" \"The Eyes of the Amaryllis\"\n\nAvi books like \"The True Confessions of Charlotte Doyle,\" The Crispin books\n\nThe Little House of the Prairie series by Laura Ingalls Wilder\n\nThe Borrowers by Mary Norton\n\nThe old classics like The Boxcar Children, Nancy Drew are great.\n\nShe is likely NOT old enough for Mrs. Frisby and the Rats of NIMH, Watership Down, The Phantom Tollbooth, A Wrinkle in Time because of themes and Anne of Green Gables, Little Women, The Secret Garden, Little Princess, Heidi, The Little Prince, Alice's Adventures in Wonderland because of old fashioned language (you could read these aloud, though)",
            "I'd recommend her parents pick an even more mature book to read to her. My Dad read me the Hobbit, followed by Lord of the Rings, when I was 11 and it's a cherished childhood memory (including him having to hide the books so I don't read ahead).\n\nThe Girl Who Drank the Moon by Kelly Barnhill.\n\nSummer in Orcus and A Minor Mage by T. Kingfisher.\n\nAmari and the Night Brothers by BB Alston.\n\nThe Amazing Maurice and his Educated Rodents and the Tiffany Aching books by Terry Pratchett.",
            "Nancy Drew series, or The Three Investigators.\n\nIf you think fantasy sort of appeals, I would try the Redwall books.",
            "Time for the YA Discworld books. Does she need a headstrong female protagonist her age? Start with Wee Free Men and then the rest of the Tiffany Aching books await her. Or if she's an animal girl, go with Amazing Maurice and his Educated Rodents. If she enjoys those there are many more to go, but they get a bit more adult from there.",
            " American Girl series :\n\n Animal Ark series by  Ben   Baglio \n\n I Survived  series  by Lauren Tarshis \n\n  On the Run  series  by Gordon Korman:\n\n\n  The Boxcar children series  by Gertrude Chandler  Warner",
            "I loved Artemis fowl growing up! Inkheart, but maybe in a few years, if my memory serves ",
            "I loved classics about animals at that age. Black Beauty, The Black Stallion, Call of the Wild, White Fang.",
            "I'm surprised no one has mentioned this yet, but maybe it's because it's a newer series. My son is 11 and we've read Skandar and the Unicorn Thief (and the following books). We really like them and the first one will be made into a movie soon. It's kind of like Harry Potter and My Little Pony and The Hunger Games all together.",
            "Baby sitter’s club was a gateway for me.",
            "Gail Carson Levine has a ton of books that I read at her age that still have such a special place in my heart. The Two Princesses of Bamarre is my favorite, I still reread it from time to time. Not sure if she’s ready quite yet, but the Percy Jackson series was a super fun read when I was young, and that author has written quite a few series about different mythologies. Savvy by Ingrid Law is another one that sticks out to me from when I was around 10 or so.",
            "I haven’t scrolled through comments yet so it’s probably already been suggested, but I crushed the entire Harry Potter series around that age. Minutes the couple that I had to wait for release. Easy reads for a child and also just an amazing magical time that she should love.\n\nI also loved the keys to the kingdom series by Garth nix at that age. Well actually I still occasionally read them haha",
            "Nancy Drew, The Hardy Boys, The Babysitter’s Club books",
            "I can’t remember what age I was when I started reading them but but I loved the Dear America books. They are historic fiction that written like diaries from the point of view of someone living through significant events in history. If your niece enjoys history these would be perfect!",
            "Seconding Watership Down! One of my favorite books of all time.",
            "Shannon Hale, Sharon Creech, Cornelia Funke \n\nbookishrealm on instagram is a librarian and has TONS of children’s/middle grade suggestions.",
            "My son read all of Frank L Baum books at her age starting with wizard of oz of course.",
            "I was a fantasy/sci-fi kid growing up and these were my favorites of all time: \n\nGuardians of Ga'Hoole\nDeltota quest\nInkheart\nAmong the hidden\nHouse of the scorpion\nElla enchanted\nRecently I read Lockwood and Co and that was excellent, probs more like 13/14 year old audience\n\n\nSlightly older: \nThe midnighters\nA great and terrible beauty\nBrandon Sanderson- all his stuff is good, but start her on steelheart as it's more YA. I read Mistborn when I was older, but dang, I would've also liked it when I was 13/14.",
            "When I was that age, I really liked the Sweet Valley Twins books, and if she likes them, they can grow with her.  There's also Sweet Valley Jr high/Middle school, Sweet Valley High, and Sweet Valley University.",
            "Redwall!",
            "The Secret Series by Pseudonymous Bosch and The Mysterious Benedict Society series. I read these when I was a little older than your niece and they were some of my favorites after Harry Potter! They are both a mix of mystery and fantasy.",
            "Birdhouse Books will have some good recommendations!",
            "Tress and the Emerald Sea by Brandon Sanderson",
            "Aragon! My father’s Dragon, magic treehouse, the Tail of Emily wind snap, Secrets of Droon! All pretty much fantasy books!",
            "Almost all books by Jacqueline Wilson. I read her books at that age and they were perfect.",
            "The reading age range you are looking for is \"middle grades.\"\n\nI'm going to recommend two approaches to the library, and they are not mutually exclusive:\n\n1. Take her and let her pick out whatever she wants, and discover what she likes.\n2. Talk to a librarian and get recommendations.\n\nBut here are some specific possibilities:\n\n* *Nancy Drew*\n* *Anne of Green Gables*\n* *Ella Enchanted*\n* *The Trumpet of the Swan*\n* *The Day I Fell Into a Fairy Tale* (reading this one right now)\n* You know what? Fairy tales. They're great for the imagination, and there are so many Disney hasn't adapted.\n* *The Tail of Emily Windsnap*\n* *Withering-by-Sea*\n* *The Secret Garden*\n* *A Little Princess*\n* *Little Women*",
            "FWIW, a big part of developing a love for reading as a kid (this was the case for me, anyway) is a sense of discovery. You can recommend and gift books to her all day long, but her future favorites are bound to be ones that she finds on her own and can form a personal attachment to that isn't muddied by association with you or another adult. I'd say take her to the library and let her pick out things that look interesting to her. I also feel pretty strongly that the parental obsession with preselecting and screening the content of their children's books is a big part of the reason a lot of kids are resistant to reading. Books for me were one of the few things that made me feel independent as a kid, they were mine and made a special secret space for myself that didn't exist anywhere else in my life. Maybe she's too young for Danielle Steele or Stephen King, but if she picks up, say, Tolkien or Dickens or Bronte, let her. If it's too difficult she'll stop reading it on her own, but there's absolutely no reason to tell her preemptively that she won't like it when she very well might! TLDR: let her lead, kids already have an overwhelming amount of their life dictated for them.",
            "Percy Jackson!",
            "From the Mixed up Files of Mrs. Basil E. Frankweiler, The Phantom Tollbooth, The Ordinary Princess.",
            "My kids have loved the Wings of Fire series. I think there are like 15 books.",
            "This is my jam! Kids’ Librarian here :)\n\n- And Then It Happened series by M & L Wade is amazing. Every kid I’ve gotten hooked on this series has loved it.\n- A Wolf Called Wander by Rosanne Parry\n- Iggy Included by Deborah Kerbel\n- Ghost Girl by Brooke Carter\n- Uncle and Me by Uma Krishnaswami as well as the next book called Birds on the Brain\n- Dragons In A Bag (and the rest of the series) by Zetta Elliott\n- A Boy Called Bat (4 books in series) by Elana K Arnold\n- Runaway Ralph series and also the Ramona Quimby series by Beverly Cleary are older but my niblings loved them.\n- The Wild Robot series by Peter Brown is excellent\n- Katherine Applegate’s books, The One and Only Ivan series, and Odder\n- Look at books by Kate DiCamillo. Easier series by her are Mercy Watson, and the Bink & Gollie series. More complex but still very readable are Because of Winn Dixie, Flora and Ulysses, The Magician’s Elephant…",
            "I read The Chronicles of Narnia when I was 8. Also A Wrinkle in Time.",
            "I wish they would put a rating on all books! Similar to movie ratings so parents of avid young reads know what is appropriate. My daughter was reading books at 4. I am not a reader, unfortunately so it was hard for me to determine appropriate books. At 7 she read Steven King, It! I had no idea she was reading this book she pick up at neighbors house. 😬 Anyway, she survived and is now a 28 year old successful adult.  It would just be helpful when taking your kids to the library to have a rating. She outgrew the kids section and an early age.",
            "My favorote books in middle school were the Hardy Boy Casefiles (not the blue books, i think the binding was black), A Wrinkle in Time, the Harry Potter series was just coming out so those were fun, and Chronicles of Narnia.",
            "If she's into fantasy and magic, run right to Keeper of the Lost Cities and Wings of Fire. She'll be obsessed. Also, check out Maya and the Rising Dark, Sir Callie and the Champions of Helston, and the Aru Shah series!",
            "A Tree Grows in Brooklyn and Are You There God? It’s Me, Margaret",
            "The Artemis Fowl series by Eoin Colfer, the Rondo series by Emily Rodda, the Enchanted Forest Chronicles by Patricia C Wrede, the Circle of Magic by Tamora Pierce, the Tiffany Aching books by Terry Pratchett…\n\nI see Royals Dahl has been suggested, but don’t sleep on Morris Gleitzman.",
            "The Wild Robot series or there’s a series called I Survivded that is a good non fiction for kids 9-12 it breaks down events in a relatable, digestible way. \nAlso worth mentioning there are a lot of young reader editions of classics and non fiction she might be interested in \n\nHonestly I work at a book store and I love talking with kids and parents and suggesting things I liked at that age! I would take her there or a library and let her check out the 9-12 sections if she’s ready to move up.",
            "A good way to ease her in might be the Betsy-Tacy books! [The first four are collected in a treasury](https://a.co/d/d455uUk) and start when the girls are five and continue until about age 12. The writing gets more mature as the girls do, and there are illustrations but not a ton of them. The later books cover high school and beyond and are also wonderful, but the first four are perfect kids books.\n\nAlso second all the recommendations for Tamora Pierce and Diana Wynne Jones! \n\nAnother good but less well-known option are [Edward Eager’s Tales of Magic](https://a.co/d/aNOPgf5), starting with Half Magic.",
            "Mysterious Benedict Society! Has just enough intrigue and puzzles to get them hooked too. It was one of my favs after I read through Series of Unfortunate Events, and Percy Jackson!",
            "I highly recommend Redwall for that age!!",
            "Lemony Snicket is excellent…\n\nI’d also recommended ‘the chronicles of Prydain’ by Lloyd Alexander… it’s absolutely brilliant, and 100% age appropriate :) I read that series when I was 9 and I was obsessed with it…",
            "Lots of great suggestions already! My additions are the Spiderwick Chronicles (fairies/creatures/forest vibes, chapter book but has some cool illustrations), and the Charlie Bone series (magical school, but trends a bit younger than Harry Potter I think)",
            "Redwall series, children of the lamp, or the mysterious Benedict society for something harder/thicker books. \n\nEasier series (thinner, more simple) like the littles, magic tree house, little house on the prairie, guardians of gahoole, spider wick chronicles, boxcar children, baby sitters club, Anne of greengables",
            "what about Nancy Drew?",
            "Milo and the Magic Toll booth, Wizard of Oz series, Chronicles of Narnia, I read The Hobbit at that age",
            "I loved the Royal Diaries series at that age. It's historical fiction, written as the diaries of famous princesses through history. It's mostly based in fact so it's educational too.",
            "I read all of the Nancy Drew books at her age!",
            "The Faraway Tree collection by Enid Blyton and the Famous Five series by her too. Famous Five is a series about cousins who go adventuring and the Faraway tree collection is about kids exploring a magical tree.",
            "I loved Boxcar Children at that age! And my best friend loved Magic Treehouse!",
            "Nevermoor 🥰",
            "Tamara Pierce has several series of teenage fantasy, I remember reading them when I was young and found them to be incredible!",
            "The Giver!",
            "Here are some books and series that my fantasy loving 9 year old has devoured in the past couple years: \n\n*Wilderlore - absolute favourite, she says it’s Harry Potter mixed with Pokémon \n\n\nValentina Salazar is Not A Monster Hunter - family stuffs and magical monsters \n\n\nZoey and Sassafras - sciencey mythical creatures mysteries \n\n\n*Kitty and the Moonlight Rescue- a bit easier than the others in case the leap is too big, my daughter still loves these. Girl magically changing into a cat in the night \n\n\n*Upside Down Magic - magical girly Harry Potter but slightly younger as well.\n\n\nJasmine Green rescues - a girl rescuing animals in each book \n\n\nDragons in a Bag - boy suddenly has to care for baby dragons \n\n\n*Star Friends - girls with magical connections to forest animals fighting evil forces \n\n\nUnicorn Rescue Society- kids saving wild mythical creatures \n\n\nThe Land of Stories - magical adventures into other realms \n\n\nDiary of an Accidental Witch - magical slice of life \n\n\nDragon Storm series - kids with different dragons , easier. \n\n*Meesh the Bad Demon- more heartwarming \n\n\nMagical Animal Cafe - cute animals with magical abilities .. in a cafe \n\n\nSquirlish - girl grows up raised by squirrels - cute and funny \n\n\nSophie Mouse - just adorable \n\n\nLegends of Lotus Island - magic plus martial arts \n\n\n\nThis should all be a bit more updated and modern than the things we read as kids. Hopefully this list gives you a place to start! There is a wide variety of styles and levels here, Harry Potty /Wilderlore being more difficult, but the others still being chapter books of varying lengths. Some are illustrated but still have chapters. Favourites are starred.",
            "My 10 year old granddaughter is working her way through The Babysitters Club.  My daughter read those at the same age and I read a number of them for content.  I didn't find anything objectionable, but you need to make your own decision.  I know as she got older finding books to challenge her but with age appropriate content was a huge challenge.",
            "Charlotte’s web. The trumpet of the swan… Nancy drew books. The Mrs. Piggle Wiggle series (maybe better for about age 10). Nancy Drew books.",
            "And! The Beverly Cleary books… Ramona and beezus, Henry Huggins, etc",
            "Little House On The Prairie! My little sister loved the series when she was around that age.",
            "Enid Blyton.",
            "Maybe the Percy Jackson series or other Rick Riordan books? I think I started those around 4th grade and gained momentum over time",
            "Magic Treehouse books!!!!",
            "Lloyd Alexander's The Chronicles of Prydian. The Disney movie \"The Black Cauldron\" was loosely based on the first 2 books of this series. 5 books total. Also, C.S. Lewis Narnia books. Maybe some Goosebumps \"your own adventure\" books or Illustrated Children's Classics - abridged and illustrated versions of \"The Theee Musketeers\", \"Treasure Island\", \"The Count of Monte Cristo\", \"Around the World in 80 Days\"...loved all of these as a kid.",
            "The Inkheart series and the Warriors series were favorites of mine!",
            "Crime and Punishment obviously. \n\nHaving said that, you already stated the HP series, which is what I started out with as a kid. \n\nMaybe, The Hobbit. \nA Wrinkle in Time. \n\nThere was one I distinctly remember taking out of the library but I can’t remember around what age I was. It was called Jason’s Gold. Set during the gold rush to the west coast. I remember really enjoying it.",
            "Babysitters Club! Magic Treehouse too.",
            "the hunger games, eragon, percy jackson for series. bridge to terabithia, the book thief, hatchet— some books I read in the 7 to 12 age range that really stuck with me.",
            "Just going in a different direction because you have some really god recommendations in the thread already. At her age I loved Choose Your Own Adventure books. I liked making decisions to progress the story.",
            "My cousin of that age really likes the Percy Jackson series. She may like it too",
            "At that age, I was reading Anne of Green Gables, the Boxcar Kids and everything by James Herriot.",
            "I would recommend fantasy, if she's interested. The more complex worldbuilding and often more-intense stories and stakes that come from said worldbuilding makes children's fantasy books feel \"older.\" \n\nNarnia, for example, has some intense stuff involving death/violence/saving the world, but it's all appropriately done for a younger audience. The Hobbit is also a really good book that's enjoyed by kids and adults alike. The Borrowers series is also a great choice; they're thicker books with some non-juvenile illustrations scattered throughout (at least, remembering the editions I had as a kid). The length and writing makes them feel a little \"older\" while being fun and accessible. I also remember loving Edith Nesbit (specifically Five Children and It). I've never read Percy Jackson or Redwall, but those are super popular. \n\nI would also recommend Nancy Drew, Trixie Belden, and/or The Boxcar Children if she is interested in mysteries. By definition, it's much harder to spoon-feed information in mystery books, and the spoon-feeding is usually what makes books feel more juvenile. The Mysterious Benedict Society books might be a little old for her if she's just graduating to \"real\" books, but if she's a voracious reader, she'll come to a higher level quickly. Those books are worth buying and keeping for a year or two until she's ready.\n\nFor general fiction, Anne of Green Gables comes to mind. Some of the later books have more intense themes, such as a character having had an abusive relationship, death of a child, WW1, someone being in love with a married woman, etc. However, the earlier books are more child-friendly, and the later books' more-intense themes are done tastefully, so they're easy to graduate to. Little House on the Prairie is also a great transition to thicker chapter books.",
            "My daughter loved the Wrinkle in Time series by Madeleine L’Engle when she was 8. She’s 9 now and is a big fan of the BFG by Roald Dahl.",
            "Percy Jackson!!",
            "Above and add Anisha Accidental Detective, early Harry potter books and me and my daught have just started Inkheart which she is loving",
            "When my kiddo was 8, they completely devoured the Keeper of the Lost Cities series, which are around 500 pages each (9 currently published). He got the set for Christmas and had finished all 9 before spring break. They're still kids books and are age-appropriate, but more challenging.",
            "Not Danielle Steele. (Personal experience)",
            "Jacqueline Wilson maybe?",
            "Could go old school. Babysitters club, boxcar children, Nancy drew",
            "Authors I recommend:\n\n\nRoald Dahl\n\n\nNatalie Babbitt\n\n\nKatherine Paterson\n\n\nR.L. Stine (if she likes scary stuff)\n\n\nAlso Babysitters Club and Ramona!\n\n\nEta: phantom tollbooth and the 13 clocks!",
            "My daughter read the Wings of Fire series around that age and loved it. Also a good age for the Wild Robot books. I personally wouldn’t recommend HP because JKR is a bigoted piece of shit.",
            "I don’t know if it’ll be her exact genre, but I think every girl should read Anne of Green Gables! So charming, pretty easy to follow and the kind of book that can be a friend for life. I still re-read or re-listen every couple years for comfort as an adult. I love A little princess too but maybe too old fashioned idk.",
            "Live the Lizzo Way - that is a big girl book.",
            "Princess Academy!",
            "Eva Ibbotson books? Journey to the River Sea and The Secret of Platform 13 are my favorites.",
            "For standalone books: my favorite at that age was The Twenty-One Balloons by Pene Dubois! Also: The Little Princess, The Secret Garden, The Mixed Up Files of Mrs. Basil E Frankweiler,  Chasing Vermeer- for series, Percy Jackson, The Spiderwick Chronicles, Inkheart, The Magicians Nephew (and the rest of Narnia books), Magic Treehouse, Beezus & Ramona",
            "Around that age I was reading Baby Sitter's Club. Nevermoor by Jessica Townsend is also very good. The fourth book is set to come out this year.",
            "Anne of Green Gables and Little Women",
            "Give her Percy Jackson. Just as fun as Harry Potter, and the author is an actual good person. DC Comics YA Graphic Novels might be good for her too, especially the female centric ones- Zatanna is my favorite, but there's also Wonder Woman, Super Girl...",
            "Some favorites I haven’t seen mentioned yet:\n\n*Gone Away Lake and Return to Gone Away\n\n*The Tales of My Father’s Dragon Series (3 books)\n\n*Little Witch \n\n* Because of Winn Dixie\n\n\n*Walk Two Moons",
            "When my daughter was this age she was obsessed with the Among the Hidden books. I haven’t read them myself but they read the first one in school so I assume they’re good to go. \n\nNancy Drew, Holes by Louis Sacher, and Babysitters Club are also good for that age.",
            "Pax and Pax Journey Home, by Sarah Pennypacker\n\nFront Desk series by Kelly Yang\n\nThe Girl Who Drank the Moon by Kelly Barnhill\n\nEmmie and Friends series by Terri Libenson (these are graphic novels, but if she likes Diary of a wimpy kid series she’ll probably like these too)",
            "My kids have really enjoyed the following series: Warriors, Wings of Fire, Wild Robot, Silverwing, and Ranger's Apprentice. I also second the comments suggesting free ranging the children's section at the library.",
            "*The Keys to the Kingdom* by Garth Nix",
            "Little House on the Prairie is good, and I saw someone else mention A Series of Unfortunate Events. It’s a long series but amazing for kids. Harry Potter may also be something to check out. Maybe look at a few graphic novels too! I’d recommend Raina Trlgemeier’ Sisters. I’d avoid smile if she’s nervous about teeth-related issues like losing teeth or braces just due to the content of the novel. The Tale of Despereaux by Kate DiCamillo (not a graphic novel, but there is a movie!) is one of my personal favourites as well! I remember reading it over and over as a kid",
            "Instinctively that’s a GREAT age to get into some of the slightly older-leaning Judy Blume - Just as Long as We’re Together and Here’s to You, Rachel Robinson, Are You There God, it’s Me Margaret \n\nOther recs: Jandy Nelson’s books are great YA that feels more adult, also Lev Grossman’s Magician series",
            "A Wrinkle in Time\n\nThe Phantom Tollbooth",
            "I'd recommend Protector of the Small series by Tamora Pierce, the Enchanted Forest Chronicles by Patricia C Wrede, and The Black Stallion books if she's into horses",
            "Silver Wing series by Kenneth Oppel (all his books are wonderful)",
            "I've read all of these with my niece starting when she was 9.\n\nThe Wings of Fire books are insanely popular and enjoyable. They are prose novels and also exist as well done graphic novels.\n\nThe Aru Shah series by Roshana Chokshi is amazing. Very fun and interesting.\n\nSal and Gabi break the universe by Carlos Hernandez. Hilarious and also deals with some difficult topics.",
            "The Wingfeather Saga by Andrew Peterson\n\nAnne of Green Gables by Lucy Maud Montgomery\n\nBetsy-Tacey by Maud Hart Lovelace\n\nThe Chronicles of Narnia by C.S. Lewis\n\nAnastasia Krupnik by Lois Lowry\n\nThe False Prince by Jennifer A. Nielsen\n\nStories From Grandma's Attic by Arleta Richardson\n\nAlice in Wonderland by Lewis Carrol\n\nPeter Pan by James Matthew Barrie\n\nHans Christian Anderson fairy tales",
            "The percy jackson series! Big text, short reads with great characters!",
            "Oh, man, do I identify with you!\n\nI started reading when I was two (picking out simple words from books, magazines and what-have-you, according to my mom) and quickly moved on to reading whatever came into the house--since Mom kept getting them out of the library, I read more of the Avalon Romance series than I care to admit to and thanks to a box set we may have gotten from Reader's Digest, I read The Jungle Book, Call Of The Wild and The Adventures of Sherlock Holmes by age ten or so (Mr. Holmes is the only one to hold my interest to this day). All this went on while I also went through books kike Harry The Dirty Dog, Bread And Jam For Frances, the Henry Huggins and Ramona Quimbly books by Beverly Cleary, Harold And The Purple Crayon (also Stranger In A Strange Land, but we don't talk about that...).\n\nSince I was not a \"typical\" reader as a child, I tend to hesitate when somebody asks me what I was reading in grade school (they don't want to know about Midnight Cowboy or The Killer Elite, I'm sure). But I will suggest The Pushcart War by Jean Merrill--New York City pushcart vendors declare \"war\" on big trucks in a novel you'll wish WAS a history book. And the best way to help your niece find \"big girl\" books that appeal to her? Hit the library and talk to the children's librarians. Believe me, these folks KNOW!",
            "Anne of green gables series",
            "I second the chronicles of Narnia. Also Wings of Fire are the right age for her and Redwall. Reading Redwall books with my 8 year old now.",
            "Goosebumps! A series of unfortunate events. Chronicles of Narnia. His Dark Materials trilogy.",
            "I liked Percy Jackson and Wings of Fire at her age! (teenager now) ",
            "My daughter at that age loved \"The Worst Witch\" by Jill Murphy  \nAnd \"Coraline\", by Neil Gaiman (she still does, for that one).",
            "Books of Bayern series! That series really got me into reading around that age, I think I was 10.",
            "She might be old enough to start Harry Potter. The chronicles of narnia, Charlotte's Web. I remember reading a series called 'jane blond' about a school girl that was secretly a spy, they were fun too.\n\nSomeone else here mentioned Roald Dahl, he has a lot of great kids books, but my Aunt assumed he only wrote kids books and gave me \"My uncle Oswald\" when I was 11 lol. Trauma. Anyway,  It's great that your brother wants to vet the books.",
            "I loved Anne of Green Gables as a kid.\nAnne is 11 years old in the first book and makes lots of mistakes.\n\nEnglish is not my first language though, so I read it in a modern translation. Not sure how well kids can understand the original due to language.",
            "Skulduggery pleasant",
            "Goosebumps and animorphs series!",
            "Little House on the Prairie series would be great.",
            "I really liked ‘The Last Apprentice’ series by Joseph Delaney and ‘The Saga of Larten Crepsley’ series by Darren Shan when I was around the age of 10-12, both are fantasy series.\nMost other books I read were Dutch, not sure if that would be applicable here",
            "I don’t know if anyone has mentioned it yet. I loved Ranger’s Apprentice and the connected series. He’s written quite a lot so it’ll keep her occupied a while if she likes them.\n\nAn oddball one if you can find it is the Plant that Ate Dirty Socks. It had me in stitches in school many times.\n\nEllen Raskin has a handful of good books, not a series though.\n\nI started reading Eragon pretty young. But by the time the series ended I was well into teen/early twenties and i think some of the latter books could use a close adult’s eyes to see if she might handle them ok. (Blood, gore, ethical discussions)\n\nFablehaven / anything by Brandon Mull are absolutely fun and fantastic. I read them later but I think they’re fine for a 9yo",
            "Anne of Green Gables, The Hobbit, and Walk Two Moons were some of my favorites at that age! I was a really precocious reader. You could also look for versions of Jane Eyre, Pride and Prejudice, etc. that are adapted and published for kids.",
            "Tamora Pierce. They're not \"big girl books\" with smut, but there's some mentions of adult themes in some books. Certain series, I'm thinking he Totally universe if Im remembering the name correctly, I found to be empowering as a girl!",
            "Ella Enchanted and Artemis Fowl!! I think I was about 10 when I read them but I think would still be appropriate for a 9 year old",
            "I suggest Wings of Fire series. We just read that out loud to our 8 yr old and he loved it.  He's also smart, but doesn't choose to read on his own yet ... Unless it's nonfiction. \n\n\nI also suggest the Redwall books by Brian Jaques.\n\n\nThese are older books but, Half Magic by Edward Eager;  Ballet Shoes by Noel Streatfeild; the secret garden, childrens books by Jane yolen. She writes about dragons and for all ages.  Not \"naughty' but I always found her deep and confusing ) which I loved).\n\n\nOh, and books by Shannon Hale.  Goose Girl, enchanted, and others.  ",
            "There are many Branches series (search branches books scholastic) that are great for kids that age. My son loves Dragon Masters which is a great gender neutral one. I've seen Owl Diaries and A to Z Mysteries, too. There's a lot of them.\n\nMy son (also 8) really loves EB White books and Beverly Cleary as well. Can't go wrong with Magic Tree House, too.\n\nWe tried Narnia and some others that are a step above and I found he wasn't quite retaining/understanding what was happening even though he can fly through the early readers.",
            "I skipped straight into Michael Crichton at 9 years old because of Jurassic Park. As a result, he is still my favorite author today and I’m rather snobby about which books I actually find “good”.",
            "Anne of Green Gables, The Secret Garden, and Lemony Snickett. Also the Baby Sitters Club, and Sweet Valley Twins (not Sweet Valley High, which she will probably wanna read after). Sweet Valley Twina is all the same characters in elementary/middle school.",
            "Around that same age, my kiddo (also a big Diary of a Wimpy Kid fan) got hooked on the Mr. Lemoncello series. Even as someone who prefers graphic novelizations of basically everything, those are super engrossing for her and also include the bonus of some great literary references to get young readers curious to check out classics.",
            "Take her to the library and let her browse",
            "The Emily Windsnap series was my daughters favorite.",
            "Bridge to Terabithia, Red Wall, Harry Potter, Hardy Boys, Nancy Drew, Tom Swift, Eragon, Kiki's Delivery Service",
            "Harry Potter\n\nWearing the Cape series (18 yo girl becomes a superhero)\n\nI REALLY want to recommend Dungeon Crawler Carl, but 9 is a bit young for some of it.  \n\nMagic 2.0 (computer hackers find out the universe is a simulation, and how to hack it.  So naturally they travel to medieval England and become wizards)",
            "Hopelessly old fashioned but books I read as a child and are being read at the moment by a 9 year old I know are the Mallory Towers series by Enid Blyton. The Twins at St Clare's are similar, both are English boarding schools stories probably of the 1950s.",
            "Look up books that have won the [Newbery Award](https://abqlibrary.org/newbery/All) , you’ll have a fantastic selection",
            "When I was that age I was super into Harry Potter, The Spiderwick Chronicles, judy Blume, babysitters club, goosebumps, animorphs, Nancy drew, Percy Jackson, chronicles of narnia, etc.",
            "I have an entire doc of books for this age group! Double check descriptions before offering them, because some kids may not be ready for some of the subjects! (ie. War, shunning, racism, classism) Overall, I read most of these between the ages of 7-12.\n\n\nTamora Pierce:\nCircle of Magic series\nSong of the Lioness series\nProtector of the small series\n\nSherwood Smith:\nWren to the Rescue\nWren's Quest\nWren's War\nWren Jourmeymage\n\nPatricia C Wrede:\nThe Enchanted Forest Chronicles\n\nNancy Springer:\nThe Enola Holmes series\n\nMaryRose Wood:\nThe Incorrigible Children of Ashton Place\n\nUrsula K Leguin:\nCatwings series\n\nDiana Wynne Jones:\nHowl's Moving Castle series\n\nShannan Hale:\nThe Princess Academy series\n\nConnie Glenn:\nThe Undercover Princess series\n\nJennifer Lee Simner:\nGhost Horse\nThe Haunted Trail\n\nZilpha Keatley Snyder:\nLibby On Wednesday\n\nMarguerite Henry:\nThe Misty of Chincoteague series\n\nMary Norton:\nThe Borrowers\n\nLois Lowry:\nAnastasia Krupnik series\n\nFrances Hodges Burnett:\nThe Secret Garden\n\nJohn Lawrence Peterson:\nThe Littles\n\nMadeline L'Engle:\nA Wrinkle In Time\n\nRobert C O'Brian:\nMrs Frisby and the rats of NIMH\n\nGail Carson Levine:\nElla Enchanted\nThe Two Princesses of Bamarre\n\nCornelia Funke:\nThe Inkheart Trilogy\n\nErin Colfer:\nThe Artemis Fowl series\n\nDiane Duane :\nThe Young Wizards series\n\nCS Lewis :\nChronicles of Narnia\n\nRoald Dahl:\nMatilda\n\nLM Montgomery :\nThe Anne of Green Gables Series\nThe Story Girl\n\nL Frank Baum:\nThe Wonderful Wizard of Oz\n\nNorton Juster:\nThe Phantom Tollbooth\n\nLouis Sacher:\nWayside School series\nHoles\n\nLouis Fitzhugh:\nHarriet the Spy\n\nDeborah Howe:\nBunnicula series\n\nNatalie Babbit:\nTuck Everlasting\n\nLloyd Alexander:\nThe Chronicles of Prydain\n\nBruce Coville:\nThe Unicorn Chronicles \n\nLemony Snicket:\nA Series of Unfortunate Events series\n\nAngie Sage:\nSeptimus Heap series \n\nBrandon Mull:\nFablehaven\n\nHolly Black:\nThe Spiderwick Chronicles \nDoll Bones\n\nE. Nesbit:\nFive Children and It\n\nChristina Brand/Emma Thompson:\nNanny McPhee books",
            "I have an entire doc of books for this age group! Double check descriptions before offering them, because some kids may not be ready for some of the subjects! (ie. War, shunning, racism, classism) Overall, I read most of these between the ages of 7-12.\n\n\nTamora Pierce:\nCircle of Magic series\nSong of the Lioness series\nProtector of the small series\n\nSherwood Smith:\nWren to the Rescue\nWren's Quest\nWren's War\nWren Jourmeymage\n\nPatricia C Wrede:\nThe Enchanted Forest Chronicles\n\nNancy Springer:\nThe Enola Holmes series\n\nMaryRose Wood:\nThe Incorrigible Children of Ashton Place\n\nUrsula K Leguin:\nCatwings series\n\nDiana Wynne Jones:\nHowl's Moving Castle series\n\nShannan Hale:\nThe Princess Academy series\n\nConnie Glenn:\nThe Undercover Princess series\n\nJennifer Lee Simner:\nGhost Horse\nThe Haunted Trail\n\nZilpha Keatley Snyder:\nLibby On Wednesday\n\nMarguerite Henry:\nThe Misty of Chincoteague series\n\nMary Norton:\nThe Borrowers\n\nLois Lowry:\nAnastasia Krupnik series\n\nFrances Hodges Burnett:\nThe Secret Garden\n\nJohn Lawrence Peterson:\nThe Littles\n\nMadeline L'Engle:\nA Wrinkle In Time\n\nRobert C O'Brian:\nMrs Frisby and the rats of NIMH\n\nGail Carson Levine:\nElla Enchanted\nThe Two Princesses of Bamarre\n\nCornelia Funke:\nThe Inkheart Trilogy\n\nErin Colfer:\nThe Artemis Fowl series\n\nDiane Duane :\nThe Young Wizards series\n\nCS Lewis :\nChronicles of Narnia\n\nRoald Dahl:\nMatilda\n\nLM Montgomery :\nThe Anne of Green Gables Series\nThe Story Girl\n\nL Frank Baum:\nThe Wonderful Wizard of Oz\n\nNorton Juster:\nThe Phantom Tollbooth\n\nLouis Sacher:\nWayside School series\nHoles\n\nLouis Fitzhugh:\nHarriet the Spy\n\nDeborah Howe:\nBunnicula series\n\nNatalie Babbit:\nTuck Everlasting\n\nLloyd Alexander:\nThe Chronicles of Prydain\n\nBruce Coville:\nThe Unicorn Chronicles \n\nLemony Snicket:\nA Series of Unfortunate Events series\n\nAngie Sage:\nSeptimus Heap series \n\nBrandon Mull:\nFablehaven\n\nHolly Black:\nThe Spiderwick Chronicles \nDoll Bones\n\nE. Nesbit:\nFive Children and It\n\nChristina Brand/Emma Thompson:\nNanny McPhee books",
            "Jurassic park…. Such a classic. Clean and action packed with all sorts of nerdy stuff and jargon, which also should encourage her to look up and learn and new big words she stumbles upon.",
            "The Chronicles of Narnia, The Hobbit, Percy Jackson, Warrior Cats, Nancy Drew, The Secret Garden",
            "The Sisters Grimm by Michael Buckley. It’s a series about these two sisters who are descended from the Brothers Grimm. They move in with a family member in a town full of storybook characters, and solve mysteries, including the disappearance of their parents. I started these when I was your niece’s age and I was HOOKED. My mom really liked them too!",
            "percy jackson!",
            "Try Wings of Fire (all about dragons, so they meet the magical/fantasy angle).  They come in both novel form and graphic novel form.  My kids love that series and they are a variety of ages including your nieces age.",
            "Redwall was exactly what I was reading at that age. Mattimeo was my favorite Brain Jacques book though.\n\nGuardians of Ga'Hoole was also top-tier.",
            "Jacqueline Wilsons books are aimed at girls of that age, and handle some more grown up themes.",
            "I enjoyed the gallagher girls series growing up. Really cool example of young girls doing cool stuff :)",
            "Some of the nonfiction science books by Mary Roach? *Gulp* is about digestion (and poop! Kids love poop). *Packing for Mars* is about space travel.   \n  \n*Bonk* and *Stiff* are about sex and death, respectively...maybe not quite yet.",
            "The last cuentista by Donna barba higura is such a good starter dystopian!",
            "I didn't become a reader until my teens and just started again in my 30s. \n\nI do remember the magic tree house series being good at a young age, she might like it too",
            "I will never stop recommending the Gregor the Overlander series by Suzanne Collins.",
            "The Fudge series by Judy Blume. First one is Tails of a Fourth Grade nothing\n\nWayside School series by Louis Sacher\n\nFrindle by Andrew Clements (and many other books by him are great and age appropriate)\n\nThe Mouse and the Motorcycle series by Beverly Cleary and also the Ramona Series",
            "I suggest the book of 3 series",
            "Sherlock Holmes got me into reading other big girl books, so id recommend the same :)"
        ]
    },
    {
        "id": "1jwy8x7",
        "title": "Recommend a book to make me cry.",
        "score": 67,
        "num_comments": 234,
        "link": "https://www.reddit.com/r/suggestmeabook/comments/1jwy8x7/recommend_a_book_to_make_me_cry/",
        "content": "I need to have a good, cathartic cry — but I struggle to find books that make me sob.\n\nHere are some books that did not make me cry:\n\nA Separate Peace by John Knowles Of Mice & Men by John Steinbeck The Nightingale by Kristin Hannah\n\nBooks that made me cry as an adult:\n\nA Little Life by Hanya Yanigihara\n\nPlease recommend me ANY AND EVERYTHING.\n\nThank you!",
        "comments": [
            "The Book Thief by Markus Zusak. Wept on a train in Austria reading this.",
            "I think I cried the most during the last book but the Beartown series by Fredrick Backman. Oh and A Man Called Ove by the same author.",
            "A thousand splendid suns ✨️😭",
            "Night by Elie Wiesel",
            "A Prayer for Owen Meany. I found myself crying days after I’d finished the book.",
            "Me before you, Jojo Moyes",
            "The Kite Runner by Khaled Hosseini",
            "The Lovely Bones just wrecked me.",
            "*Bury My Heart at Wounded Knee* by Dee Brown",
            "a monster calls by patrick ness",
            "The Perks of Being a Wallflower\n\nThe Song of Achilles \n\nCall Me by Your Name",
            "Little Women gets me every time.",
            "Everything written by Becky Chambers.\n\nThe House in the Cerulean Sea by TJ Klune.",
            "The Boy in the Striped Pajamas…… left me numb.",
            "When breath becomes air",
            "Gone with the Wind",
            "Where the Red Fern Grows. I have read it periodically over the last 40 years and I still ugly cry at it. And my cat hides because if I start to hug her I will never let her go when I read it.",
            "eta: mistyped\nThe Traveling Cat Chronicles. Not my usual read but very touching.",
            "The Presidential Budget",
            "Never let me go by Kazuo Ishiguro",
            "A Fine Balance",
            "- Pachinko\n- A Thousand Splendid Suns\n- All the Light We Cannot See\n- The Art of Racing in the Rain",
            "I mean, The Notebook is sortof known for this.",
            "White Oleander by Janet Fitch\nWhere All the Light Tends to Go by David Joy\nProvinces of Night by William Gay",
            "Never Let Me Go by Kazuo Ishiguro \n\nMarlena by Julie Buntin",
            "Norwegian Wood by Haruki Murakami made me ugly cry into a pillow",
            "I cried at East of Eden by John Steinbeck\n\nDo Androids Dream of Electric Sheep by Philip K Dick too (I’m aware this one’s weird,  but the spider part was really sad).",
            "One Hundred Years of Lenni and Margot",
            "*A Summer to die* - Lois Lowry",
            "On the Beach by Nevil Shute. I started it just before I had a baby, and when I tried to finish it, I cried so hard my milk dried up for a day or so.",
            "A little life",
            "The Memory Keeper’s Daughter by Kim Edwards. I bawled like a baby.",
            "How can I possible be the first person here to recommend The Great Believers by Rebecca Mekkai?! I recommend this one to every reader I encounter. \n\nI desperately want to reread, but haven’t recovered emotionally yet after reading it a few months ago.",
            "Remarkably Bright Creatures\n\nFlowers for Algernon",
            "The Nightingale by Kristen Hannah. Brilliant novel. I cried so much!!",
            "The Road by Cormac McCarthy",
            "The fault in our stars",
            "They Both Die at The End by Adam Silvera\n\ntheres a prequel and a sequel that comes out next month",
            "Brightly Burning by Mercedes Lackey\n\nThe Last Herald Mage trilogy by Mercedes Lackey\n\nHer philosophy towards writing is to create a character the audience really likes and empathizes with, then drop a mountain on them",
            "Had some good weepy moments in Light From Uncommon Stars.",
            "A little niche, but Ruffian: A Racetrack Romance by Bill Nack",
            "The Beans of Egypt. I’ve never read a more poignant, at times beautiful representation of the bleak, hopeless lives people lead when they’re unable to escape poverty or the rural place they were born.",
            "Thanks, everyone!! I’ve made a list with every recommendation. :)",
            "Left to Tell by Immaculée Ilibagiza",
            "There’s this book “a girl with seven names” I read a couple of years ago\nI cried!!! This was my first book ever, I couldn’t stop reading it! \nA beautiful book!! Unfortunately it’s a real story.",
            "The art of racing in the rain. By garth stein",
            "The Boy in the Striped Pajamas.",
            "'Shadows for silence in the forest of hell' a short story by Brandon Sanderson. Read in one sitting had be crying before the end.",
            "Night. Eli Wiesel (pardon any typo)",
            "The Green Mile by Stephen King",
            "The Fault in Our Stars",
            "{Code Name Verity by Rachel Wein}",
            "“Tending Roses” by Lisa Wingate. First person.  Very relatable family, problems, and characters.",
            "The Sparrow by Maria Doria Russell",
            "*Swimming in the Dark* was hands down one of the worst reading experiences I've had. Like, the book was very good--the author is extremely talented, but it was so depressing that it actually tanked my mood for a solid week. I've never been so depressed after reading a book.",
            "Doomsday Book by Connie Willis.\n\nMaybe keep some tissues handy.",
            "Rain or h2o by Virginia bergin. The premise is that the rain will kill you. How do you survive without it?",
            "Fearless ( it’s the third book in the trilogy - first two are okay/ meh - but the third book, some particular scenes were heartbreaking!)",
            "Just Kids by Patti Smith made me ugly cry. Strongly recommend getting the physical copy for the pictures included and listening to the audiobook to listen to her take on telling the story (as she narrates herself and gives it a little edge). Also, listen to the additional content in the audio book (poems and such at the end). Thos made my ball and I didn't expect that reaction a memoir at all.",
            "One Day - romance \nThe Glass Castle - dysfunctional family \nThe year of magical thinking - grief",
            "Memories of Ice by Steven Erikson. But I recommend reading the first two books first.",
            "Evergreen\nSophie’s choice",
            "The kite runner or A thousand splendid suns by Khaled Hosseini",
            "Between shades of gray by Ruta Sepetys",
            "When Breath Becomes Air by Paul Karanithi. It's an absolutely haunting memoir. I shed a lot of tears while reading it.",
            "The Color Purple by Alice Walker. Only book that made me cry as an adult.",
            "The Great Alone by Kristin Hannah",
            "The one hundred years of Lennie and Margot",
            "The Great Believers by Rebecca Makkai",
            "I just read “Remarkably Bright Creatures” and I loved it very much. I cried a lot, partly because a lot of the story really resonated with me personally. But it was one of my all time favorite books. The author is Shelby Van Pelt.",
            "Where the Red Fern Grows",
            "Bridges of Madison County",
            "I cried a lot during A Covenant of Water by Abraham Verghese",
            "the art of racing in the rain",
            "The art of racing in the rain by Garth Stein wrecked me. The poor man sitting next to me on the plane while I finished the audiobook looked genuinely concerned.",
            "the Road a novel by Cormac McCarthy",
            "The Fault In Our Stars by John Green, a YA book.",
            "The Art of Racing in the Rain",
            "The goldfinch by Donna tart\n\nThe Poisonwood bible by Barbara Kingsolver",
            "Nickel Boys by Colston Whitehead\n\nAnd I second The Book Thief. \n\nRead both of these on two separate car trips. Tears both times.",
            "I rarely cry reading books but I did when reading Where the Crawdads Sing.",
            "Why didn’t anyone recommend The Nightingale? I sobbed!!! 😭",
            "Flowers for Algernon",
            "crying in hmart by michelle zauner soaked my pillow with tears\n\nhere after by amy lin also soaked my pillow with tears",
            "Bastard Out of Carolina - Dorothy Allison",
            "Bright Side- Kim Holden\nMe Before You- Jojo Moyes\nThey Both Die at the End- Adam Silvera",
            "Hamnet by Maggie O'Farrell made me SOB for like 30 minutes",
            "Kite Runner, A Thousand Splendid Suns, The Book Thief, Flowers for Algernon, The Song of Achilles",
            "The Lady Astronaut of Mars had me sobbing, and it's a short story so if it doesn't have the same effect on you, you won't have spent days on it.",
            "Penpal by Dathan Auerbach",
            "Omg I boohoo cried at certain parts of The Nightingale!! Lol\n\nI was going to recommend 🤣",
            "The Sparrow by Mary Doria Russell",
            "There is a story in Sara Gran's Little Mysteries called The Case of the Razors Edge Between Life and Death.  It's maybe a ten minute read.  I read it two nights in a row and it made me cry.  The third night I read it aloud to my partner and cried again.",
            "Non-fiction: Wave by Sonali Deraniyagala",
            "The Last Letter by Rebecca Yarros",
            "A Prayer for the Dying by Stewart O'Nan.",
            "Bridget Jones, Mad about the Boy by Helen Fielding. If you already have a relationship with Bridget, this book is so very sad. I cried all the way through it, including while on a train. Even in the second reading I was so distraught I had to get help using the self service check out for some jelly sweets! Not the kind of book I tend to read anymore but v enticing.",
            "Giovanni’s room by James Baldwin",
            "The Boy In The Striped Pajamas",
            "A Little Life by Hanya Yanagihara",
            "“The Green Mile” by Stephen King",
            "A Fine Balance by rohinton mistry",
            "I find young adult novels to be great for sobfests:  Going Bovine by Libba Bray, The Fault in Our Stars by John Green, Before I Fall by Lauren Oliver, and If I Stay by Gayle Forman. Also The Storied Life of AJ Fikry by Gabrielle Zevin, Me Before You by Joho Moyes, Tell the Wolves I’m Home by Carol Rifka Brunt, and Life After Life by Jill McCorkle.",
            "*Tomorrow and Tomorrow and Tomorrow* by Gabrielle Zevin",
            "A man called Ove",
            "The Notebook by Nicholas Sparks. I cried all over myself.",
            "Flowers for Algernon.",
            "I doubt I'll be the first or the last to mention this, but Flowers For Algernon",
            "Your autobiography 🥲",
            "The Lovely Bones,\nDear Edward,\nThe Glass Castle",
            "The Last Letter by Rebecca Yarros.",
            "Kite runner",
            "The end of The Giver gets me every time!",
            "Prophet Song by Paul Lynch",
            "Black Cake by Charmaine Wilkerson \n\nI know it’s mentioned constantly but Lonesome Dove by Larry McMurtry, it made me cry but not until the last like hundred pages.",
            "Tell the Wolves I’m Home by Carol Rifka Brunt",
            "The Nickel Boys by Colson Whitehead",
            "I cry every time I read Flowers for Algernon. Great book.",
            "Flowers for Algernon",
            "Life After Life and A God In Ruins by Kate Atkinson. Especially the latter but it helps to read the former first. \n\nMarley & Me?!\n\nBut I mean I still cry sometimes when I re-read the later Harry Potter books, so… 🤷‍♀️\n\nEdit: Love is Blind by William Boyd. That really made me cry",
            "The Kite Runner.",
            "Perks of Being A Wallflower hit too close to home.",
            "The Cider House Rules by John Irving, everytime.\nHowever, my first and only read of Sir Terry Pratchett’s final novel, The Shepherd’s Crown, had me crying like a baby.",
            "I don’t know about you, but The Soloist made me cry. I read it before the movie came out and it was one of the only books that has ever made me cry. It is non fiction, but it is written like fiction.",
            "The God of Small Things - Arundhati Roy",
            "Where the Red Fern Grows by Wilson Rawls  \nMy Sister's Keeper by Jodi Picoult  \nThe Year of Magical Thinking by Joan Didion  \nWave by  Sonali Deraniyagala",
            "The Last Ocean: A Journey Through Memory and Forgetting by Nicci Gerrard. Sobbing every chapter.",
            "Anxious people!!!\nMake sure you finish the book, then you would know when to cry. It’s a good book.",
            "Bridge to terebithia",
            "Message from nam..Danielle Steele",
            "The Light between Oceans by M. L. Stedman",
            "BARGAMOT AND GARASKA by Leonid Andreyev. When I read this novel I felt that what Aristotle called catharsis",
            "The Art of Racing in the Rain",
            "The most recent Hunger Games, Sunrise on the Reaping.",
            "Death Be Not Proud by John Gunther.  From Google AI... The memoir  recounts Gunther's son's struggle with a brain tumor and his eventual death.",
            "Young Mungo made me sob",
            "Before We Were Yours by Lisa Wingate. \n\nEspecially heartbreaking because it was based on true events that occurred in Memphis during the 1930’s.",
            "Lonesome dove. It’s a long journey but it just makes the pain more painful",
            "Promise Me Sunshine by Cara Bastone. I cannot stop thinking about this one.",
            "Andrew Davidson's The Gargoyle. I've read it a number of times and still cannot help but cry. It resonates with me, probably with all the references to Dante's Inferno. Which is my favorite read of all time.",
            "Flowers for Algernon",
            "Never Let Me Go by Kazuo Ishiguro.\n\nThat book tore me apart and remains one of my best loved books.",
            "The Yearling by Marjorie K. Rawlings -- guaranteed sobs...",
            "Have you read Where the Red Fern Grows?",
            "The Pull of the Stars by Emma Donoghue",
            "A Man Called Ove\n\nFlowers for Algernon\n\nThe Fault in Our Stars",
            "A Monster Calls by Patrick Ness. It is short. You will cry.",
            "I don't cry whenI read books, but {{ The Hour I First Believed by Wally Lamb }} choked me up.",
            "The Constant Gardener by John le Carré. The ending is so tragic.",
            "If you can get through His Majesty's Dragon without sobbing at the Levitas situation...I don't want to know you",
            "Martyr! - Kaveh Akbar",
            "The tattooist of aushwitch. Bro this book… honestly the saddest thing I’ve read to date",
            "Cyrano de Bergerac",
            "A little life",
            "Raising Hare: A memoir, by Chloe Dalton",
            "\nHello Beautiful by Ann Napolitano\n\nThe Berry Pickers by Amanda Peters\n\nTomorrow, and Tomorrow, and Tomorrow by Gabrielle Zevin",
            "The things they carried, Tim O’brien",
            "Also, a child called it",
            "I was a teen when I read them, but the end of the V.C Andrews *Flowers in the Attic* series definitely made me cry. \n\nAlso I haven’t read it, but apparently *Never Let Me Go* by Kazuo Ishiguro is a tear jerker.",
            "Elements of statistical learning. Reading its contents made me cry so hard that I never got to first chapter.",
            "IVF error fiction\n\nATST (yes, a nod to Blink 182-the book comes with a playlist!)  follows two protagonists undergoing IVF treatment at the same clinic. \n\nAs a former family therapist and mental health practitioner working with young people for almost two decades, I am more than a little interested in aspects of the environment and dynamics that impact families and relationships. Maybe that’s what sparked my interest to write All the Small Things (ATST), my debut novel, after reading a real news article which I couldn’t stop thinking about.\n\nThe article reported the tragedy of a Korean American couple in 2019 whom had accessed IVF at a Californian clinic using their twin fertilised female eggs. In the delivery room, apparently there is footage of the shock which ripples around the room as the mother delivers two clearly Caucasian boys. Six traumatic weeks later the biological mothers were traced and the infants -who were not twins- were returned to their separate mothers, one of whom had also been incorrectly impregnated with a fourth woman’s egg. The couple were left empty handed as their female fertilised eggs were unable to be traced.\n\nAlthough it is estimated that around 12 million people are alive through IVF intervention, statistically it’s incredibly rare, but errors can and do occur.\n\nI got to thinking about the weight of that decision and how agonising that must have been. What makes a mother? Is it genes, love, attachment? Legally, the infant is considered to belong to their biological parents, if they can be found. But what of the mother who ‘housed’ that baby, bonded, breastfed and loved that child? Do they have no rights? Should they? What about the child’s rights?\n\nI do want to be clear and raise a trigger warning that the novel contains some sensitive content involving infertility and mental health, addiction and loss, which I hope to have covered in the most sensitive way possible.\n\n[https://www.amazon.co.uk/All-Small-Things-Sharon-Noble/dp/B0DQ64N94X](https://www.amazon.co.uk/All-Small-Things-Sharon-Noble/dp/B0DQ64N94X)"
        ]
    },
    {
        "id": "1kh0ez8",
        "title": "Book recommendations for a 12 year old girl.  Fantasy and non fiction especially.",
        "score": 46,
        "num_comments": 203,
        "link": "https://www.reddit.com/r/suggestmeabook/comments/1kh0ez8/book_recommendations_for_a_12_year_old_girl/",
        "content": "My daughter is about to turn 12 and loves books.  She's into fantasy (Keeper of the lost cities, Twilight, LOTR were recent reads) and non fiction (history, math, science).  Looking for book ideas to get her for her birthday.  Bonus points for strong female characters.",
        "comments": [
            "Tamora Pierce: Song of the Lioness quartett, Protector of the Small quartett \n\n\nCornelia Funke: Inkheart",
            "His Dark Materials trilogy",
            "The Tiffany Aching subseries of the Discworld novels by Terry Pratchett. Start with The Wee Free Men.",
            "Anything by Gail Carson Levine :) Ella Enchanted is what I would start with",
            "Howl's Moving Castle by Dianna Wynne Jones (Funny, whimsical, great female protagonist)  \nA Wrinkle in Time series by Madeleine L'Engle (A classic series, but can be read as a standalone, with multiple female characters)  \nThe Wyrd Museum trilogy by Robyn Jarvis (Extremely underrated. Protagonist is a boy, but the supporting cast is 3 cool elderly witches and a super-smart girl, involves mythology and time travel)  \nElla Enchanted by Gail Carson Levine (Whimsical, romantic, great \"intro to feminism\" message for young girls)  \nAbarat by Clive Barker (Underrated. Female protagonist/chosen one with fantasy's greatest name ever: Candy Quackenbush)",
            "Tamora Pierce's *Circle of Magic* quartet and sequel *Circle Opens* series. Sandry, Daja and Tris were the most badass tweenage girl mages I've ever had the pleasure of running across as a child bookworm.\n\n\nTheir only competition? Sabriel and Lirael, from Garth Nix's Old Kingdom trilogy.",
            "Sabriel by Garth Nix",
            "The Chronicles of Prydain by Lloyd Alexander are so, so good. Set of five books based on Welch legend. It's about friendship and found family, figuring out who you are as you grow up, making the right choices, good versus evil. When I was a 12-year-old who loved to read, these were my favorite books. They were written some decades ago, but I think they still hold up very well.",
            "Pretty much anything by Tamora Pierce. My favorite is her *Protector of the Small* quartet (book 1 is called *First Test*)",
            "The Girl who Drank the Moon. Kelly Barnhill",
            "Something by Ursula Le Guin?",
            "The Lunar Chronicles!",
            "For nonfiction recommendation, What If?: Serious Scientific Answers to Absurd Hypothetical Questions by Randall Munroe. It’s a super fun book, and Randall is a really cool guy.",
            "Enchanted Forest chronicles by Patricia Wrede\n\n\nNevermoor series by Jessica Townsend \n\n\nQueen's Arrow by Mercedes Lackey\n\n\nSabriel (Old Kingdom series) by Garth Nix ",
            "Harper Hall trilogy by Anne Mccaffrey.\n\nShadow and Bone trilogy but mostly to get to Six of Crows duology. Can be read alone but she might want the whole thing.\n\nShades of Magic by V E Scwab? Not strictly YA but I would have adored these at 12. Same with Sorcery and Thorns by Margaret Rogerson. She also did Vespertine which is YA and very good.\n\nMaybe Ember in the Ashes by Sabaa Tahir?\n\nPaper Magician by Charlie Holmberg?",
            "Anything by Dianna Wynne Jones",
            "The Phantom Tollbooth by Norton Juster.\n\nAkata Witch, Akata Warrior and Akata Woman by Nnedi Okorafor\n\nTamora Pierce, Diana Wynne Jones, and Patricia Wrede.\n\nThe Blue Sword and The Hero and the Crown by Robin McKinley\n\nThe Tiffany Aching books by Terry Pratchett",
            "Dragonsong, Dragonsinger, and Dragondrums by Annie McCaffrey\n\nA 15-year-old girl is the main character in the first two books and then young boy is the main character in the third book.",
            "Robin McKinley books are classics - anything but Deerskin, which is too much for a pre-teen. \n\nI would start with The Blue Sword and The Hero and the Crown, though.",
            "FICTION- I have a ton of suggestion, and I have read all of these.\n\nTamora Pierce:\nCircle of Magic series\nSong of the Lioness series\nProtector of the small series\n\nSherwood Smith:\nWren to the Rescue\nWren's Quest\nWren's War\nWren Jourmeymage\n\nPatricia C Wrede:\nThe Enchanted Forest Chronicles\n\nNancy Springer:\nThe Enola Holmes series\n\nMaryRose Wood:\nThe Incorrigible Children of Ashton Place\n\nUrsula K Leguin:\nCatwings series\n\nDiana Wynne Jones:\nHowl's Moving Castle series\n\nShannan Hale:\nThe Princess Academy series\n\nConnie Glenn:\nThe Undercover Princess series\n\nJennifer Lee Simner:\nGhost Horse\nThe Haunted Trail\n\nZilpha Keatley Snyder:\nLibby On Wednesday\n\nMarguerite Henry:\nThe Misty of Chincoteague series\n\nMary Norton:\nThe Borrowers\n\nLois Lowry:\nAnastasia Krupnik series\n\nFrances Hodges Burnett:\nThe Secret Garden\n\nJohn Lawrence Peterson:\nThe Littles\n\nMadeline L'Engle:\nA Wrinkle In Time\n\nRobert C O'Brian:\nMrs Frisby and the rats of NIMH\n\nGail Carson Levine:\nElla Enchanted\nThe Two Princesses of Bamarre\n\nCornelia Funke:\nThe Inkheart Trilogy\n\nEoin Colfer:\nThe Artemis Fowl series\n\nDiane Duane: \nThe Young Wizards series\n\nCS Lewis:\nChronicles of Narnia\n\nRoald Dahl:\nMatilda\n\nLM Montgomery:\nThe Anne of Green Gables Series\nThe Story Girl\n\nL Frank Baum:\nThe Wonderful Wizard of Oz\n\nNorton Juster:\nThe Phantom Tollbooth\n\nLouis Sacher:\nWayside School series\nHoles\n\nLouis Fitzhugh:\nHarriet the Spy\n\nDeborah Howe:\nBunnicula series\n\nNatalie Babbit:\nTuck Everlasting\n\nLloyd Alexander:\nThe Chronicles of Prydain\n\nBruce Coville:\nThe Unicorn Chronicles \n\nLemony Snicket:\nA Series of Unfortunate Events series\n\nAngie Sage:\nSeptimus Heap series \n\nBrandon Mull:\nFablehaven\n\nHolly Black:\nThe Spiderwick Chronicles \nDoll Bones\n\nE. Nesbit:\nFive Children and It\n\nChristina Brand/Emma Thompson:\nNanny McPhee books\n\n\nNON-FICTION- I only have a couple suggestions, I did not tend to reread non fic, and it was read for school usually. \n\n\nThe Dear America books\n\nLois Lenski:\nIndian Captive: The Story of Mary Jemison",
            "Akata Witch - Nigerian girl discovers she's a Leopard Person, meaning one with magical abilities related to her greatest mundane weakness.\n\nSabriel - A young woman with the necromantic power to lay the dead to rest has to find out what's happened to her father and possibly save the world.\n\n Juniper (or Wise Child, but I think Juniper is a better book). Historical fantasy set in Cornwall about a young woman who learns to be a doran (witch)\n\nThe Blue Sword - a young woman moves to the desert where her brother is posted. She's abducted by the local people and turns out to have latent abilities that will help lead them in battle against evil, and also make peace between their peoples.",
            "The Midnight Queen Trilogy. \n\nEssentially Harry Potter with a female protagonist, all about a girl going to magical college when it's a boy's thing to do and learning about magic, feminism, resurrecting a forgotten woman's college. \n\nIt's very good with some interesting magic systems in it.",
            "The Chronicles of Prydain by Lloyd Alexander. I read them when I was about that age. The main character is a boy- Taran, but he meets and befriends a girl- Princess Eilonwy- who is important for the series and for the main character,.\n\nI can also recommend Redwall by Brian Jacques. It's medieval Europe, but all the characters are mice, badgers, and other woodland creatures.",
            "Anything recent by Naomi Novik - The Scholomance trilogy (starting with A Deadly Education), Spinning Silver and Uprooted. Her Temeraire series is good too, but it's basically Master and Commander with Dragons - the Navy stuff might not be her cup of tea.",
            "Stalking Jack the Ripper by Kerri Maniscalco. Her YA series. It’s a Victorian era, gothic series. Very much Sherlock and Watson vibes. The main character is a woman who wants to be a Medical Examiner/Mortician person (idk the term for that era), but as a woman she can’t really be that. A modern thinking strong female character. I love this author since I can vividly know what the characters look like in each scene the author describes the outfits and dresses and shows the FMC’s feminine qualities while battling societal norms. If she likes it her other YA series might need to wait a year or two- and Throne of the Fallen is an adult series. \n\nShadow and Bone by Leigh Bardugo. Very much a fantasy. I’d suggest the first trilogy and maybe wait a year or so for the other two duologies since they get a little darker. \n\nDivine Rivals\n\nA Study in Drowning\n\nUglies by Scott Westerfeld. I read this around the same age, and absolutely love the series. \n\nEragon, and The Inheritance Cycle. Main character is a male but it has plenty of strong female characters. \n\nDefy the Night by Brigid Kemmer. It’s a genderbent, Robin Hood inspired story. \n\nLegendborn, is an Arthurian based fantasy for YA. \n\nVoyage of the Frostheart. \n\nI would say Percy Jackson and Inkheart. Maybe the Nevermoor series and The Series of Unfortunate Events. If she likes spookier stuff- Small Spaces (four books, very Goosebumps esque)\n\nThe Golden Compass series. \n\nHouse of Salt and Sorrows and Small Favors by Erin Craig\n\nHorror YA (slasher) Clown in A Cornfield (3 books). It’s got a FMC and she’s totally a strong female. I need the third book lol- and I’m terrified of clowns so this says something when I like it.",
            "Sabriel Garth Nix.",
            "Tamora Pierce is a lovely author for fantasy i think your daughter would enjoy. Also Lois Lowry has a series “anastasia krupnik” that is superb. You may recognize the authors name from her works The Giver, Number the Stars, etc",
            "Tamora Pierce - I started with the Song of the Lioness quartet around that age, and would definitely recommend it. Other comments here mention her other series that are also great fantasy reads at that age - many have strong female leads.",
            "flavia de luce series. Not fantasy but really fun about a girl her age who's very unique and solves mysteries.",
            "- Legendborn cycle by Tracy Deonn\n- Divine Traitors: Kamilah Cole\n- Legacy of Orisha Series by Tomi Adeyemi",
            "Percy Jackson & the Olympians series by Rich Riordan\n\nDealing with Dragons by Patricia C. Wrede ",
            "The wee free men, Terry Pratchett",
            "The Eyes of the Dragon by Stephen King",
            "Sherwood Smith,\n\nTamora Pierce,",
            "**Child of the Morning**, by Pauline Gedge. A historical fiction account of Hatshepsut, who used to be considered Egypt's first female pharaoh. (Some other possible pharaohs have since been identified.) A school librarian recommended it to me when I was 13, and I loved it. I don't think it has any explicit content, or it likely wouldn't have been in my school library, but she does marry her half-brother, and she takes a lover. If Twilight was okay, this one should be fine!",
            "**The Crystal Cave**, **The Hollow Hills**, **The Last Enchantment**, and **The Wicked Day**, by Mary Stewart. I don't remember whether I ever read the fifth, The Prince and the Pilgrim, but the other four were fantastic when I was 11!\n\n**The Mists of Avalon**, by Marion Zimmer Bradley, for a feminist take on the legend. I don't recall whether this might be too mature for her. But it was possibly the first book I read that made me realize a story could be interpreted completely differently based on gendered POVs. Edit: I agree with u/ShakespeherianRag that this would not be appropriate for a 12-yo.",
            "{{the fifth season}} plus the two sequels\n\n{{Akata witch}} plus the two sequels\n\n{{children of blood and bone}} plus the two sequels\n\n{{lobizona}}  there is a sequel, and it's good as a book, but for me it was sadder than the first one\n\n{{stargirl}}\n\n{{Kiki kalari breaks a kingdom}}\n\n{{tress of the emerald sea}}\n\n{{the girl who circumnavigated fairyland in a ship of her own making}}\n\n{{show me a sign}}\n\n{{legends and lattes}} and the sequel!! \n\n{{mirage}} and the sequel\n\n{{we hunt the flame}} and the sequel\n\n{{the house in the cerulean sea}} and the sequel\n\nAnd I'm a huge fan of The Secret Series by pseudonymous bosch",
            "Inkheart Trilogy by Cornelia Funke\n\nMapmakers Trilogy by S.E Grove",
            "Mary Roach books. Randall Munroe books. Both science communicators with markedly different styles.",
            "The Green Rider series by Kristen Britain and the Graceling series by Kristin Cashore.",
            "The Girl Who Drank the Moon - Kelly Lockhart",
            "Legendborn by Tracy Deonn. There are three books out,  with one left to be published.",
            "She would probably enjoy A Short History of Nearly Everything by Bill Bryson",
            "Abarat by Clive Barker was my teenage trilogy. I still read it once a year. Also, the glass castle is a good nonfiction I recommend everyone reads.",
            "Watership Down",
            "Because I can’t find any comment that says it; Skulduggery Pleasant.",
            "Does it have to be YA?  I loved Terry Brook's Shanara books when I was her age or a bit older.  I've seen him getting hate lately but as you go on they get more original.  Besides original is the most overrated idea anyways there's only three stories in all of human history it's not what you tell that matters but how.",
            "Eragon was my favourite book around that age; there are plenty of strong women, even if the protagonist is male.  It's probably what started my lifelong love of dragons.",
            "For non-fiction, try The Mona Lisa Vanishes. It's about the theft of the Mona Lisa. Reads like a detective novel.",
            "I loved all of the Tamora Pierce books at her age!!! Great fantasy, great female leads.",
            "The Dark is Rising sequence by Susan Cooper.",
            "Anything by Rose George, Judy Melinek, Caitlin Doughty, or Mary Roach.",
            "The Unwanteds by Lisa McMann is a really good option if she likes kotlc or Jake Ransom by James Rollins",
            "The Search for Wondla by Tony DiTerlizzi",
            "Mapmaker’s Mistake!",
            "Get her the book that mixes a strong female lead with brilliant science: Contact by Carl Sagan. Chef’s kiss—a masterpiece of fiction.",
            "[Nevermoor](https://app.thestorygraph.com/books/6a6d5ca1-b2f5-47be-828c-018144d3bbc7) by Jessica Townsend! It's my favorite series even as an adult, and I would have loved it at 12 years old as well :)",
            "The Sevenwaters Trilogy, by Juliette Marillier! Changed my life in middle school and I still enjoy rereading them in my 30’s",
            "Sophie’s World by Jostein Gaarder\n\nAre You There, God, It’s Me Margaret\n\nAnne Frank’s Diary",
            "His Dark Materials by Phillip Pullman. It's known as \"the Golden Compass series\" by some, has a poorly made movie and fairly good series, but all around a phenomenal read. I spent an entire summer in my preteens rereading this series.",
            "Katherine Arden has a 4-book series called the Small Spaces Quartet, with a main trio of two girls and one boy. There’s a book for each season, starting with autumn. Goosebumps-like",
            "Tress of the emerald sea - Sanderson \nWizard of earthsea- Ursula k leguin",
            "Fablehaven by Brandon mull for straight up fantasy. \n\nThe gideon trilogy by Linda Buckley-Archer to tie in her love of science and history with fiction. \n\nThe Divide by Elizabeth Kay. \n\nMichael Vey by Richard Paul Evans. This one is a sci fi that gets pretty detailed (especially for being YA) into the science behind the things that happened, so she might be drawn to that.",
            "Avalon High by Meg Cabot \n\nIt was one of my favorites at this age because it fused modern experiences with Arthurian legend. It’s a great introduction to that as I’m sure King Arthur will pop up in a future syllabus for her some day.",
            "The Looking Glass Wars series by Frank Beddor is a really cool retelling of Alice in Wonderland \n\nThe Land of Elyon by Patrick Carmen is about a girl who sneaks out of her walled kingdom and gains the ability to speak to animals. First book is The Dark Hills Divide\n\nBroad Strokes by Bridget Quinn is an art history book that gives an introduction to 15 different women artists",
            "mortal instruments series",
            "The House on Chicken Legs and The Castle of Tangled Magic by Sophie Anderson",
            "If she's read and enjoyed the Percy Jackson series (which seems likely to me), check out the Cronus Chronicles by Anne Ursu -- also Greek-myth-based but the characters are mortals. Starts with \"The Shadow Thieves.\"",
            "Persepolis",
            "I really enjoyed the divergent series around that age!",
            "Skyward!!",
            "percy jackson! the mortal instruments! beautiful creatures! the hunger games! the red queen!",
            "Terry Brooks *Running with the Demon*.",
            "I just finished book two of the Last Dragonslayer series. It's not too serious and has a female lead that doesn't fall into a love story!",
            "The Ranger’s Apprentice series by John Flanagan was my favorite at her age",
            "*Humble Pi: When Math Goes Wrong in the Real World* by Matt Parker. All of Parker's books are great and fun at communicating math.",
            "A Wrinkle in Time by Madeline L'Engel",
            "The Mapmakers Trilogy series by S.E. Grove (start with The Glass Sentence, all books out now).\n\n\nDauntless Path series by Intisar Khanani (start with Thorn, all books out now)\n\n\nHowl's Moving Castle by Diana Wynne Jones\n\n\nRevolution by Jennifer Donnelly \n\n\nStardust by Neil Gaiman\n\n\nTales of the Kingdom series by Cynthia Voigt (start with Jackaroo, all books out now)\n\n\nThe Finishing School series by Gail Carriger (start with Etiquette and Espionage, all books out now)",
            "For fantasy, here are some that my 13 year old daughter loves:\n\nThe Warrior Cats books by Erin Hunter \n\nPrydain Chronicles by Lloyd Alexander \n\nThe Amazing Maurice and His Educated Rodents by Terry Prachett\n\nThe Aru Shah series by Roshani Chokshi\n\nSerwa Boateng series by Rosanne A Brown\n\nPahua Moua series by Lori M Lee\n\nRace to the Sun by Rebecca Roanhorse \n\nThe Marvellers by Dhonielle Clayton\n\nThe Magic Thief by Sarah Princess\n\nThe Dragon Pearl by Yoon Ha Lea\n\nFor non-fiction, it really depends on where your daughter's interests are. Mine likes space and mythology, so she has a bunch of (definitely above grade level) books on space and some books with translations of Greek and Norse mythology",
            "The Iron Fey books.",
            "I loved Gregor the Overlander by Suzanne Collins (far less known than The Hunger Games), and the Fablehaven series by Brandon Mull! I love nonfiction but unfortunately don't have any recs for that age :/",
            "I’d get the shannara series. Starts with the sword of shannara.",
            "Pretty much anything by Rick Riordan (Percy Jackson, Magnus Chase, Trials of Apollo, Kane Chronicles), The Kingdom Keepers series by Ridley Pearson, Inkheart trilogy by Cornelia Funke.",
            "When my kid was 12, she really got into graphic novels (which was a new thing to me).\n\nI remember her loving:\n\n  \nSmile, by Raina Telgemeier\n\nDrama, by Raina Telgemeier\n\nEl Deafo, by Cece Bell\n\nThe one non-graphic novel she loved at this age was The War That Saved My Life by Kimberly Brubaker Bradley. \n\n  \nGood luck with her birthday! I'm sure she'll love whatever she gets.",
            "Fantasy:\n\n•His Dark Materials by Philip Pullman\n\n•Wings of Fire by Tui Sutherland\n\n•The Black God's Drums by P Djèli Clark\n\n\nNon fiction: memoirs/biographies of people like Janet Jackson, Temple Grandin, Malala Yousafzai, Maya Angelou, Maria Tallchief... specific picks would depend on her current reading level, I think? My main recommendation is simply that a variety of ethnicities/backgrounds is presented",
            "A Great and Terrible Beauty (Gemma Doyle trilogy) by Libba Bray\n\nThe Goose Girl (Books of Bayern) series by Shannon Hale",
            "Good YA series I’ve read multiple times {{The Guardians of Ga’Hoole by Kathryn Lasky}} the first three books in the series were adapted into a film in 2009.",
            "When I was her age, I fell in love with the Vampire Kisses series by Ellen Schreiber. Also loved Among The Hidden series by Margaret Peterson Haddix. Idk how you'd feel about her reading Godless by Pete Hautman (about a group of atheist kids declaring a towns water tower as their new god) or Freaks and Revelations by Davida Wills Hurwin (based on true events during a time punks and skinheads were fighting each other, can be a bit graphic but I read it when I was about 14). These live forever in my head lol",
            "My time to shine! \n\n-The Cerulean Chronicles series by TJ Klune is fantastic and made me (a thirtysomething mom) cry lol \n\n-The Wildwood Chronicles by Colin Meloy is so immersive and beautiful \n\n-Colin Meloy also has a few standalone novels that are fantastic (The Whiz Mob & the Grenadine Kid and The Stars Did Wander Darkling) \n\n-Dallergut Dream Department Store by Mi Ye Lee is cozy and ethereally existential, also made me cry\n\n(Edited bc formatting)",
            "Dragonriders of Pern!",
            "The Red Queen series by Victoria Aveyard could be a good fit.",
            "The Invisible Life of Addie LaRue by V.E Schwab\n\nThe Lunar Chronicles by Marissa Meyer (fairy-tale/ sci-fi mashups)",
            "Diana Wynne Jones's books like Howl's Moving Castle or The Lives of Christopher Chant and Walter Moers' ones (I had sooo much fun with Ensel e Krete)",
            "Love Letters of Abelard and Lily",
            "Margaret Peterson haddox has really good books\nthe poison book and the author who wrote that has really good books (purple cover with a girls face on it if I recall correctly) \nin the forest of the night is another good series",
            "Mercedes Lackey's Arrows of the Queen trilogy. It's a little more mature, but if she's read both lotr and twilight it should be fine.",
            "Graceling by Kristin Cashore\n\nI'll second Wrinkle in Time and Howl's Moving Castle as others have suggested, too!",
            "Dead is the new black. 7 books in the series about vampires. Haven’t read them yet but they’re on my shelf in my classroom. Vampire academy series. Wicked series by Nancy holder and Debbie vigué. Born at midnight series",
            "House of Night series",
            "A Wrinkle in Time by Madeleine L'Engle",
            "The Tomorrow series by John Marsden. Falls into the Dystopia category but it is a great read and the FMC is bad ass",
            "Fabelhaven it was my favorite at that age",
            "[*El Deafo*.](https://www.amazon.com/dp/1419748319/?bestFormat=true&k=el%20defeo&ref_=nb_sb_ss_w_scx-ent-pd-bk-m-si_de_k0_1_6&crid=29VRLF9LPRLFN&sprefix=el%20def). My daughter loved it.",
            "The Tiffany Aching books by Terry Pratchett, starting with The Wee Free Men! Pratchett is HILARIOUS, and his characters and worldbuilding are top-notch.\n\n\nLeviathan by Scott Westerfeld for sure. ",
            "Derek Borne:s Dino-rift series. There are 3 books",
            "Plain Kate by Erin Bow.",
            "Lloyd Alexander's Prydain books.  Anne of Green Gables.  The Once and Future King.",
            "Gregor the Overlander series by Suzanne Collins. Main character is a boy, but there is a strong female character.",
            "The Who Was series of biographies and other historical nonfiction are terrific. My daughter loves them and waits for each new one to come out.",
            "[https://us.macmillan.com/series/theladytrentmemoirs](https://us.macmillan.com/series/theladytrentmemoirs) might fit the bill! You could also check out Dragonhaven by Robin McKinley (https://www.goodreads.com/book/show/149338.Dragonhaven) and Fablehaven by Brandon Mull.",
            "Since you didn’t list it I’ll recommend Percy Jackson & the olympians series\nWarriors cat series (if she’s on LOTR at 12 she might be past it already) \nThe School for Good and Evil by Soman Chainani\nThe Girl Who Drank the Moon by Kelly Barnhill \n\nNon-fiction:\nWomen in Science: 50 Fearless Pioneers Who Changed the World by Rachel Ignotofsky \nGood Night Stories for Rebel Girls by Elena Favilli and Francesca Cavallo",
            "Animorphs. \n\nInterview with the Robot.\n\nThe Nemesis chronicles (Dreadnought and Sovereign, and the third book is coming soon)",
            "[A Wizard’s Guide to Defensive Baking](https://www.goodreads.com/book/show/54369251-a-wizard-s-guide-to-defensive-baking) was wonderful.",
            "Nevermoor series by Jessica Townsend, Billy Thunder and the Night Gate by Isobelle Carmody, and rangers apprentice series by John Flanagan. Just to throw some fantastic Aussie fantasy authors in here. ",
            "The Enchanted Forest Chronicles are a great series! They play on traditional fairy tale tropes.\nI also really suggest the Protector of the Small series as well as the other series by Tamora Pierce (PotS is far and away my favourite of her series though)",
            "tress of the emerald sea",
            "The Inkheart trilogy by Cornelia Funke is a very fun and interesting fantasy series! (Young girl protagonist, her dad is also involved)\nI'd also recommend the Chronicles of Vladamir Tod series by Heather Brewer (5 books), it's about a young (middle/high school-age) vampire!!\nAlso, the Cirque Du Freak series by Darren Shan, there's 12 total books, and it's a really interesting and fun concept! There's vampires and other fantasy creatures involved.",
            "The Land of Stories, A Wrinkle in Time, Amari and the Night Brothers, Wings of Fire, Percy Jackson, The Narnia Chronicles",
            "Sunshine - Robin McKinley",
            "Ender's Game",
            "I really enjoyed the \"Uglies\" book series by Scott Westerfeld at that age. Sci-Fi with YA style love triangles. Has some good themes about body image, body autonomy etc. And its just a mega page turner.",
            "Akata Witch, Akata Warrior and Akata Woman by Nnedi Okorafor",
            "If she hasn't already read it, the *Percy Jackson* series is great! *Howl's Moving Castle* is fantastic and has a strong female lead. *The Spiderwick Chronicles* is amazing. Anything Kate DiCamillo has written but if you had to start somewhere do *The Tale of Despereaux*. Also, *Ingo* by Helen Dunmore. Congrats to you on raising a reader!",
            "Dragonsinger, Dragonsong and Dragondrums by Anne McCaffrey.",
            "My daughter and I just read The Bletchley Riddle and both loved it. \nIt is historical fiction. The protagonist is a clever 14-year old girl who finds herself solving a mystery while delivering messages at Bletchley park as WWII hits England.",
            "The Dark Lord Clementine by Sarah Jean Horwitz",
            "Percy Jackson\nSeries of Unfortunate Events \nWarrior Cats\nChronicles of Narnia \nHarry Potter\nHunger Games\nDivergent",
            "The Blue Sword and The Hero and the Crown both by Robin McKinley.",
            "A Wizard’s Guide to Defensive Baking by T Kingfisher would be awesome for that age!!!",
            "If she hasn't yet read Holly Black, she's in for a treat IMO.",
            "Books of Pellinor. Very underrated fantasy quartet.",
            "A Wrinkle in Time (and the rest of the series by Madeleine L’Engle).",
            "Cinder : lunar chronicles (its amazing)",
            "So many great fantasy recommendations in the comments, so I'd like to give a non-fiction (science) recommendation instead - A Brief History of Time by Stephen Hawking. I got it as gift as a kid and I would credit it partially for me going into STEM.",
            "Tomorrow When The War Began- book series. Strong female lead. Teenagers being competent and having agency",
            "Fablehaven series!",
            "Wrinkle in time series",
            "The Path Between The Seas. David McCullough. If she's a history bookworm, she will love it.\n\nAs far as women, how about a biography of Marie Curie?",
            "The Mortal Instruments by Cassandra Clare (starting with city of bones)\n\nHarry Potter \n\nRuby Red by Kerstin Gier\n\nThe girl who drank the moon \n\nAnything by Michael Ende (Momo, Neverending story etc.)"
        ]
    },
    {
        "id": "1kbn74m",
        "title": "I'm 16, recommend me 5 books from different genres that are actually worth reading",
        "score": 95,
        "num_comments": 170,
        "link": "https://www.reddit.com/r/suggestmeabook/comments/1kbn74m/im_16_recommend_me_5_books_from_different_genres/",
        "content": "I’m 16 and trying to get into reading more, but I don’t want to fall into the trap of only reading one type of books. could you give me 5 books from different genres that’s either really fun to read or actually helpful in some way.  \nCould be fiction, non-fiction, fantasy, sci-fi, self-help, mystery, whatever, as long as each one feels a bit different and not boring. Not looking for anything super slow or dry, just books that hit and feel worth the time.",
        "comments": [
            "Some good popular books:\n\n\nFantasy - Reaper Man (Terry Pratchett)\n\n\nMystery - And Then There Were None (Agatha Christie)\n\n\nClassics - Pride and Prejudice (Jane Austen)\n\n\nHorror - Misery (Stephen King)\n\n\nNon fiction - Man's Search For Meaning (Viktor Frankl)\n\n\nHappy reading!",
            "* Catch and Kill by Ronan Farrow (nonfiction/memoir)\n* Red Rising by Pierce Brown (science fiction)\n* The Will of the Many by James Islington (fantasy)\n* Into The Wild by John Krakauer (biography)\n* Slaughterhouse Five by Kurt Vonnegut (classic)",
            "While this might be unrelated, I don't understand why you refer to reading books of the same genre as a \"trap\". This might be obvious but i feel that since you are getting into reading, you should experiment, but at the end of the day read whatever genre you prefer.",
            "Political Allegory: Animal Farm - Orwell\n\nScifi: Do Androids dream of Electric sheep - Phillip K Dick\n\nDark Fantasy: Wicked - Gregory Maguire (it's nothing like the movie or play) \n\nStream of consciousness: The Stranger - Camus\n\nNon fiction: Capitalist Realism - Mark Fisher",
            "Fun.\n\nSciFi  : Dungeon Crawler Carl by Matt Dinniman\n\nHorror: The Only Good Indian by Stephen Graham Jones\n\nThriller: Orphan X by Gregg Hurwitz\n\nFantasy: Mistborn The Final Empire by Brandon Sanderson\n\nMystery: The Never Game by Jeffrey Deaver",
            "I don’t have time to give a full list but you should read Bill Bryson’s A Short History of Nearly Everything. I hated science as a kid and this book gave me a newfound love for it",
            "Sci-Fi - All Systems Red by Martha Wells (the entire murderbot series is excellent even if youre not really into sci-fi)\n\nContemporary Fiction- Bear Town by Fredrik Backman (any book by Backman is excellent, you can't really go wrong)\n\nHorror - Mexican Gothic by Silvia-Garcia Moreno\n\nClassic Lit - Jane Eyre by Charlotte Brontë. \n\nFantasy - The House on the Cerulean Sea by T.J. Klune. (This book is adorable and if you like audiobooks, the narrator does a spot on job)\n\nEdited because I accidentally saved before I was done",
            "1) Good Omens (hilarious good vs evil - audio is great,  too)\n2) Harun and The Sea of Stories (fantasy, almost like a fairy tale)\n3) 1984 (dystopia)\n4) Ghost Hawk (historical fiction) \n5) Catch 22 (war book)\n6) (Bonus book) Dracula (horror + classic)",
            "Animal Farm\n\nBreakfast of Champions \n\nSalem’s Lot\n\nGuards! Guards! \n\nStoner",
            "Classic: Lord of the Flies by William Golding\n\nFantasy: Promise of Blood by Brian Mclellan\n\nSci-fi: Red Rising by Pierce Brown\n\nHorror: (cant decide so you get two) Pet Semetary by Stephen King or Blindsight by Peter Watts\n\nHistorical: Rape of Nanking by Iris Chang\n\nEdit: Blindsight is both sci-fi and horror but you can decide which it falls into more",
            "Fantasy: Uprooted by Naomi Novik\n\nSci-fi: All Systems Red by Martha Wells\n\nNon-fiction: Braiding Sweetgrass by Robin Wall Kimmerer\n\nClassical literature: Pride and Prejudice by Jane Austen\n\nThriller: None of This is True by Lisa Jewell",
            "Siddhartha by Hermann Hesse.",
            "The Girl With All the Gifts. by M.R. Carey - post-apocolyptic fiction\n\nNight Shift, by Stephen King - an older collection of short stories that really show his range\n\nWelcome to the Monkey House, by Kurt Vonnegut - an older collection of short stories that are amazing\n\nFried Green Tomatoes, or any other book by Fannie Flagg - her writing style is so good, and the book is much better than the movie was\n\nTitan / Wizard / Demon trilogy, by John Varley - older sci-fi / fantasy - not too \"techie\" and such a great story line\n\nAll of these authors have plenty of other books you'd probably enjoy too! Happy Reading!",
            "Good ask. \n\nFiction: The New York Trilogy by Paul Auster\n\nNon-Fiction: In the Heart of the Sea\n\nFiction: Slaughterhouse Five\n\nNon- Fiction: A Little Devil in America by Hanif Abdurraqib\n\nGraphic Novel: Asterios Polyp by David Mazzucchelli",
            "Thriller- The cellar by Natasha Preston\nSci-fi - The warning by Kristy Acevedo\nHorror- The outsider by Stephan king\nSelf-Help - The way I used to be",
            "Fiction: The Hunger Games books or the Maddadam trilogy; Non-Fiction: Outliers or Brain Rules; Fantasy: Circe or Godkiller; Sci-Fi: Cloud Atlas; Self-Help: Emotional Intelligence or Atomic Habits; Mystery: God of the Woods or Listen for the Lie",
            "Fiction: Lullabies for Little Criminals by Heather O’Neill\n\nNon-Fiction: Educated by Tara Westover\n\nHistorical Fiction: Harriet Tubman: Live in Concert by Bob the Drag Queen \n\nMythology/fantasy: Circe by Madeleine Miller \n\nContemporary fiction: The Seven Husbands of Evelyn Hugo by Taylor Jenkins Reid",
            "Here are some classics that you might like. \n\nDesert Solitaire by Ed Abbey - autobiography/environmental\n\nBluebeard by Kurt Vonnegut - general fiction\n\nThe Hobbit by J.R.R. Tolkien - fantasy \n\nIt by Stephen King - horror\n\nThe Space Merchants by Pohl and Kornbluth - sci-fi",
            "Fantasy: Discworld-- specifically the book Guards! Guards! if you live in america and are worried about the political climate here because it does such a good job satirizing authoritarian governments to the point I got goosebumps. \n\nNonFiction: (Specifically memoir): I'm Glad My Mom Died by Jennette McCurdy or The House of My Mother by Shari Franke\n\nContemporary Fiction: Beartown by Frederick Backman\n\nClassic: The Bell Jar by Sylvia Plath, East of Eden by John Steinbeck, or (and it gets recommended *so often* but it's *so worth it)* Count of Monte Cristo by Dumas\n\nSciFi: Red Rising trilogy singlehandedly brought back my love for reading I ate it UP",
            "• *A deadly education* by Naomi Novik. YA fantasy.\n\n• *The inseparables* by Simone de Beauvoir. A semi-autobiographical, short novel.\n\n• *Project Hail Mary* by Andy Weir. A scifi novel that is really emotional.\n\n• *Sweet bean paste* by Dorien Sukegawa. A novel about beginning again that is very, very sweet.\n\n• *The lion, the witch, and the wardrobe* by C. S. Lewis. It's part of the Chronicles of Narnia, a great series for children that can be enjoyed by anyone.",
            "Douglas Adams / Mark Carwardine: Last Chance to See - astonishingly manages to be a funny book about endangered animals\n\nDavid Mitchell: Unruly - this one is a really funny book about the history of British monarchs\n\nJohn Scalzi: When the Moon Hits Your Eye - answers the important question: what would happen if the moon suddenly turned to cheese?\n\nConnie Willis: To Say Nothing of the Dog . a very amusing time travel story (while not a true sequel, it is part of a loose series, you might want to read The Domesday Book first, which is also brilliant, but rather darker and long; there's also quite a few allusions to Jerome K Jerome's Three Men In A Boat - which is another quite enjoyable read)\n\nI'd also recommend Terry Pratchett's Discworld, but be warned that this a good 30 books all in all. You could start with the first one, which is The Colour of Magic, although I'd personally recommend either the first witches novel Equal Rites, or the fitst city guard novel Guards! Guards!",
            "I’m going to kind of cheat and suggest just three books by the same author, Jorge Luis Borges: *Collected Fictions,* *Other Inquisitions,* and *Dreamtigers.* \n\nYou want different genres? *Collected Fictions* contains short stories spanning sci-fi, almost fairy tale fantasy, horror, mystery, and western, but all of which have a unique spin and (usually) a heavy emphasis on philosophy. Fictional objects appearing in the real world, a library containing books that iterate every possible arrangement of the latin alphabet, a man whose memory is so perfect he’s incapable of abstraction, a book with seemingly infinite pages, a meeting between a past and future version of oneself, nostalgia for the gaucho days in Argentina while tacitly questioning whether those days are real or a literary invention… This is just a small smattering of concepts Borges explores in his tight (usually just a few thousand word) stories.\n\nAt minimum, my top three favorite short stories of all time are all found in this collection, along with many others in my top 10 or 20. There is not another writer, living or dead, who has written such thought-provoking and perfect gems of prose as Borges has. \n\n*Tlön, Uqbar, Orbis Tertius* from the *Collected Fictions* is my favorite piece of fiction ever written. In just about 5000 words, it contains more creativity and concepts than many authors manage in an entire career. You can easily read it in a sitting, but I have spent years rereading it and thinking about it, and I believe there’s still more for me to discover. \n\n*Other Inquisitions* is a collection of essays exploring philosophy and literary history. Most are just a few pages long, but leave you feeling like you’ve read a tome. \n\n*Dreamtigers* (*El Hacedor*) is a unique book, combining poetry and short (< 1 page) diamonds of fiction or non-fiction prose. Note: parts of *El Hacedor* are in *Collected Fictions,* but if you want the full experience, both poetry and prose, in order, I recommend the translation titled *Dreamtigers.* I’ve not read another book whose ending made me feel what *Dreamtigers* did. \n\nI can almost guarantee there is no possible set of 5 books that explores more than the set 3 I listed above does.",
            "the demon-haunted world, sagan.\n\nmeditations, aurelius.\n\nstranger in a strange land, heinlein.\n\non the road, kerouac.  \n\njitterbug perfume, robbins.",
            "God of wrath\nSputnik sweetheart \nIkigai\nBefore the coffee gets cold",
            "FICTION -\n\n“To Kill A Mockingbird” by Harper Lee.\n\nNON-FICTION -\n\nAnything by Rose George, Judy Melinek, Caitlin Doughty, or Mary Roach.\n\n“The Gift of Fear” (a very important read) by Gavin De Becker.\n\n“Five days at Memorial: life and death in a storm-ravaged hospital” by Sherri Fink.",
            "The Never Hero trilogy, The Joe Ledger Series, Superpowereds 1-4, Villian's Code",
            "Historical fiction- Ice candy man by Bapsi Sidhwa\n\nSelf help- The growth mindset workbook by Elaine Elliott-Moskwa\n\nNon fiction- Paddle by Jasper Winn\n\nMystery- Butter by asako yuzuki\n\n\nLiterary fiction- Fencing with the king by Diana Abu Jaber",
            "Fantasy - Wheel of Time ( Its a long series but it only gets better after the first one, and \n\nSci Fy - We are legion (We are Bob)\n\nHistory - Rubicon by Tom Holland \n\nAnthropology - Guns, Germs, and Steel by Jarad Diamond",
            "Neither Wolf Nor Dog by Kent Nerburn \n\nAnd it's Sequels \n\nThe Wolf at Twilight and the Girl who sang with the Buffalo \n\nAll true stories. All broke my heart again and again",
            "we have always lived in the castle (gothic)\n\niron widow (scifi)\n\nskeleton keys (nonfiction)\n\ncheck&mate (romance)\n\nthe angel maker - stefan brijs ( dutch translated dystopian, we read it a lot for our reading list for class here!)",
            "Last Chance to See by Douglas Adams - somehow both the most fun and most devastating non-fiction book I've ever read; it's about Douglas Adams travelling around the world to see (or try to) some of the most endangered animals at the time, and I've been recommending it to everyone I can catch. For extra heartbreak, look up each animal's status in 2025. (It wouldn't be fair to put more Douglas Adams in a post that's supposed to be about diversifying your reading journey, but I do also recommend everything else he's written. Dirk Gently's Holistic Detective Agency is my favorite of his fiction.)\n\nWe Are Pirates by Daniel Handler - another book I recommend a lot, it really captures how I felt as a teen. It's about a teen girl who is fed up with her middle class life and manages to convince some nominally normal people to abandon their lives to become pirates. I've described it as the best gay coming-of-age book that's not that at all. \n\nYonnondio by Tillie Olsen - an unfinished historical fiction piece about a family in the Great Depression. It's got some beautiful sentences and some compelling political commentary. \n\nThe Murder of Roger Ackroyd by Agatha Christia - it's a classic murder mystery for a reason!\n\nAny genre-centric short story collection with various authors - it's a great way to find new authors whose writing you want to chew on.",
            "I have been an avid reader for 40 years. Here are five of my all time favorites, three nonfiction and two fiction, that will give you different perspectives on life and the world around you.\n\n1776 by David McCullough is a history of America’s founding year focused on the leadership of George Washington. Reading will help you understand America and leadership.\n\nThe Orientalist by Tom Reiss is a fascinating biography of an eccentric writer that reads like a spy novel. It provides a great history of the world from the late 1800s through World War II with a very entertaining storyline. The chapters in Nazi Germany are particularly power and draw on Berlin in Lights: The Diary of Count Harry Kessler.\n\nComplexity: The New Science at the Edge of Order and Chaos by M Mitchell Waldrop is about the intellectual journey of W. Brian Arthur, Ph.D., who upended economic orthodoxy with his theories of increasing returns, positive and negative feedback loops and nonlinear dynamics. One of the main takeaways is that academics are rigid and siloed. True innovators think across traditional lines and build new original ideas on a cross section of existing ideas.\n\nWhite Oleander by Janet Fitch is a powerful novel about Astrid, who is thrown into the Los Angeles foster care system after her mother murders her boyfriend in a jealous rage. You should cry at least once and believe in Astrid as a heroine at the end. The movie was horrible, the novel is fantastic.\n\nThe Death of Artemio Cruz by Carlos Fuentes is one of the most famous novels from Mexico. It is a Mexican Citizen Kane that uses magical realism (time shifts and flashbacks). Rich guy is dying in the hospital, surrounded by greedy family members waiting for him to die. His flashbacks are very insightful into Mexican history and culture from the Mexican Revolution to the 1950s. Excellent characters and suspenseful tales.",
            "*Number the Stars* by Lois Lowry (historical fiction)\n\n*The Chronicles of Narnia* by C. S. Lewis (fantasy)\n\n*The Chrysalids* by John Wyndham (dystopian fiction)\n\n*Now They Call Me Infidel* by Nonie Darwish (autobiography)\n\n*From Anna* by Jean Little (children's literature, but well worth the read no matter how old you are)\n\nEnjoy whatever you pick up next! :)",
            "YA\n\nMystery: We Were Liars by E Lockhart\n\nLiterary fiction: Speak by Laurie Halse Anderson\n\nContemporary: Saving Francesca by Melina Marchetta\n\nFantasy: Alanna: the first knight by Tamora Pierce\n\n\nAdult\n\nLiterary fiction: Girl with a Pearl Earring by Tracy Chevalier\n\nContemporary: One Plus One by Jojo Moyes\n\nRomance: The Last Chance Saloon by Marian Keyes\n\nThriller: Gone Girl by Gillian Flynn\n\nFantasy: Hexwood by Diana Wynne Jones\n\nScifi: Kindred by Octavia Butler",
            "Snow Crash - Neal Stephenson (sci-fi)\n\nThe Baron in the Trees - Italo Calvino (Literature)\n\nThe Murder of Roger Ackroyd - Agatha Christie (mystery)\n\nBattle Royale - Koushon Takami (Action/Thriller)\n\n4000 weeks - Oliver Burkeman (non-fiction)",
            "On The Road",
            "Every 16 year old should read Catcher in the Rye... then in 20 years read it again and see how differently you connect with the characters.\n\nI read it in High School and thought Holden Caufield had the world figured out. Then I got older and I had a very different opinion. It's an interesting come-of-age tale that, like fine wine, gets better with age.",
            "Alfred Bester - The Stars My Destination\n\nThomas Ligotti - Songs Of A Dead Dreamer\n\nWilliam Blake - The Marriage Of Heaven And Hell\n\nGeorge Dyson - Darwin Amongst The Machines\n\nDavid Crystal - The Stories Of English",
            "I see a lot of people using \"classic\" as a way to cram two of the same genre in there...",
            "A Deadly Education by Naomi Novik \n\nSelf Compassion by Kristin Neff\n\nLight From Uncommon Stars by Ryka Aoki\n\nThe Mysterious Case of the Alperton Angels by Janice Hallett\n\nAll About Love by bell hooks",
            "- Her Side of The Story by Alba de Céspedes \n- The Dawn of Everything by David Graeber and David Wengrow\n- The Beadworkers by Beth Piatote\n- A Wrinkle In Time by Madeleine l'Engle\n- The Reformatory by Tananarive Due",
            "SF:\n\nDoomsday Book (Oxford Time Travel, #1) Willis, Connie\n\nLast Year , Robert Charles Wilson\n\nThe Return of the Incredible Exploding Man Hutchinson, Dave\n\nThe Ministry of Time Bradley, Kaliane\n\nMisc:\n\nLast One at the Party Clift, Bethany\n\nFagin the Thief Epstein, Allison\n\nFantasy:\n\nThe Blade Itself Abercrombie, Joe\n\nA Game of Thrones Martin, George R.R.\n\nBreachman Barker, Chris\n\nCrime/Mystery:\n\nI Will Find You: (Homicide Hunter) Kenda, Joe\n\nCrimson Lake, 3 books Fox, Candice\n\nWar:\n\nAll Quiet on the Western Front Remarque, Erich Maria\n\nGoshawk Squadron Robinson, Derek\n\nNon Fiction:\n\nBeing Mortal, Gawade, Atul\n\nHippocrasy, Harris, Ian",
            "Historical - Endurance: Shackleton’s Incredible Voyage by Alfred Lansing\nFantasy - The Hobbit and/or The Lord of the Rings by JRR Tolkien\nFiction - Atlantis Found by Clive Cussler\nNon-fiction - How to Lie with Statistics by Darrell Huff\nPsychology - Quiet: The Power of Introverts in a World that can’t stop Talking by Susan Cain",
            "I’d say\nIQ84 - Murakami\nTender is the flesh - agustina bazterrica \nCatch 22 - Joseph heller\nGrief is the thing with feathers - max porter\nHigh fidelity - nick hornby",
            "Middlemarch\n\nEnder's Game\n\nAll The Light We Cannot See\n\nGoing Postal\n\nThe RIghteous Mind",
            "Mystery: Nancy Drew\n\nSelf-Help: 12 Rules for Life by Jordan Peterson\n\nHorror(non-fantasy): The Girl Who Loved Tom Gordan by Stephen King\n\nAdventure: The Adventures of Amina al-Sirafi by Shannon Chakraborty\n\nHistorical Fiction: A Gentleman in Moscow by Amor Towles",
            "Hatchet by Gary Paulsen. Great coming of age story. \n\nNeuromancer by William Gibson. It invented cyberpunk. \n\nReady player One by Ernest Cline. Yes to be a kid in the 80’s was AWESOME!",
            "Here's two lists of some of my favourites - hope you find something in these comments that you enjoy! \n\nScience fiction - Stories Of Your Life And Others by Ted Chaing\n\nFantasy - The House In The Cerulean Sea by T.J Klune\nThriller - Misery by Stephen king \n\nHistorical fiction - How To Stop Time by Matt Haig (anything by Matt Haig) \n\nClassic Lit - The Lottery by Shirley Jackson \n\n\n\n\n\n\n\nMystery/alternate history fiction - 11.22.63 by Stephen King \n\nScience fiction  - Jurassic Park by Michael Crichton \n\nThriller - Talented Mr Ripley by Patricia Highsmith\n\nYA - Hunger Games by Suzanne Collins\n\nMagical realism - The Paper Menagerie by Ken Liu",
            "The Elephant Whisperer - conservation, memoir\n\nWatership Down - fairy tale, fantasy\n\nNever Let me Go - psychological fiction \n\nInto Thin Air - non-fiction thriller \n\nWorld War Z - apocalyptic",
            "Candide by Voltaire - its short and Voltaire talks absolute enlightment era shit the entire time. Every single line he wrote needs the \"/s\". \n\nGates of Ivrel by CJ Cherryh - scifantasy , political and body horror , and she's amazing at world building. \n\nEarth Strike by Ian Douglas - probably my fav military scifi and everything feels much more gritty and real\n\nFour Agreements by Don Miguel Ruiz - probably the best book on spiritual matters ive ever read, or at least the most impactful to my daily life. You'll wanna re read it a few times for it to really click. \n\nThe Ultimate Time Machine by Joseph McMoneagle - conspiracy nonsense or a legit nonfiction? I loved this book and it's a great read whether or not you believe a word of it. \n\n-----\n\nBonus:  I was gonna put ||Anais Nin|| on the list, even though I'm not a fan of all the incest, she's the hands down best erotica author I've ever come across. I discovered a copy in my very early teens ...  but obvs I can't recommend this till you're 18, sorry.",
            "Red Storm Rising - Tom Clancy (modern day military fiction)\nRed Rising - Pierce Brown (Scify)\nCinnamon Bun - Ravensdagger (Fantasy)\nChronicles of an urban druid - Auburn Tempest (Urban Fantasy/YA)\nSkyward - Brandon Sanderson",
            "- House On The Cerulean Sea by TJ Klune- Fantasy, Found Family, LGBTQIA+, Witty\n\n- Leviathan Wakes by James Corey- SciFi, Space, Molecular Aliens, Great Unknown, Space Politics\n\n- Oryx and Crake by Margaret Atwood- SciFi, Genetics, AI, Mystery\n\n- The Hunting Party by Lucy Foley- Murder Mystery, Who Done It, High Society Fools\n\n- A Southern Book Club’s Guide To Slaying Vampires by Grady Hendrix- Horror/Mystery, Gender Roles, Class Disparity, Chilling, Reality Based Fantasy",
            "I’ll give you 5 of my mixed favourites \n\nThe Stars My Destination by Alfred Bester\n\nBlood Meridian by Cormac McCarthy\n\nDracula by Bram Stoker\n\nIn The Heart Of The Sea by Nathaniel Philbrick\n\nInto Thin Air by John Krakauer",
            "Classic-Count of Monte Cristo by Alexandre Dumas\n\nCrime- The Godfather by Mario Puzo\n\nHumour- Summer Lightning PG Wodehouse \n\nMystery- The hound of the Baskervilles by Arthur Conan Doyle\n\nSupernatural- The historian by Elisabeta Kostova",
            "*Watchers,* by Dean Koontz",
            "Horror: *Dracula* by Bram Stoker\n\n\nFantasy: *The Hobbit* by J. R. R. Tolkien\n\n\nScience Fiction: *Mission of Gravity* by Hal Clement\n\n\nMystery: *The Arrest of Arsène Lupin* by Maurice Leblanc, or *The Adventure of Charles Augustus Milverton* by Sir Arthur Conan Doyle (or both, since they're short stories 🙂)\n\n\nPhilosophy: *The Abolition of Man* by C. S. Lewis\n\n\nWeird bonus thing that is really great but hard to categorize: *Flatland: a Romance of Many Dimensions* by Edwin A. Abbott\n\n\nAnother weird bonus thing, but this one's a comic book: *American Born Chinese* by Gene Luen Yang",
            "When I was younger I used to have a rule that I had to be reading 1 fiction, 1 history, and 1 science book at all times.\n\n{{Passionate Declarations: Essays on War and Justice by Howard Zinn}}\n\n{{Jitterbug Perfume by Tom Robbins}}\n\n{{The Parable of the Sower by Octavia Butler}}\n\n{{The Power of One by Bryce Courtney}}\n\n{{The Man Who Mistook His Wife for a Hat by Oliver Sacks}}",
            "Fight Club - Chuck Palahniuk\n\nThe Man Who Mistook His Wife for a Hat - Oliver Sacks\n\nParadise Lost - John Milton\n\nMagic, Inc - Robert Heinlein\n\nThe Murder of Rodger Ackroyd - Agatha Christie",
            "Crime and Punishment, Dostoyevsky - classic\n\nHell’s Angels, HST - Gonzo/historical nonfiction\n\nSphere, Crichton - sci-fi \n\nBroken Monsters, Beukes - horror\n\nA Confederacy of Dunces, Toole - black comedy",
            "Sci-Fi: Hitchhiker’s Guide to the Galaxy by Douglas Adams \n\nPsychological: Hunger by Knut Hamsun\n\nAdventure: She by H. Rider Haggard\n\nScience: Cosmos by Carl Sagan\n\nHorror: Misery by Stephen King",
            "Non-fiction:  The Story of the Human Body by Daniel Lieberman.  I read it years ago, and I still talk about it with others a TON.  It’s about how we have evolved to basically give ourselves diabetes and heart disease.  Super relevant and helpful information on human health.  His sequel Exercised is excellent too.",
            "1. The War of the Worlds - H.G. Wells \n2. The three musketeers - Dumas Père \n3. Flatland - Edwin Abbott Abbott\n4. Killing Floor - Lee Child\n5. The Silver Pigs - Lindsay Davis",
            "For science fiction, slaughterhouse, five, for fantasy, either Watership Down or the last unicorn, for historical fiction shogun For horror , invasion of the body snatchers",
            "A virtually unknown novel that I think is super (I’ve read it about 10 times) & would be great for a 16-year-old is “Cruddy” by Lynda Barry. She is best known as a writer of comics, & her comic collections, many of which read as graphic novels, are also excellent (if you like that sort of thing).",
            "Fantasy - The Way of Kings\n\nScience Fiction - Leviathan Wakes",
            "Between two fires by Christopher Buehlman - horror\nThe Search for the Green River Killer by Carlton Smith - true crime\nSuper Cannes by JG Ballard - psychological thriller\nThe Great War for Civilisation by Robert Fisk - non fiction\nBlood Meridian by Cormac McCarthy - western\nCatch 22 - bonus classic",
            "Count of Monte Cristo - Dumas (classic)\n\nDune - Herbert (sci fi)\n\nWheel of Time - Jordan (fantasy)\n\nThe Mysterious Affair at Styles - Christie (murder mystery)\n\nSPQR - Beard (history non fiction)",
            "My take would be: \n\nMemoirs of a Geisha by Arthur Golden (historical fiction)\n\nThe Orphan's Tale by Pam Jenoff (historical fiction)\n\nI'm Glad My Mom Died by Jennette McCurdy (memoir)\n\nThe Seven Husbands of Evelyn Hugo by Taylor Jenkins Reid (LGBT fiction)\n\n The Black Witch Chronicles by Laurie Forest (fantasy)\n\nI will say some of these books (I'm Glad My Mom Died in particular) might be triggering to some audiences because they contain emotional abuse, the character dealing with mental health conditions like OCD and eating disorders, and very raw depictions of anxiety. If you are sensitive to certain topics, I would say to read the synopsis of the books and trigger warnings. But all these I have enjoyed immensely and every book here has made me feel feelings.",
            "Nonfiction- The Gift of Fear, Gavin deBecker",
            "The Kaiju Preservation Society, John Scalzi\n\nThe Hundred Thousand Kingdoms, N. K. Jemisin\n\nLong Way Down, Jason Reynolds\n\nThe Travelling Cat Chronicles, Hiro Arikawa\n\nA Psalm for the Wild-Built, Becky Chambers",
            "Fantasy: A Wizard of Earthsea\n\nSci-fi: A Psalm for the Wild Built \n\nWestern: The Sisters Brothers \n\nPost-apocalypse: The Girl With All the Gifts\n\nNonfiction: Demon Haunted World",
            "The Kite Runner, a very interesting story told very well. Fiction.",
            "YA/Fiction: The Giver - Lois Lowry\n\nScifi: The Martia - Andy Weir (my fav book of all time)\n\nMythology/Classic - Odyssey - Emily Wilson (she's the first woman to ever translate it)\n\nNonfiction: The Immortal Life of Henrietta Lacks - Rebecca Skloot\n\nRomance/Classic: Pride and Prejudice - Jane Austen\n\n(Bonus) Short Story/Science Fiction: Flowers for AlgernonShort - Daniel Keyes (warning: I read this one in school and I cried)",
            "The Bees. A novel by Laline Paull. I read a lot, and I like many genres. This book tops my list.\nAlso, The Valkyrie Bestiary series by Kim McDougall is excellent. Agatha Christie totally rocks. As do Harlan Coben and Linwood Barclay. The Spy series by Diane Henders is wonderful. The Greatest Hits Mysteries series by Leslie Langtry is really fun.",
            "Imajica by Clive Barker\n\nBreakfast of Champions by Kurt Vonnegut \n\nMaximum Bob by Elmore Leonard \n\nThe Corrections by Jonathan Franzen\n\nThe Broom of the System by David Foster Wallace",
            "For a teen trying to read more, start w young adult books: Any Alan Gratz books, Green glass house, secret keepers, paper towns, white bird",
            "Fantasy - Kraken by China Mieville\n\nNon-fiction - The Last Place On Earth by Roland Huntford\n\nSciFi - Snow Crash by Neal Stephenson \n\nMystery - Glimpses of the Moon by Edmund Crispin\n\nFiction - The Shadow of the Wind by Carlos Ruiz Zafon \n\nGenerally great noir - James Ellroy’s LA Quartet",
            "Great question.\n\nI'm not sure links are allows, but here's my end-of-year book list (with links to earlier lists); I try to span a range of genres. [https://eighteenthelephant.com/2024/12/31/the-year-in-books-2024/](https://eighteenthelephant.com/2024/12/31/the-year-in-books-2024/)",
            "Non-fiction: The Drowned and the Saved by Primo Levi \n\nWestern: Blood Meridian by Cormac McCarthy \n\nRomance: The Shape of Water by Daniel Kraus and Guillermo Deltoro\n\nFantasy: The Gunslinger by Stephen King \n\nTragedy: Giovanni's Room by James Baldwin",
            "Fiction- Four Seasons by Stephen King\nSci-Fi -The Road by Cormac McCarthy\nComedy- Catch 22 by Joseph Heller\nClassic - Brave New World by Aldous Huxley\nGothic- Frankenstein by Mary Shelley",
            "Replay\n\nFever House\n\nPiranesi \n\nFlowers for Algernon\n\nProject Hail Mary",
            "Classic: A Tree Grows in Brooklyn by Betty Smith\n\nSci-fi: Earth Abides by George Stewart\n\nComing of Age: When the Legends Die by Hal Borland\n\nMystery: And Then There Were None by Agatha Christie\n\nYoung Adult: Peter and the Starcatchers by Dave Berry",
            "Fiction: The White Tiger\n\nBiographical: Into the Wild\n\nNon-fiction: Antifragile/Fooled by Randomness\n\nNegotiation: Never Split the difference\n\nBusiness: The Tipping Point",
            "Sci-fi - The scythe\n\nFantasy - Red Queen\n\nMystery - The Inheritance Games\n\nHorror - Mr Mercedes\n\nDrama/Romance - You’ve Reached Sam",
            "1. The Anthropocene Reviewed by John Green (Non-fiction essays)\n2. Unlikely Animals by Annie Hartnett (fiction)\n3. Red Rising (sci-fi)\n4. Homegoing by Yaa Gyasi (historical fiction? A bit hard to categorize it. I would call it more powerful than fun, but definitely worth it)\n5. Nothing to See Here by Kevin Wilson (fiction with magical realism)\n6. The Poet X (YA novel in verse)",
            "Challenger Deep by Neal Shusterman",
            "Everyone should read The Alchemist - Paulo Coelho",
            "Tales of the Wandering Mists by Oleg Veretskiy (fantasy)",
            "Modernist - Nightwood\n\nGothic horror - Carmilla \n\nSpeculative fiction / dystopia - The Handmaid’s Tale \n\nScience fiction - Do Androids Dream of Electric Sheep?\n\nPoetry - If Not, Winter: Fragments of Sappho",
            "\"Fall Down 7 Times Get Up 8,\" by Naoki Higashida\n\n\"The Catcher in the Rye,\" by J.D. Salinger\n\n\"Spirits Rebellious,\" by Kahlil Gibran\n\n\"Tenderness,\" by Robert Cormier\n\n\"A Wizard of Earthsea,\" by Ursula K. Le Guin",
            "Non fic - A Short History of Nearly Everything by Bill Bryson\n\nHistorical WWII era - Night by Eli Weizel\n\nFantasy - Dresden Files by Jim Butcher\n\nHigh stakes humor/dark comedy - John Dies at the End\n\nDungeon Crawler Carl",
            "Sci-Fi: Project Hail Mary\nFantasy: Tress of the Emerald Sea\nWestern: True Grit\nNon-fiction: The Indifferent Stars Above\nHistorical Fiction: The Book Thief",
            "Are you comfortable reading 1000+ pages books? I'll assume not since you're trying to get into reading so I'll say:\n\nMystery: And then there were none - Agatha christie\n\nHighly recommended because it's a brilliant book, and it is very easy to read, no hard words or sentence structure, and flows really well.\n\nHorror: the shining - Stephen king \n\nHave to include a stephen king book for dimilar reasons, easy to read while being well written, I would've suggested mr mercedes trilogy but it's crime - thriller which is similar to the previous book (and it's 3 books).\n\nNon fiction: Influence - Roberto Cialdini\n\nOne of the few non fiction books that I like, brilliant book that gives you insights on marketing and sales strategies used in day to day lives to influence people to buy a product, also teaches you a lot about social psychology, without being too hard to read, with a lot of real life examples and studies and smooth language.\n\nHistorical Novel : Michel Strogoff - Jules Vernes\n\nJules Verne is one of my favourite authors, so I'll add one of my favourite books by him that is in my opinion very underrated due to his other books being also really good but in the science fiction genre. I could've also added \"the mysterious island\" but don't want to overlap with mystery, or '20,000 leagues under the sea\",  but it can be a bit overly descriptive for someone who's trying to get back into reading and might feel boring at times. Michel strogoff is the perfect balance in my opinion for his books, because he really loves to go into a lot of details. It also has a lot of interesting themes, duty, honor, family, sacrifice, love etc... brilliant and underrated gem.\n\nPhilosophical: Zadig/Candide - Voltaire \n\nBoth simple very easy to read books that convey great and deep messages and ideas through very simple narratives and dialogues. \n\nNow if you're down for 1000+ pages I'll suggest the count of monte Cristo which I finished recently and is probably the best book I've ever read. Some parts are a bit too long, some people feel that there's too much detail in it but I simply disagree, but I do understand that some people might get bored because of some parts, I wasn't however.\n\nAlso to be noted that except the Count of monte Cristo, I've read all these books in my teens.",
            "Non-fiction: Educated\n\nSci fi: Project Hail Mary \n\nHorror: Frankenstein \n\nHistorical Fiction with a splash of contemporary: Fried Green Tomatoes \n\nChildren’s / Fantasy: Mrs. Frisby and the Rats of NIMH",
            "Johnny Got his Gun, Follow the River, The Jungle, Papillon, and The Long Walk",
            "Science fiction: The Hitchhikers Guide to the Galaxy - Douglas Adams\n\nHistorical fiction novel: The Book Thief - Markus Zusak\n\nGraphic Memoir: Halfway There - Christine Mari\n\nYA novel: The Fault in our Stars - John Green\n\nFantasy: The Hobbit - J. R. R. Tolkien",
            "The moon is a harsh mistress\n\n7 years in Tibet\n\nThe universe in a single atom\n\nHelen and Troy's Epic quest (modern day mythology.  Main character is a teenage minotaur working in a burger joint)\n\nGeorge Carlin - when will Jesus bring the pork chops",
            "Fantasy: Mistborn (Brandon Sanderson)\n\nSelf-help: The Subtle Art of Not Giving a F*CK (Mark Manson)\n\nNon-fiction/Health: In Defense of Food (Michael Pollan)\n\nClassic: Of Mice and Men (John Steinbeck)\n\nYoung Adult Fiction: Hatchet (Gary Paulsen)\n\nBonus (not sure the correct genre war fiction/thought provoking?): The Things They Carried (Tim O’Brien)",
            "In A Sunburned Country by Bill Bryson \n\nSharpe's Tiger by Bernard Cornwell \n\nThe Lincoln Lawyer by Michael Connelly \n\nPlaying For Pizza by John Grisham \n\nThe Martian by Andy Weir",
            "Lonesome Dove",
            "DUNE series. \n\nHow to Win Friends and Influence People.\n\nJurassic Park.\n\nTom Clancys Rainbow Six.\n\nDirty Job by Christopher Moore.\n\nStarship Troopers - Robert H. Heinlein\n\nTesla - Man Out of Time\n\n\nEventually Lord of The Rings.",
            "Fantasy: Mistborn - Brandon Sanderson\n\nSci Fi: Leviathan Wakes - James SA Corey \n\nFiction: Yellow face - RF Kuang\n\nHistorical Non-Fiction: In the Garden of Beasts - Erik Larson\n\nHorror/Thriller: Witchcraft for Wayward Girls - Grady Hendrix",
            "Surprised no ones really mentioned palahniuk, lullaby got me when I was about 16\n\n\nWish I'd read 1984 around then too, I think about it almost daily now(hated animal farm though) it might be a bit of a slog if you don't appreciate that sort of book\n\n\nThe Hobbit is chill and less dense than lotr\n\n\nThe mortal engine series was entertaining and cheeky, easy to read and cleverly written\n\n\nI always suggest stardust by Neil gaimen to new readers too, it's short and fun and quick",
            "Shadow of the wind",
            "The Peregrine by J. A. Baker (Nature)\n\n\nWild Rain by Beverly Jenkins (Romance)\n\n\nZami: A New Spelling of My Name by Audre Lorde (Autobiography, or Biomythography as Lorde calls it)\n\n\nHer Smoke Rose Up Forever by James Tiptree Jr. (Science Fiction)\n\n\nSunlight on a Broken Column by Attia Hosain (Contemporary Fiction)",
            "Dear Mind let´s talk\n\nPower\n\n48 Laws of Human Nature\n\nIkigai",
            "Louise Erdrich: the Round House (Fiction\n\nAdrian Tchaikovsky: the Children of Time (Science Fiction)\n\nAkala: Natives - Race and Class in the Ruins of Empire (non-fiction largely autobiographical)\n\nStieg Larsson: the Girl with the Dragon Tattoo etc (Millenium trilogy, crime)\n\nJames Clavell: Shogun (historical ficition).",
            "The Blue Sword/ The Hero and the Crown by Robin McKinley (2 book series, if you only choose one, I vote for the first one chronologically) \n\nThe Benefits of Being an Octopus by Ann Braden\n\nThe Finishing School quartet by Gail Carriger (first book is Etiquette & Espionage)\n\nLegends and Lattes (and the prequel) by Travis Baldree\n\n\n\nI can't think of a 5th genre off the bat that just jumped out to me. Hopefully, you'll find some good stuff. All of my recommendations are YA friendly, but I am a 40s smut loving reader and still thoroughly enjoy these reads.\n\n\nEdit:\n\nI thought of a non-fiction for you. Taking Charge of Your Fertility by Toni Weschler,  whatever the most recent volume is. Doesn't matter if you are AFAB or AMAB, it is still incredibly informative. I am a woman that has had periods and such since I was an early teen and I went through nursing school. Neither of those taught me as much as I learned from this book.",
            "0 to 60",
            "Stephen King The Gunslinger/Dark Tower book 1, and book 4 Wizard and Glass. <3\nThe Hunger Games. \nCirce AND The Song of Achilles, both by Madeline Miller, both REALLY beautiful books that moved me. \nThe Firebrand REALLY messed me up... I hate to even recommend it because parts of it were traumatizing...but I came away from that book a changed person, not necessarily for the better, but it definitely left a mark. \nLolita, horrible subject matter, but the most beautiful writing. \nJean M. Auel Earth's Children series... such good, GOOD books, some adult/sexual scenarios though. \nAnne Rice, The Witching Hour... any of her books for fun really. \nAlice Hoffman, Practical Magic, anything by her really. \nGillian Flynn, George R.R. Martin, Dean Koontz- especially his Odd Thomas books, Michael Crichton.\nMeditations by Marcus Aurelius. \nPride and Prejudice, anything Jane Austin is good. \nCarlos Castaneda's books literally reprogrammed my brain... not even kidding. I recommend ANYTHING AND EVERYTHING he has written just because his books somehow unlock something in the human brain... not even kidding. Had my first out of body experience while reading one of his books, and began having lucid dreams for the first time in my life while reading The Art of Dreaming. Absolutely crazy, and would not have thought a book could do such a thing, but it happened to me and several friends who I recommended Carlos Castaneda books to... they also had strange experiences while reading his books. \nI could literally go on for days. I love books. I love reading. I recommend reading them ALL, or as much as you can. 😊❤️",
            "James Lee Burke\nSouthern writer\nFiction \nIt’s a series",
            "These are adult ish, but I read them around your age and some are technically YA, though still adult.\n\nThe Gemma Doyle Trilogy by Libba Bray.  By far one of the most imaginative fantasies.    Set in Victorian England at a girls boarding school.   It's extremely detailed and tightly woven.   There isn't an unintentional detail, so be prepared to remember a ton of tiny details, but it's great.  Romance, magic, murder, historical fiction.\n\nThe shadow of the wind by Carlos ruiz zafon.   Set in Spain in the past and jumps though time.about a boy who finds that a certain authors works are being burned.  Romance, murder, tragedy,  intrigue,  beautiful writing,  it is so vivid.\n\nThe Historian by Elizabeth Kostova.   Don't even know where to begin.   Lengthy,  its split into parts.   The first is slow but crucial.  It's bounces between academia and fantasy.   I don't want to say much more other than you will want to be on a plane to see the wonders of Budapest,  Romania, and the Hagia Sophia in a heartbeat.!!!!!    Again, very vivid,  but it's a book to marathon.   If read it both ways and it's not nearly in good if you are just fitting in pages when you can.\n\nThe Great Gatsby .   Just hauntingly lyrical.\n\nThe Eight.  Revolves around chess, the French revolution  and the present.   One hell of a ride that I can't begin to explain.   Don't read the sequel!!!!!",
            "Sci Fi: Ruby Red Trilogy by Kerstin Gier \nMystery: The Forgotten Palace by Alexandra Walsh \nFantasy: The Night Circus by Erin Morgenstern \nMythology: Circe by Madeline Miller\nClassics: Pride and Prejudice by Jane Austen",
            "Classic novel - Northanger Abbey, by Jane Austen. I prefer Pride and Prejudice, but the heroine in Northanger Abbey is a teen girl, so maybe has more appeal.\n\nClassic mystery - And Then There Were None,by  Agatha Christie\n\nModern novel - Rebecca, by Daphne DuMaurier; I Never Promised You a Rose Garden, by Joanne Greenberg\n\nModern mystery - The Rules for Disappearing, by Ashley Elston\n\nHistorical novel: Catherine, Called Birdy, by Karen Cushman\n\nHistorical mystery - Hidden Fires: A Holmes Before Baker Street Adventure, by Jane Rubino\n\nNonfiction - The Diary of A Young Girl, by Anne Frank; Flowers in the Gutter, by KR Gaddy, The Aquariiums of Pyongyang, by Kang Choi-hwan",
            "To Kill a Mockingbird\n\nDune by Frank Herbert \n\nGuns, Germs and Steel by Jared Diamond\n\nNotes from the Underground by Dostoevsky \n\nThe Foreigner by Camus\n\n[](https://www.kitapyurdu.com/kitap/notes-from-the-underground/389934.html?srsltid=AfmBOoogThpeqC2BRQpVqBUKlnQd4F6sklfg-l8fw0FXIcawslRtZcKc)",
            "Cradle, it's a fast paced fantasy book. \n\n\nProject Hail Mary, Sci-fi with lots of science stuff but author explains everything like teaching a 6 year old so I don't think you would have any problems with it even if you are not into science.\n\n\nThe Kiterunner, tragedy taking place in Afganistan for when you want to cry your lungs out.\n\n\nThe Portrait of Dorian Gray, a philosophical book. Addresses the connection between good acts/sins and the soul. \n\n\nCujo, a horror book my teacher recommended back when I was 13. Still gives me creeps.",
            "Horror: It by Stephen King (also Swan Song by Robert B McCammon\n\nDystopian: The Parable Duet by Octavia S Butler\n\nFantasy: A Court of Thorns and Roses by Sarah J Maas (also Quicksilver by Callie Hart)\n\nNon-Fiction: The Hot Zone by Richard Preston (also Witchcraze by Anne L Barstow)\n\nThriller: Silence of the Lambs by Thomas Harris (also The DaVinci Code by Dan Brown)\n\nBonus round:\n\nSci-Fi: Red Rising by Pierce Brown\n\nHistorical: Pope Joan by Donna Woolfolk Cross (also Sacajawea by Anna Lee Waldo\n\nTEOTWAWKI thriller: The Long Riddle",
            "1.  The Bible, so you can recognize the hypocrisy in religion.  \n\n2.  Hyperion, for fucking awesome sci fi.\n\n3. 1984, to stop trusting governments.\n\n4.  The Stand, for top tier King horror.\n\n5.  Horton Hears a Who!, so you don't kill yourself after the previous 4 books.",
            "I loved historical fiction as a kid and I still do now. I have learned to appreciate the fact that it can teach me about historical Periods but also help me develop empathy and a deeper understanding of the perspectives of others. The more I read the more it helps the world make sense… many lightbulb moments. (Edited for typos)",
            "my taste in books is pretty curated but I love to read when I have the time between by overabundance of hobbies \n\nFiction- “illusions” by Richard Bach. Favorite book by my favorite author. Seriously great book about a barnstormer (small biplane  pilot who takes people for rides for a living) discovering what life is all about. If you want to learn about life and yourself, this is my top rec. \n\nNonfiction- Thales to Aristotle, Greek philosophy. Will teach you a lot and is very interesting if you are intrigued by fundamental truths of life. \n\nPoetry- leaves of grass by Walt Whitman OR on man and nature by Henry David thoreau. Both have very insightful perspectives. Leaves of grass is a classic.\n\nFantasy- Jonathan Livingston seagull by Richard Bach. Falls under fiction but again my favorite author. Book is pretty out there but it’s about the ascension of man’s conscience through telling of a story about a seagull who is outcast from his flock. Very entertaining book.\n\nAlso, the classics never hurt. Classic literature will never fail you. Just don’t start with Shakespeare.",
            "Memoirs of a Geisha",
            "Going Bovine by Libba Bray. A must read!! A whimsical adventure filled fantasy that’s also comedic and cynical, but has a deep heartfelt relatable message for anyone who reads this. The book is YA, but still an absolute fav (& I am in my 30s).",
            "as a fellow 16yo who used to be very into reading but recently slowed down, here are some books that helped get me back into it:\n\nfantasy: shadow and bone\n\nmystery/ thriller: the naturals \n\ndystopian: the hunger games \n\nadventure: percy jackson and the olympians \n\nmythology/fiction: song of achillies\n\nall of these are parts of a series so if you like something you can read more of the same thing. i thought these were all decently paced and i didn't get bored reading them, so theres that. have fun!",
            "Wild by Cheryl strayed  \nA Psalm for the Wild-Built by becky Chambers  \nMilk and honey by rupi kaur  \nThe nowhere girls by amy reed  \nA Man's Place by Annie Ernaux  \nKing Kong Theory by Virginie Despentes",
            "The Hitchhiker’s Guide to the Galaxy (must read)",
            "Stephen Hunter Bob Lee Swagger series,\n\nJames R. Benn Billy Boyle series,\n\nThe Vorkosigan Saga Lois McMaster Bujold,\n\nChris Evans Iron Elves,\n\nJim Butcher Codex Alera series,\n\nMatthew Reilly Scarecrow series\n\nDouglas Preston& Lincoln Child Pendergast series\n\nJames Byron Huggins Leviathan or Hunter\n\nDean Koontz Watchers\n\nRobert R. McCammon  Swan Song",
            "Lord of the Rings, Dune, The Great Mortality, Blood Meridian, and Metamorphosis",
            "Hitchhiker's Guide to the Galaxy - comedy sci-fi\n\nFarenheit 451 - dystopian. Not fun but very poignant\n\nLittle Women - classic, history, drama, romance, tragedy\n\nPercy Jackson - fun adventure with ancient greek gods\n\nThe Shining - horror. Very good horror\n\nThese are all very popular books, lots of people have read them and love them so when you meet book lovers chances are they've read some or all of these books. One of the fun things with books is to discuss them with friends",
            "just read bro",
            "Curvy girl series by Kelsie Hoss Stetling. I believe there are a total of 16 books but the series is divided in 2. I loved them and I am 62. She is my pallette cleanser."
        ]
    },
    {
        "id": "1k4blhq",
        "title": "Tell me your 3 favorite children's/YA books, and I'll recommend a book for older readers",
        "score": 55,
        "num_comments": 171,
        "link": "https://www.reddit.com/r/suggestmeabook/comments/1k4blhq/tell_me_your_3_favorite_childrensya_books_and_ill/",
        "content": "I like having multiple books mentioned, so I can have a better show at \"triangulating\" what the best rec would look like.\n\nJust in general, seeing how childhood tastes link up to adult ones is a fascinating topic.\n\nEdit: Look, I'm sorry you guys. Turns out my knowledge of children's literature isn't nearly as expansive as I thought. I'd appreciate a little help in making recommendations here. ",
        "comments": [
            "Ella Enchanted by Gail Carson Levine\n\nSeries of Unfortunate Events by Lemony Snicket (childhood favorites were the Ersatz Elevator and the Penultimate Peril) \n\nThe Map that Breathed by Melanie Gideon\n\nI’ll add a fourth in a similar vibe in case that last one is too unknown: A Wrinkle in Time by Madeleine L’Engle",
            "Ones I liked as a child:\n\n**The Roman Mysteries** series by Caroline Lawrence\n\n**Artemis Fowl** series by Eoin Colfer\n\n**Horrible Histories** series by Terry Deary",
            "The Boxcar Children Series - Gertrude Chandler Warner\n\nThe Babysitter’s Club - Ann M. Martin\n\nLittle House on the Prairie - Laura Ingalls Wilder",
            "The Secret Garden by Frances Hodgson Burnett. \n\nThe Witches by Roald Dahl\n\nHeidi by Johanna Spyri",
            "Oh this will be interesting, my three are:\n\n\\- Dustbin Baby by Jacqueline Wilson  \n\\- A Series of Unfortunate Events by Lemony Snicket (especially the later books)  \n\\- Charlie and the Chocolate Factory by Roald Dahl\n\nQuite the varied mix there lol",
            "These were my favorites as a kid:\n\nThe White Mountains by John Christoper\n\nHarry Potter Series by JK Rowling\n\nArtemis Fowl by Eoin Colfer",
            "The Secret Garden by Francis Hodgson Burnett \n\nThe Diamond in the Window by Jane Langton \n\nDown a Dark Hall by Lois Duncan",
            "Tom's Midnight Garden by A. Philippa Pearce\n\nMoominsummer Madness by Tove Jansson \n\nAlice's Adventures In Wonderland by Lewis Carroll",
            "*Song of the Lioness* by Tamora Pierce  \n*The Hero and the Crown* by Robin McKinley  \n*Riding Freedom* by Pam Muñoz Ryan",
            "**'King Arthur and His Knights of the Round Table'** \\- Roger Lancelyn Green. (R L G was a younger friend of Tolkien and CS Lewis and wrote a number of other books about folklore and mythology, this is my favourite though).\n\n**'Finn Family Moomintroll'** \\- Tove Jansson. (Or the 'moomins' series in general).\n\n**'Around the World in Eighty Days'** \\- Jules Verne. Inspired many great travelogues since.",
            "Divergent series\nLooking For Alaska\nHunger Games books",
            "This is actually not easy to answer, I was a huge bookworm. Probably if I had to choose a top 3...  \nWarriors (yes, the cats)  \nSeries of Unfortunate Events  \nLord of the Flies\n\nIf you feel like making a second rec with a different vibe, then I'd also say:  \nThe Hobbit  \nThe Moorchild  \nThe Queen's Thief series",
            "Ronja the Robber's Daughter by Astrid Lindgren\n\nThe Neverending Story by Michael Ende \n\nWise Child by Monica Furlong",
            "Harriet the Spy & Sport - Louise Fitzhugh\n\nThe House With A Clock In Its Walls & The Letter, The Witch, and The Ring - John Bellairs\n\nFrom The Mixed-Up Files of Mrs. Basil E. Frankweiler   - E. L. Konigsburg",
            "Stating my age range, lol\n\nGoosebumps (series)\n\nRedwall (series)\n\nWinterdance - Gary Paulsen",
            "Harry Potter by JK Rowling \n\nGoosebumps by RL Stine \n\nMortal Engines by Philip Reeve",
            "The CHERUB books!",
            "Ronja the robbers' daughter -Astrid Lindgren\n\nChronicles of Narnia - C.S. Lewis\n\nGood night Mister Tom -Michelle Magorian",
            "Black Beauty \n\nThe Chronicles of Narnia\n\nNancy Drew",
            "When I was young I loved Running out of Time by Margaret Peterson Haddox. \n\nI waited in line for new Harry Potter books when they came out at midnight. \n\nI re-read Stargirl by Jerry Spinelli probably 100 times.",
            "I remember really enjoying Skyward by Brandon Sanderson, The Warrior Cats saga by Erin Hunter and Goosebumps in general",
            "Matilda by Roald Dahl\n\nCharlie and the Chocolate Factory by Roald Dahl\n\nHoles by Louis Sachar",
            "Good luck. Wayside stories series",
            "Here ya go! I still read a fair bit of middle grade fiction as an adult, but these are all things I read for the first time as a kid:\n\n* Inkheart (and trilogy), by Cornelia Funke\n* A Series of Unfortunate Events, by Lemony Snicket\n* The Westing Game, by Ellen Raskin\n* HM for Harry Potter, which I was of course obsessed with, although that is much more complicated now\n\n\n(Edited for formatting)",
            "goosebumps \n\nhis dark materials series \n\nalice in wonderland \n\nhonorable mentions: tom Sawyer, cirque du freak/demonata, behemoth trilogy, enders game, poes poems, harry potter, eragon, Artemis fowl, dragon slayers academy, twilight, captain underpants",
            "My Side of the Mountain by Jean Craighead George\n\nHatchett by Gary Paulsen\n\nWhere the Red Fern Grows by Wilson Rawls",
            "Animorphs!\n\nI don't really have two others. Maybe Goosebumps. But I love the premise and execution of the Animorphs series.\n\nBeen wondering if there's another series focused on \"Small group of normal people in the real world with secret powers fighting an overwhelming supernatural or otherwise fantastical force.\"\n\nLike Power Rangers for grown-ups.",
            "The Harry Potter series \n\nDangerous Angels by Francesca Lia Block\n\nThe Vampire Lestat by Anne Rice\n\nI did also enjoyed the A Series of Unfortunate Events books but I was a bit older when I read them  (19) so I wouldn’t say they’re my favorite but if I had read them a few years earlier I’d probably feel differently.",
            "- Goosebumps \n- Original Dragonlance trilogy \n- Lord of the Rings",
            "This is great, thanks for doing this! I gave you more than 3...\n\n1. The Thief of Always by Clive Barker\n2. The Chronicles of Narnia by CS Lewis\n3. The Witches by Roald Dahl\n4. Adventures of Alice in Wonderland by Lewis Carroll\n5. The Wonderful Wizard of Oz by Frank Baum",
            "Hmmm I liked the **Bartimaeus' Trilogy** by Jonathan Stroud,\n\n**The Edge Chronicles** by Paul Stewart\n\nand **The Golden Compass** by Philip Pullman\n\nCan you find something with this ?",
            "Fablehaven\n\nThe giver\n\nDivergent\n\nPercy Jackson\n\nThe cruel prince\n\n(I’m sorry I cheated and put 5)",
            "Harry Potter and the Half Blood Prince by JK Rowling\n\nA Little Princess by Frances Hodgson Burnett\n\nDrowned Ammet by Diana Wynne Jones",
            "Royal diaries series (all) / hunger games / two princess of bamarre",
            "The Three investigators - Various Authors\n\nFamous Five/Mallory Towers / St Clares by Enid Blyton\n\nThe Undertakers Gone Bananas - Paul Zindel\n\n  \nThank you",
            "I was an avid reader as a kid, so it's surprisingly difficult to narrow down my top 3. I suppose I probably talked about the following books the most:\n\nThe BFG \n\nThe Westing Game \n\nAnne of Green Gables\n\nOr\n\nThe Witches\n\nThe Lion, the Witch, and the Wardrobe\n\nThe Phantom Tollbooth",
            "Raybearer by Jordan Ifueko \nThe Monstrumologist Saga by Rick Yancey\nThe Maximum Ride books by James Patterson",
            "Wait Til Helen Comes - Mary Downing Hahn\n\nLocked In Time - Lois Duncan",
            "His Dark Materials by Phillip Pullman\n\nThe Wild Robot trilogy by Peter Brown\n\nThe Midnight Dress by Karen Foxlee\n\nOr The Girl Who Drank the Moon by Kelly Barnhill if the last one is too obscure.",
            "My favorites as a kid:\n\n- A Series of Unfortunate Events by Lemony Snicket\n\n- Nancy Drew Series by Carolyn Keene \n\n- Anne of Green Gables by L.M. Montgomery\n\n\nAs an adult, I tend to prefer standalone books to series",
            "The Brothers Lionheart by Astrid Lindgren\n\nTanglewreck by Jeanette Winterson\n\nInkheart by Cornelia Funke",
            "Elementals Trilogy—Sherry Thomas (I re-read these every year)\n\nThe Witch of Blackbird Pond—Elizabeth George Speare (Newberry Award)\n\nA Wrinkle in Time—Madeleine L’Engle (Newberry Award)",
            "• A Wolf For A Spell by Karah Sutton \n\n• The Railway Children by E. Nesbit (This book got me into reading.)\n\n• Chander Pahar (The Mountain Of The Moon) by Bibhutibhusan Bandopadhyay\n\nRead this in school.\n \nHonorable mention - \n\nThe Little Princess by Frances Hodgson Burnett",
            "My go to authors for kids/YA are Judy Blume and Beverly Cleary. My sister and I are both in our 40’s now, and still talk about the Fudge books and “Are You There God? It’s Me, Margaret.” When my kids read “Ramona Quimby Age 8” they thought I was teasing when I told them I’d read it when I was their age.",
            "The Maze Runner by James Dashner\n\nThe Mysterious Benedict Society by Trenton Lee Stewart\n\nChasing Vermeer by Blue Balliet",
            "Julie of the Wolves series\n\nLittle House on the Prairie series\n\nHarry Potter series",
            "A Wrinkle in Time, The Giver, The BFG",
            "Mortal Engines by Philip Reeve \nScythe by Neal Shusterman\nThe Alchemist series by Michael Scott",
            "Tin Goyenda series by Rakib Hasan\n\nThe Wimpy Kid series by Jeff Kinney\n\nGoosebumps HorrorLand series by R.L. Stine",
            "The Green Rider by Kristen Britain\n\nA Great and Terrible Beauty by Libba Bray\n\nHarry Potter (books 3 and 5 were my favorites)\n\nHonorable mentions: The Thief Lord by Cornelia Funke, The Goblin Wood, and the Series of Unfortunate Events",
            "\"Spirit of the West series,\" by Kathleen Duey\n\n\"The World of Pooh,\" by A.A. Milne\n\n\"The Happiness of Kati,\" by Jane Vejjajiva",
            "The Book of Three by Lloyd Alexander\n\n\nA Boy and His Dog at the End of the World by C.A. Fletcher\n\n\nThe Wild Robot by Peter Brown",
            "Redwall \n\nGoosebumps \n\nFamous five ",
            "Island of the Blue Dolphins\n\nHis Dark Materials\n\nBeka Cooper Terrier (Tamora Pierce)",
            "Jerome\n\nAmphigorey\n\nThere’s A Monster At The End of This Book",
            "Goosebumps by R. L. Stine\n\nHorrible Histories by Terry Deary\n\nThe Secret Garden by Frances Hodgson Burnett\n\nAnything by Roald Dahl (The BFG was THE favourite)",
            "The Miraculous  Journey of Edward Tulane. I still cry. My son is 22 and he still loves it. I'd say 6-12 age range.",
            "* The Dark is Rising Sequence\n* Dragonriders of Pern\n* Earthsea Cycle",
            "The Edge Chronicles, specifically the Twig trilogy but I love them all",
            "Mine are: Hunger Games, Percy Jackson, The Raven Cycle (and the follow-up series: The Dreamer Trilogy).\n\nWhen I first read them I was completely and utterly obsessed with each one of them, to the point where I thought about them daily, made “art” about them and imagined myself among those characters",
            "The Borribles\n\nThe Chronicles of Prydain\n\nThe ‘Adventure’ series by Willard Price",
            ">Turns out my knowledge of children's literature isn't nearly as expansive as I thought.\n\nYou thought you were going to be the suggester but instead got a reading list. Mission accomplished.\n\nMy three favorite children's books:\n\n**The House in the Night** by Susan Marie Swanson and pictures by Beth Krommes\n\n**Hippos Go Berserk** by Sandra Boynton\n\n**The Gray Lady and the Strawberry Snatcher** by Molly Bang\n\nMy three favorite YA books:\n\n**A Wizard of Earthsea** by Ursula K Le Guin\n\n**Harrow the Ninth (The Locked Tomb # 2)** by Tamsyn Muir\n\n**The Power of One** by Bryce Courtenay",
            "The Westing Game\n\n\nLittle House in the Big Woods \n\n\nMandy - Julie Andrews Edwards",
            "1) The Perks of Being a Wallflower by Stephen Chbosky\n\n2. The Hunger Games by Suzanne Collins (especially the new one)\n\n3. This is Why They Hate Us by Aaron Aceves",
            "The Worst Band In The Universe by Graeme Base\n\nCity Of Bones by Cassandra Clare\n\nEliza And Her Monsters by Francesca Zappia",
            "Series of Unfortunate Events, Lemony Snicket \n\nArtemis Fowl, Eoin Colfer \n\nDon't Care High, Gordon Korman",
            "Harry Potter, Percy Jackson, the inheritance cycle. Gl lol.",
            "~ The Blossom Culp series - Richard Peck\n\n\n~ The Inkheart series - Cornelia Funke\n\n\n~ A Series of Unfortunate Events - Lemony Snicket",
            "Inkheart by Cornelia Funke\n\nArtemis Fowl series by Eoin Colfer\n\nChildren of the Lamp series by P. B. Kerr",
            "I know Percy Jackson, Hunger Games and Series of Unfortunate Events have been brought up a couple of times already, but I'm curious what you would recommend that's like an expanded of all three (not necessarily all at once) Something with neat mythology references, death games and gothic wittiness from the author would be interesting though open to anything else!",
            "My favorite childhood books were the warrior cats",
            "Island of the blue dolphins by Scott Odell",
            "Christina's Ghost - Betty Ren Wright - middle grade \n\nDollhouse Murders - Betty Ren Wright - middle grade/early high school \n\nThe Cat Ate My Gymsuit - Paula Danziger - early high school/junior high",
            "YA Books:\n\n1) All That's Left in the World by Erik J. Brown\n2) The Only Light Left Burning also by Erik J. Brown\n3) Lord of the Flies by William Golding\n\nSomething like All That's Left in the World for adult readers would be great!",
            "Where the Red Fern Grows\n\nJuniper\n\nMy Side of the Mountain",
            "Caraval - Stephanie Garber\n\nThe Rithmatist - Brandon Sanderson\n\nHooky - Miriam Bonastre Tur",
            "My own list, though I'll warn you this one is a bit of a doozy. \n\n**Percy Jackson and the Olympians:** by Rick Riordan\n\n**All the Wrong Questions** by Lemony Snicket. (Author of a Series of Unfortunate Events)\n\n**I am not a Serial Killer** by Dan Wells\n\nI suppose I'm fond of entertaining first person narrators."
        ]
    },
    {
        "id": "1kbmsh9",
        "title": "Historical Fiction Recommendations!",
        "score": 65,
        "num_comments": 142,
        "link": "https://www.reddit.com/r/suggestmeabook/comments/1kbmsh9/historical_fiction_recommendations/",
        "content": "I just finished reading the nightingale and absolutely adored it, I cried a few times and was genuinely dreading the end.\n\nI love stories set in the middle ages, french countrysides, royal life etc… I love a book with some kind of mysterious or dramatic element.\n\nAny recommendation of books you just could not put down would be appreciated though :)\n(does not have to directly include my interests!)",
        "comments": [
            "Philippa Gregory - The war of the roses and the Tudor series. \nI liked that it is written from the viewpoint of the women and not much gory details on the battles.",
            "Pachinko is the first that comes to my mind. Read it last year and it was probably my favourite novel of the year (narrowly beating, as it happens, The Nightingale)",
            "A Gentleman In Moscow or All the Light We Cannot See. You can’t see it, but my hand is over my heart cuz I swear to you these are two bangers!",
            "Ken Follett, The Pillars of the Earth series.",
            "James Clavell’s Asian Saga starting with Shogun.\n\nGary Jennings’ books like Aztec, Raptor, Journeyer.\n\nNeal Stephenson’s The Baroque Cycle",
            "The Red Tent by Anita Diamant",
            "The Alice Network by Kate Quinn\n\nContinue your Kristin Hannah Journey! Check out The Women",
            "Bernard Cornwell - i like his stories from the Hundred Years’ War (Azincourt is amazing and in France), and I’ve been having a love affair with Sharpe for many years, and he ends up in the French Countryside.\nThe Grail series is a hunt for the Holy Grail through France too!\n\nAlso if you’re into that, The Saxon Stories and Warlord Chronicles are both tv series now - The Last Kingdom and The Winter King, though that’s technically the Dark Ages i think.",
            "You've got to read the Invisible Life of Addie LaRue and the Seven Husbands of Evelyn Hugo.",
            "This is probably terribly obvious, but the Wolf Hall trilogy by Hilary Mantel is fantastic.",
            "The covenant of water",
            "The Frozen River by Ariel Lawhon was great!",
            "You might like Edward Rutherford's books!",
            "The four winds by Kristin Hannah. It’s set in the dust bowl era. I liked it slightly more than the Nightingale, but many would disagree with me on that probably.",
            "Ken Follett's historical fiction is all fabulous. Pillars of the Earth is the big classic, but the rest of the Kingsbridge series, as well as his standalone works, are all fantastic",
            "All of Kristin Hannah’s books have been 5 stars for me. Her other HF books that I’ve read are The Great Alone (post Vietnam War set in AK), The Women (Vietnam War through present), The Winter Garden (goes back and forth between the fall of Leningrad in WWII and present day), and The Four Winds (takes place during the Dust Bowl/Great Depression).",
            "Hamnet and The Marriage Portrait by Maggie O’Farrell",
            "The Doomsday Book by Connie Willis. Time travel story featuring the middle ages. One of my favorite books.",
            "Beneath a Scarlet sky. Revolves around a family in Italy during World War II. Almost as good as the Nightingale.\n\nEdited because I messed up the title.",
            "Stephenson's Baroque Cycle",
            "Kirsten Hannah and Kate Quinn both have exceptional historical fiction. My all time favourite is Code Name Helene, it’s based on a true story and will break your heart into tiny pieces.",
            "Bring up the Bodies and Wolf Hall",
            "My two recent favourites have been A Thousand Splendid Suns and A Fine Balance!!! Check them out, i was heartbroken by the end",
            "Almost all of Guy Gavriel Kay’s work, starting with either Lions of Al Rassan(Spanish Reconquista) or Sarantine Mosiac(Byzantium during Justinians reign)",
            "another lesser known historical fiction author i love is Colin Falconer. he writes some gritty af books that are fun to read. Harem is my personal fave by him.",
            "The Apollo Murders by Chris Hadfield - a Cold War thriller/fictional story that I think was a lot of fun to read. A good amount of twists and turns throughout!",
            "The Sicilian by Mario Puzo",
            "Did you read Four Winds by Kristin Hannah? The Winter Garden?\nNora Roberts new series It's called the List Bride Trilogy..book 1 The Inheritance, book 2 The Mirror, book coming out in November! Great first 2 books",
            "Matrix by Lauren Groff would check many of your boxes. It is set in the Middle Ages and is about a girl from France forced to live in an abbey in England. Groff is just a great writer in general.",
            "Outlander, Diana Gabaldon, maybe?",
            "The Outlander series (9 main books, one being written, plus side character books) bounces around historically from just after WWII to 1743 Scotland to 1960s Boston and then 1760s and going through the Revolutionary War. It's the story of Jamie and Claire and how they affect history and how it affects them.\n\nAlso, Anya Seton wrote many historical novels. Katherine is my favorite. Philippa Gregory says that these books were the inspiration for her own writing career in historical fiction.",
            "Nicola Griffith, Hild.  All the Christian Cameron books",
            "I loved The Rose Code and The Frozen River",
            "my favorite genre! some of my favorite historical fiction authors are Kate Quinn, Susan Meissner, Kelly Rimmer, & Kristin Harmel. \n\na few other reccs: \n-Go As A River by Shelley Read \n-Crow Mary by Kathleen Grissom\n-The Frozen River by Ariel Lawhon \n-Lady Tan’s Circle of Women by Lisa See\n\nhappy reading!",
            "In the time of the butterflies by Julia Alvarez. So so good.",
            "The Lymond Chronicles. Dorothy Dunnett. Best historical fiction I’ve ever read. Takes place in 16th century, Scotland,,England, France, Ottoman Empire and surrounding area, Russia. Give the first book a chance, it’s her first, and she purposely leaves you confused but it all comes together - is Lymond good or bad? Read about her, she’s a writer many writers greatly admire. The history is all true, real characters appear, the politics are fascinating.\n\nShe has another series, The House of Niccolo, 15 century, starts in Bruges, goes to France, Italy, Spain, Constantinople, Timbuktu, the Black Sea, Poland, ends up in Scotland. During the height of Burgundy, the sack of Constantinople, the expansion of the Otyoman Empire, and the khans.",
            "Trust by Hernan Diaz and Remains of the Day by Kazuo Ishiguro",
            "Isabel Ibanez, What the River Knows and Where the Library Hides are excellent and a tiny bit romantic. Though, it is not medieval, it's like early 1900s. Nice mystery/adventure set in Egypt. I highly recommend! (Bonus: In case you like fantasy, she also wrote Together We Burn which is a really good dragon story and not too romantic.)",
            "Weyward by Emilia Hart! 3 interwoven stories in different time periods with a great mystery element.",
            "not in your interests as such but  the Sir Robert Carey Mysteries by P F Chisholm are a good read set on the english scottish border during the time of the border reivers",
            "Loved Pachinko, All The Light We Cannot See and though A Gentleman In Moscow was amazing. If you like medieval stories try Cathedral Of The Sea by Ildefonso Falcones. That was brilliant to.",
            "The walking drum by Louis L'Amour. \n\nIt follows a young man through Moorish Spain, into France then the low countries and eastern Europe, through Byzantium and into the middle east in the early 1100's",
            "Through a Glass Darkly by Karleen Koen",
            "La place du l’etoile (The place of the stars) by Patrick Modiano.",
            "Ice Candy Man by Bapsi Sidhwa",
            "Beneath a scarlet sky is AMAZING same genre as nightingale",
            "The Engineer’s Wife\n\nThe Book Woman of Troublesome Creek\n\nThe Women of Copper Country",
            "I don't necessarily recommend it as a fantastic piece of literature but it's a great historical fiction of Europe throughout the 20th century: Time Shelter – Georgi Gospodinov",
            "A Known World",
            "The Name of the Rose\n\n\nThe Stone Witch of Florence\n\n\nHild",
            "I loved Orlando by Virginia Woolfe!\n\n\nI can't say too much about it, but it was quite funny, and dealing with themes of womens supression and liberation. ",
            "Lust for Life by Irving Stone",
            "Dumas two biographies, aka the sun King of France and Caesar",
            "Allison Pataki has some really enjoyable historical fiction,  including Sisi and the Queen's Fortune",
            "A Thread of Grace by Maria Doria Russell (Italian resistance during WWII)\n\nThe Shield of Three Lions and Banners of Gold by Pamela Kaufman (crusades of Richard II)\n\nThe Book Thief by Markus Zusak (WWII Germany)",
            "Lisa see, the island of sea women. Incredible.",
            "Anything by Geraldine Brooks. Year of Wonders is Middle Ages",
            "Book 1 of The Hussite Trilogy, “Light Perpetual” by Andrzej Sapkowski (guy who wrote “The Witcher”)…it’s set in 15th century Czech Republic and fun one.",
            "The Good Wife of Bath by Karen Brooks is brilliant",
            "Kate Grenville (The Secret River) is popular in Australia. I’d personally recommend Sarah Waters (Fingersmith is a banger!) and Kate Atkinson’s Life After Life and its sequel. Emma Donoghue also writes quite a bit of historical fiction, she’s fantastic.",
            "Reputation by Lex Croucher \n\nOrphan Monster Spy by Matt Killen \n\nLe Assaggiatrici by Rosella Postorino \n\nCity of Girls by Elizabeth Gilbert",
            "All the light we cannot see",
            "Read the rest of Kristin Hannah. They’re all good",
            "I have enjoyed many of Tracy Chevalier's historical fiction books. \nTopics are varied, but I definite recommend:\nGirl with the Pearl Earring\nVirgin Blue\nRemarkable Creatures\nAt the Edge of the Orchard",
            "I loved both of Jeff Talarigo's historical fiction books that take place in China;  The Pearl Diver and The Ginseng Hunter.",
            "The Things We Cannot Say - profound book, one of my all-time favorites.\n\nAnything by Kate Quinn\n\nCode Name Helene or The Frozen River by Ariel Lawhon\n\nEcho many of the suggestions already made! Got some new ones for myself!",
            "The Book of Lost Names by Kristin Harmel",
            "The Escapades of Tribulation Johnson by Karen Brooks! Brilliant.",
            "omg i felt the same way after reading the nightingale—such a beautiful, emotional read. if ure into stories set in the middle ages w/ mystery + drama, i think u might really like The Key to Kells by Kevin Barry O’Connor. it jumps between modern day and medieval ireland (super cool setting), and there’s this whole secret society / ancient code vibe going on. it’s got a thriller pace but w/ deeper themes like ancestry + legacy. def one of those books i couldn’t put down.\n\nalso, the third book in the series called “shake the jar” just came out and it’s soooo good!",
            "How Much of These Hills is Gold Zhang\n\n  \nIt is about Chinese immigrants who come over during the gold rush. I loved this book.",
            "Sarah Dunant‘s books (set in Italy) or Tracey Chevalier‘s are all excellent.",
            "Sharon Penman books are amazing, super long but you still don't want them to end. Start with The Sunne in Splendour about Richard 3rd. I've read this so many times and it still makes me cry! Also try Elizabeth Chadwick books.",
            "Kate Morton is the queen of big, sweeping historical novels. The Secret Keeper was one of my favorites!\n\nDuring a summer party at the family home, sixteen-year old Laurel Nicolson witnesses a violent crime that threatens everything she knows about her family and especially her mother, Dorothy.\n\nFifty years later, the family is gathered to celebrate Dorothy's 90th birthday. Laurel realizes this may be her last chance and searches for answers about what happened that day - answers that can only be found in her mother's past.\n\nRomance, friendship, deception, disappointment and secrets (oh, the secrets!) from World War II to the 1960s to the present.",
            "Journeyer by Gary Jennings \n\nAztec by Gary Jennings \n\nCreation by Gore Vidal \n\nBurr by Gore Vidal \n\nCuba Libre by Elmore Leonard",
            "1. City of Thieves by David Benioff\n\n\n2. The Frozen River by Ariel Lawhon\n\n\n3. Kane and Abel by Jeffrey Archer\n\n\n4. Five Decembers by James Kestrel\n\n\n5. The Shadow of the Wind by Carlos Ruiz \n\n\n6. Marina by Carlos Ruiz Zafón\n\n\n7. An Officer and Spy by Robert Harris\n\n\n8. The River We Remember by William Kent Krueger\n\n&nbsp;\n\n \n\nNot in any particular order.",
            "*The Chaperone* by Laura Moriarty",
            "A Girl Called Samson, so good.",
            "I recommend The Doomsday Book by Connie Willis is set in two times, the near future where historians time travel to study, and the Middle Ages in a village in England. It turned out to be a very emotional book by the end.",
            "The Matthew Shardlake series by C.J. Sansom",
            "I love everything by Stephanie Thornton (she’s written novels about the women in Genghis Khan’s life, Hatshepsut, the Ottoman Empire etc.).\n\nLucinda Riley is another one…her novels flip between past and present but the research she did with the past was astounding. My favourite series by her is the Seven Sisters novels. This man adopts six sisters from around the world and raises them. When he dies he gives them clues for each daughter to find their families.",
            "Conn Iggulden - Emperor\n\nBernard Cornwell - Saxon stories\n\nHelena P Schrader - Leonidas of Sparta",
            "Wolf Hall trilogy",
            "*The Illuminator* by Brenda Rickman Vantrease\n\n*Hadrian's Wall* by William Dietrich\n\n*The Glass of Time* by Michael Cox",
            "If you’re looking for historical techno thriller, go for ‘The Cipher of the Zamorins’, written by me and published in Kindle ",
            "Try The Poison Bed by Elizabeth Fremantle. It is phenomenal.  Historical thriller set in King James I court, based on true events!",
            "War and Peace...",
            "The invisible life of Addie Laurel - a different kind of sad but really good story"
        ]
    },
    {
        "id": "1k18c3b",
        "title": "Recommend the book you're currently reading.",
        "score": 28,
        "num_comments": 145,
        "link": "https://www.reddit.com/r/suggestmeabook/comments/1k18c3b/recommend_the_book_youre_currently_reading/",
        "content": "Let me start! I’ve just finished reading **Steppenwolf** by Hermann Hesse—it’s a really good, thought-provoking book.\n\nThe depiction of the Magic Theater in it will definitely shock you! Go to read.",
        "comments": [
            "Beloved by Toni Morrison\n\nWhat lengths would you go to make sure your children haven't suffered like you?\n\nNot for the faint hearted.",
            "not sure I would recommend what I'm currently reading tbh ... The Hobbit ( currently at the part when >!the eagle save gandalf and the crew from the wolves !<, never been good at imagining landscape\n\non the other hand , just read anne of green gables and it was amazing",
            "The Handmaid's Tale by Margaret Atwood. Terrifyingly topical.",
            "East of eden and the great believers",
            "Kurt Vonnegut “Breakfast of champions”, it’s not my genre at all, so I’m being a little confused 😅",
            "I just finished John Grisham's The Boys From Biloxi. Kind of a niche genre; it's a fictional story about the Dixie Mafia.",
            "Lonesome Dove.\n\nIm about 180 pages in.\nBasically, there is this group of horny guys who fall in love with a prostitute, but this other guy wants to bring a bunch of cows to the other end of the continent.\n\nI'm thoroughly enjoying it, highly recommend!",
            "Re-reading Slaughterhouse Five.  I read it when I was young and now realize that I did not understand it at all.",
            "Red Rising.\n\nI’m usually more literary in my preference, but this is an entertaining and enjoyable (if not morbid and sorta true) read. It’s like a more sophisticated version of Hunger Games.",
            "A Little Life. \n\nA harrowing portrail of abuse and the scars it leaves on those who survive it. \n\nBrilliantly written with excellent prose.",
            "\"100 Years of Solitude\" by Gabriel Garcia Marquez. I'm a bit late, it's a true classic for a reason. One of the most fascinating novels I've read. Such a great combination of tragedy and comedy!",
            "I finished Death of the Author by Nnedi Okorafor yesterday, and haven't stopped thinking about it since. Excellent book, part literary fiction and part scifi",
            "Murder in the Orient Express by Agatha Cristie.\n\nI’d describe it as a cozy mystery. Fun and light read - just what I need in the current stressful period of my life (academically wise) xD",
            "Babel by RF Kuang",
            "I‘m halfway through The Expanse Book 3 (Abaddon‘s Gate) - though it’s not as good as the first two books still a good read",
            "American Dirt by Jeanie Cummins",
            "Richard Titmuss's *Problems of Social Policy*, part of the official British history of WW2.  Together with the two volumes on food policy I also have, these make an enormously important point that right-wing regimes don't want you to think about: catastrophe can be planned for.  Planning the infrastructure of food, housing and medical care in the UK for resilience under enemy attack started in 1938 and was done in minute detail, covering every location and every role in society.  And they kept adapting it as circumstances changed.  The influence of this work went well beyond the war - \"hey, if we can organize national healthcare under German bombardment, maybe we can do it in peacetime?\"",
            "Why We Sleep. Dry read but VERY informative about an often overlooked yet essential part of our lives.",
            "The Westing Game by Ellen Raskin",
            "Isabel Allende: Daughter of Fortune.  Not bad but the House of Spirits is better.",
            "Rereading Stephen King’s Full Dark, No Stars. The novella’s  1922 and A Good Marriage are two of my favorite short pieces from him.",
            "Just finished Rebecca by Daphne du Maurier. Now I know why it’s a classic. So good!!!",
            "Master and Marguerita by Bulghakov",
            "Mythos by Stephen Fry\n\nAfter reading Circe I wasn't quite over my Greek Mythology kick so I decided to start this book which has been sitting on my shelf for years. I love how the stories of the gods are all woven together like tapestry. \n\nIt's partitioned into digestible stories and written in a really amusing way with Stephen Fry's dry sense of humor. I'm not a big audiobook person but I've been reading along with it and it's made it feel like storytime.",
            "Fear and Loathing in Las Vegas, by Hunter Thompson ",
            "The Jungle by Upton Sinclair.",
            "Just finished Pnin and currently reading Transparent Things both by Nabokov. Pnin had a certain charm I hadn’t previously found much in Nabokov’s novels.",
            "*Blindness* by José Saramago. A post-apocalyptic story that is so dang good.",
            "Endurance, it’s the true story of Earnest Shackleton’s failed 1914 expedition to Antarctica. The ship gets trapped in ice and he and his crew end up spending 9 months on an iceberg in Antarctica. No one is coming to rescue them so they have to devise their own way to escape. This is my second time reading the book because I find it so interesting.",
            "The Secret Life of Bats by Merlin Tuttle. It's delightful!",
            "Hitchhiker's Guide to the Galaxy by Douglas Adams, thoroughly reccomend it\n\n\nI just finished The Girl Who Drank the Moon, and would probably reccomend it to the right request, specifically someone who likes rambly, cozish fairy tale-like stories.",
            "Currently reading *From Eve to Dawn: A History of Women in the World Volume 2: The Masculine Mystique from Feudalism to the French Revolution* by Marilyn French. There are 4 volumes total spanning from prehistory to modern day, and so far they are fantastic reads and absolutely fascinating.",
            "Currently reading Dracula and I don’t know if I would recommend it like not much vampire stuff is happening. It started good but now I’m a little bit bored but maybe that’s because I already know the story.",
            "Just finished Carnivore by K Anis Ahmed, and I was so impressed! I love a good migrant narrative, and I rate books about cannibalism, and I'm a sucker for great prose by journalist novelists. Comes out in July and for many reasons might appeal to those of us who loved Yellowface by Rebecca Kuang.",
            "Golden Goal by Annah Conwell? Nah, not rec'ing that unless you're a hardcore sports Romance person. \n\nThe Great Dating Fake Off by Livy Hart is decent. Setting is basically the wedding of a Sicilian-American Romeo & Juliet. Romeo's sister is a lesbian so she brought her best guy friend as her date as a cover. Juliet's brother brought a friend as a date to get the family off his back about being single. The two dates are attracted to each other. Wedding shenanigans ensue.",
            "All Night Pharmacy. Just started so can’t fully\nvouch for it but so far I’m hooked",
            "Am working my way through the 8 book John Le Carre series of Smiley’s People. Currently on book 4, The Looking Glass War. Great writing, slow plot movement (am on holiday so enjoying the slower pace), and genre defining. Well worth it",
            "2666 by Roberto Bolaño. Only a third of the way through but it’s absolutely captivating",
            "The Stand ! I’ve also gotten pretty sick mid way through the book which Is arguably a bonus!",
            "Just started The Unhoneymooners by Christina Lauren. Needed a palate cleanser after lots of sad books. \n\nCurrently listening to I Who Have Never Known Men. I listen to audiobooks when I run, and I’m getting extra miles in because of this book.",
            "Careless People. The folks running Facebook are just as bad as you thought they were.",
            "I’m currently reading Children of Virtue and Vengeance as well as the graphic novelization of Kindred by Octavia E Butler. My book club is also almost done reading Parable of the Sower by OEB.",
            "Bonk: The Curious Coupling of Science and Sex by Mary Roach. It's hilarious but also so informative!",
            "The Bog Wife by Kay Chronister",
            "\nSteppenwolf is my favorite book! I love the atmosphere and Hesse’s poetic writing\n\nRight now, I’m reading One Hundred Years of Solitude. Magical realism is one of my favorite genres, so I’m really enjoying it",
            "East of Eden (Steinbeck) has been shockingly amazing. Has become my new favorite American novel and it is as close to the Great American Novel that I have read. Just 60 pages remaining and I don’t want it to end.",
            "leviathan wakes - first book in the expanse series",
            "Project Hail Mary",
            "Just finished \"The Name of The Rose\" by *Umberto Eco* and loved it",
            "I am reading Spare and it is both better written and more interesting than I expected. And quite frank, at least it seems it. I am more and more convinced that the monarchy is a system of child abuse.",
            "The blue between sky and water by Susan Abulhawa. A page turner that would break your heart",
            "A gentleman in Moscow by Amor Towles.",
            "Great expectations by Charles Dickens",
            "I randomly picked up *The Last Samurai* by Helen DeWitt and I have absolutely no idea how I hadn't heard of it before, but I'm completely infatuated. It's like a love letter to literature and art and knowledge as a concept. It's definitely not for everyone (I think a good gauge is whether you liked *The Secret History* or not lol) because it definitely toes the line between brilliant and pretentious/precocious but I guess tongue-in-cheek lowkey-ironic pretentiousness is my sense of humor? \n\nI'm not a fan of stream-of-consciousness but somehow DeWitt's variation on it is giving me one of the best understandings I've ever felt like I've developed of a character's brain *without being directly told by the author how the character works.*",
            "*Mean spirit* by Linda Hogan",
            "The memory wood by Sam Lloyd",
            "Just finished: Not just a moment by Ivy Wilson, reads like a hallmark movie. Definitely recommend",
            "Murder on Marble Row - Victoria Thompson.",
            "You Dreamed of Empires by Alvaro Enrique - a fictionalised account of Cortez's conquest of the Aztecs. It's very political and at times comedic, violent, strange, hallucinatory. Highly recommend it!",
            "**Slim by tickology**",
            "Currently reading/writing an original.",
            "Tinkers by Paul Harding. Lovely little story on living and dying.",
            "The Reformatory by Tananarive Due. Not for the faint of heart because it is a very gut wrenching and horrifying depiction of 1950’s Jim Crow era Florida- but it is a wonderful horror novel. \n\nI’m just over half way through and it definitely in my top 3 reads of the year.",
            "Terry Pratchett - I Shall Wear Midnight.\n\nA pretty dark book considering it’s aimed at children.",
            "Reading \nBible, By the Sea (Abdulrazak Gurnah) and Kanthapura (Raja Rao)",
            "Finally started reading **I know why the caged birds sing** by Maya Angelou.......I need to take a break every now and then since the subject matter is so heavy...but holy moly...I wish this book was taught in my lit course...I would have loved to dissect it and analyse it (I do recommend reading trigger warnings before you start)",
            "Just read a book called The Family Upstairs. 3 people are found dead in a house, they've been dead for days. There is a baby upstairs that has been fed and changed and looked after. Who was looking after the baby👀",
            "All Better Now by Neal Shusterman. I’m an adult and don’t typically read YA but lately I’ve been on a realistic dystopian story kick and this one is feeding my itch!",
            "The Hurricane Wars by Thea Guanzon - if you watched Avatar The Last Airbender and wished Katara and Zuko ended up together then read this.",
            "The Housemaid’s Secret by Freida McFadden\n\nIt’s kind of a partially successful sequel, about a woman with a chequered past who ends up as a sort of vigilante domestic help, serially rescuing abused women from their superficially charming billionaire husbands. (They should definitely all be played by Robert Pattinson but we never find out what industries any of them are in.)\n\nNot sure she can sustain it. The MC is struggling under the weight of so much baggage, and the whole concept exists somewhere between Bridget Jones and Promising Young Woman. She’s spent most of the book so far promising to reveal her past to her own suspiciously picture-perfect boyfriend, who seems oblivious to the forest of red flags around this lady.\n\nI keep comparing it to the vastly superior The Mars Room",
            "Marquez’s Chronicle of a Death Foretold",
            "I just finished Summer Sons by Lee Mandelo last night. Not my favorite. But entertaining.",
            "**Inherent Vice** by Thomas Pynchon. I'm only 20 pages in but it's made me chuckle a few times already and there's something kind of fun about these characters even if I don't know them all that well yet.\n\nSince I only have 20 pages on that one, I'll also talk about the last book I read: **Ego Is The Enemy** by Ryan Holiday. I don't really rate it as a self-help book (which I think it's marketed incorrectly as), but as soft-philosophy and just a collection of interesting stories around a central theme, I didn't think it was half bad. it feels like I'm damning it with faint praise I probably am - I don't know that I would recommend it, but I certainly wouldn't tell someone not to read it.",
            "Rejection\n\nIf you want to squirm while watching characters make terrible decisions in front of your eyes, then this is the book for you ",
            "On Earth We’re Briefly Gorgeous and ACOTAR. Yes, I’m reading both.",
            "The Heart is a Lonely Hunter by Carson McCullers. So beautifully written, but I’m only about 50% through it.",
            "I'm barely into The Measure by Nikki Erlick (like 15%). So far, it sort of reminds me of when the pandemic hit: there's this global phenomenon, no one really knows what to do, and everyone starts to adjust to a \"new normal.\" Probably a weird comparison, but again, I'm just barely into it. Can't say whether I'd recommend it yet.",
            "Try this book it’s sold on Amazon - what rae was never really gone \n\n Here’s what it’s about :\nWhat Rae Was Never Really Gone follows Rae, a young girl who fled her abusive home at a time when she felt like she had no other choice. Her father, a violent, alcoholic man, terrorized her since her mother left when Rae was just a child. With no siblings, and only one close friend who eventually disappeared, Rae was truly alone, enduring years of neglect and trauma. The book explores Rae’s journey of survival and her painful decision to run away, leaving behind a town and a life filled with fear.\n\nYears later, Rae returns under a new identity, hoping to rebuild her life far away from the nightmares that haunted her. However, the town she left behind is full of secrets, and not everyone is ready to let go of the past. As Rae struggles to piece together the fragments of her former life, she finds herself drawn back into a mystery that intertwines her past with that of another missing girl, Emily, whose disappearance may be tied to Rae’s own history.\n\nBut there’s someone watching her. A person from her past who may know more about her disappearance—and her father’s actions—than Rae could ever imagine. The lines between past and present blur as Rae uncovers terrifying truths that threaten not only her freedom but her very life",
            "Just finished (last night) Matt Dinnamon Dungeon Crawler Carl book 7 \"This inevitable ruin\" and now I have to wait for book 8.\n\nJust started Mark Lawrence - \"The Book that wouldn't burn\" book 1 of his \"The library trilogy\"",
            "What were you shocked by? I've read it twice and don't remember anything standing out about that scene.",
            "Finished reading, Nettle and Bone by T Kingfisher.",
            "The Grapes of Wrath. !!! So timely!  Chapter 14-15. … still reading",
            "Her Majesty's Coven by Juno Dawson",
            "I am currently reading The Frugal Wizard’s Guide to Surviving Medieval England by Brandon Sanderson.\n\nA man awakes in a clearing in what appears to be medieval England with no memory of who he is, where he came from, or why he is there. Shenanigans ensue!",
            "Currently reading a collection of short stories by Rabindranath Tagore! ",
            "I just finished I Was A Teenage Slasher by Stephen Graham Jones this morning. I have been in a stressed out place (both for personal reasons and world-historical reasons) and I have been appreciating exciting fiction that just kind of takes me along for the ride. This book accomplishes that goal. I liked the pacing, and I appreciate the way the friendship between the narrator and his best friend develops.",
            "I just finished a great new first book by Jakob Kerr, Dead Money. Really twisty, fantastic read, highly recommended.",
            "The Heretic Queen by Susan Ronald. It's a look at the religious wars taking place in Europe during Elizabeth I's reign.",
            "Life Ceremony by Sayaka Murata. I'm loving all the short stories. Completely different from the last book I read, Covenant of Water.",
            "I'm about 60% of the way through The Quincunx by Charles Palliser.  This is a grim and gritty novel set in early Victorian England, with 5 families fighting over a codicil (will).  I read it about 30 years ago and loved it, so I am rereading it and loving it all over again.",
            "I’m rereading *Washington Square*.",
            "I have read The Flower of Mjegur: Tehsadora by Faton Flow Loshi. Im waiting for the second part to be out!",
            "Finishing up the Underland Chronicles right now, currently on Gregor and the Code of Claw. Also re-reading The Hunger Games, currently on Catching Fire, simultaneously. \n\n\nCrazy as it may sound I'm actually finding I like The Underland Chronicles better! The sci-fi/fantasy elements are great. I was shocked that it's often just as gritty as THG even though it's aimed at like 5th graders rather than teens and young adults.\n\n\nI like this post because lately I can't shut up about how good TUC are.",
            "The Math of Focus, Productivity and Deep Work.",
            "Tiamat's Wrath by James S. A. Corey (#8 in The Expanse series). These characters mean so much to me. ",
            "East of Eden by John Steinbeck\n\nHis writing is so powerful and thought-provoking. Think of it as a re-telling of the book of Genesis but set in late 1800s & early 1900s California.",
            "The guide by R.K. Narayan ,\nCollected short stories by Ruskin Bond",
            "The Master and Margarita by Mikhail Bulgakov.\n\n\nThis novel is truly one of a kind. I get why it's talked about with such high regard. It's now one of my all time favorites. ",
            "The Color of Revenge by Cornelia Funke, fourth in the Inkworld series. These books are on my list of series that feel like old friends. They're an enjoyable read in the fantasy fiction genre, though the first book is a bit underwhelming and slow compared to the others. I personally feel that Funke's strength is in her characters and their personal journeys, though her world building is fun to immerse oneself into as well!",
            "Game of Thrones. Watched the show when it came out be rereading it was incredible. I was awed by the imagination and scope of the book.",
            "Any of the Dune series by Frank Herbert. I'm also quite fond of John Scalzi."
        ]
    },
    {
        "id": "1jwm388",
        "title": "What is a book you would recommend for someone who is trying to get into classics?",
        "score": 22,
        "num_comments": 128,
        "link": "https://www.reddit.com/r/suggestmeabook/comments/1jwm388/what_is_a_book_you_would_recommend_for_someone/",
        "content": "I am a big reader, and I love reading fiction, fantasy, romance and a little poetry and general non-fiction as well (mostly about geopolitics and geography). I realise that classics is one gap I have in my reading journey. I basically only read classics as part of my highschool curriculum (Oliver Twist, Jane Eyre, Julius Caesar, and some prominent Indian classics authors like RK Narayan, Tagore and Premchand.\n\nWhat classics would you recommend for someone who is new to classics? I think one of the things that intimidates me is the overly complicated language, so something accessible would be much appreciated!\n\nPS. I know that the definition of what counts as a classic is debated widely, so give me all recs that fit into your definition of a classic :)",
        "comments": [
            "Rebecca by Daphne du Maurier",
            "The Grapes of Wrath is astounding",
            "I liked Wuthering Heights and I normally dislike classics.   I just loved hating every character. ",
            "Dumas  Three Musketeers is a fun read.",
            "The Portrait of Dorian Gray by Oscar Wilde",
            "a good short one is the metamorphosis by franz kafka :) only takes a good 1-2 hours to finish and is a simple read for you to just dip your toes in ",
            "Lolita by Nabokov, Mary Shelly’s Frankenstein, Crime and Punishment by Dostoyevsky, The Metamorphosis by Franz Kafka, Fahrenheit 451 by Ray Bradbury",
            "The Moonstone by Wilkie Collins",
            "One Flew Over The Cuckoo's Nest by Ken Kesey\n\n\nWatership Down by Richard Adams",
            "I’m currently working my way through the [BBC Big Read](https://www.bbc.co.uk/arts/bigread/top100.shtml) which is filled with the most-loved books, mostly classics. This is how I’ve been tackling that genre.",
            "Bram Stoker's Dracula is honestly super fun, I found it a bit slow in the beginning, but trust me it gets very fast paced real quick!",
            "Just finished *The Age of Innocence* by Edith Wharton last week and really liked it. It was one I hadn't read previously, and I was surprised at how generally modern the language was.",
            "Silas Marner\n\nThe Grapes of Wrath\n\nPride and Prejudice\n\nMiddlemarch\n\nIt took me a long time before I started reading classes. This is the order I read these in (with a lot of stuff in between) and the ones I liked. \n\nMiddlemarch is long enough to seem intimidating but it’s really just an enjoyable and insightful soap opera type of book that moves from one perspective to the next as people move about in this one town.",
            "I really enjoyed The Decameron and The Count of Monte Cristo as a teen. I haven't reread them but assume they hold up haha\n\nThe Trial by Franz Kafka, and They're Eyes Were Watching God by Zora Neale Hurston are a few I've loved as an adult",
            "David Copperfield by Charles Dickens",
            "*Three Men in a Boat* (1889) by Jerome K. Jerome is still laugh-out-loud funny, even more than a century later. What starts as a simple river trip among friends turns into a series of absurd misadventures and dry observations on everyday life. The humour feels surprisingly modern. \n\n*Silas Marner* (1861) by George Eliot was ahead of its time in the way it explores themes of community, redemption, and chosen family. It's a story about isolation, loss, and the healing power of human connection - subjects that continue to resonate, especially in today's world where people often feel disconnected.\n\nAnd *The Picture of Dorian Gray* (1890) by Oscar Wilde is another classic that still feels strikingly relevant. It’s a sharp critique of vanity, superficial beauty, and the cost of living without moral boundaries. In an age of social media and curated identities, Wilde’s only novel hits uncomfortably close to home.",
            "Reading the Odyssey was an eye opener.  I was expecting it to be a stuffy, boring slog - and instead found a fantastic, quick-moving adventure story with great characters and gorgeous writing.  Robert Fitzgerald's translation is still my favorite.",
            "You could do worse than give Thomas Hardy a go. Accessible language, great characters, and very evocative of place and time. Mayor of Casterbridge would be a good place to start.",
            "Great Expectations by Charles Dickens is an excellent starter classic.  Easy to enjoy and not very complicated",
            "Maybe start with 20th century classics, so you won't have a problem with the language\n\n- Metamorphosis by Kafka\n\n- The bell jar by Sylvia Plath\n\nBut 19th classics aren't as intimidating as they seem\n\n- Pride and prejudice by Jane Austen is a fun read\n\n- Wuthering heights by Emily Bronte is sure to get you hooked\n\nIf you feel like getting into non-english-speaking authors, look for the most recent translations, they're usually accessible and read like contemporary books\n\nShort but great russian classics:\n\n- White nights by Dostoievski \n\n- The death of Ivan Ilitch by Tolstoi\n\n- Fathers and sons by Turgenev \n\nAnd a brilliant brazilian classic because it's the most underrated literature\n\n- Captains of the sands by Jorge Amado",
            "Frankenstein - Mary Shelley",
            "These are some of my favourite \"accessible\" 19th century classics. They're all under 100,000 words/400 pages:\n\n- Treasure Island - Robert Louis Stevenson\n- Around the World in Eighty Days - Jules Verne\n- The War of the Worlds - H.G. Wells",
            "I’m a big Mark Twain fan.",
            "The Woman in White by Wilkie Collins is Victorian era but quite accessible. A good mystery/detective story. Same with The Moonstone.\n\nCider with Rosie, I Capture the Castle, Rebecca, Never Let Me Go, The Catcher in the Rye and 1984 are all easy to read. If you like books about exotic locations, A Handful of Dust by Evelyn Waugh is a dark satire about a man who goes on a risky adventure up the Amazon. \n\nThe Go-Between, Dracula, The Woman in Black, Little Women and Howard's End are also pretty accessible.",
            "Of Mice And Men. It’s short, well paced, strongly written and packs an emotional punch.",
            "Would Graham Greene count? I’d recommend. Also Hemingway is fantastic to me.",
            "If you are into science fiction, try Isaac Asimov's Foundation. \n\nIf you like this book, there are two other books that complete the trilogy.",
            "Lord of the Flies by William Golding.\n\n I like that it can be viewed either as a straight drama or a hilarious satire. I especially like the ending where the mob basically destroy their island in pursuit of the outsider.\n\n I found it very topical in today's political environment.",
            "Dracula was amazing!",
            "A Tale of Two Cities",
            "NOT the awakening LOL but that's just my experience. I'm trying to read one classic a quarter this year and that one I picked up right after an Sunrise on the Reaping so it just.....I couldn't get into it, didn't like the casual racism (of the times, I know.), and I truly just.....was so glad it was over at the end. \n\nI love Little Women, Anne of Green Gables - but not the Awakening.",
            "I'm still new to classics myself, but I really enjoyed The Giver quartet.",
            "MDick and Les Miserabiles",
            "The Plague",
            "2025 is the centenary of the publishing of The Great Gatsby, no better time to read it.",
            "Edgar Allen Poe",
            "Animal Farm by Orwell\n\nWives and Daughters by Elizabeth Gaskell",
            "I have been working my way through so many classics these last couple years. Pride and Prejudice was so good, imo. Legitimately enjoyable and funny.",
            "Animal Farm and of mice and men. Sorry if someone already said them",
            "Define classics? \n\nIf you want ti start on the bunny slope, you could probably start with I Capture the Castle. The language is lovely and a little old-style without being ornate or loopy.",
            "Oblomov  \nThree Men In A Boat",
            "East of Eden… imho the most gorgeously written prose",
            "The kite runner",
            "Jorge Amado: Captains of the Sands\n\nJames Baldwin: If Beale Street Could Talk (short enough to overcome the odd bit of US slang)\n\nDaniel Defoe: Journal of the Plague Year\n\nNadine Gordimer: July's People\n\nJack London: Call of the Wild, etc\n\nAlexander Solzhenitsyn: One Day in the Life of Ivan Denisovich\n\nRobert Louis Stevenson: the Strange Case of Dr Jekyll and Mr Hyde\n\nOscar Wilde : the Picture of Dorian Gray",
            "I like classic adventure:  Jules Verne, The Prisoner of Zenda, The Four Feathers. \n\nBut I also like the subtle satire of Jane Austin. \n\nThere are lists of the top 100 books of all time that would be a good resource. I know Project Gutenberg has one.",
            "Little Women",
            "Jack London",
            "Anything John Steinbeck is good! He has some shorter ones that are easy reads but my personal favorite is East of Eden which is a bit longer. Also To Kill a Mockingbird is one of my all time favorite books, read it for the first time in middle school I think and then it was required reading my freshman year of high school so definitely a bit easier language wise. The Metamorphosis by Kafka was excellent and short. Anything that’s been translated in more recent years shouldn’t be too crazy either, but I would start by looking for shorter translated works and not jump straight to like War and Peace while you’re starting to get into classics lol",
            "East of Eden by Steinbeck. I also heard there is a new translation of All Quiet on the Western Front that is less stuffy than the original",
            "Maybe look for some of the classics in the genres you already enjoy?\n\nIf you like adventure or fantasy stories, something like Robinson Crusoe. Or Dracula, or Frankenstein. Or The Picture of Dorian Gray.\n\n(Dracula is fantastic and totally accessible and everyone should read it at least once.)\n\nIf you like big, sweeping epics, maybe something like The Three Musketeers or The Count of Monte Cristo or Les Miserables.\n\nIf you like crime/detective stories you can't go wrong with Sherlock Holmes.\n\nAlso: if you DON'T like a particular genre, you might not like the classics in that genre either. I hate Jane Austen... but I don't really like romance stories.",
            "Dracula was amazing. I was shocked when I read it just how much I loved it. It could have been written today.",
            "Fjodor Dostojewskij\n\n*Crime and Punishment* or *Brothers Karamazov*\n\nJames Joyce\n\n*Dubliners*\n\nRoberto Bolaño\n\n*Savage Detectives*",
            "The Moonstone by Wilkie Collins.",
            "Anything by Jane Austen. Pride and Prejudice is a good place to start. \n\nA Tree Grows in Brooklyn \n\nEast of Eden\n\nAll Quiet on the Western Front\n\nFahrenheit 451\n\n1984",
            "The bell jar,\nThe count of monte christo,\nLord of the flies ,\nAnd Dostoevsky crime and  punishment ,\n\nEasy reads except Dostoevsky, it’s a long read but easy language and it’s catchy",
            "A Tale of Two Cities                       \nLes Miserables",
            "Moby Dick is funnier than you might expect if you were forced to read it in school.\n\nThe count of Monty Christo is very good.",
            "The Good Earth by Pearl S Buck\nKing Solomon’s Mines by H Rider Haggard\n\nLost Horizons by James Hilton\n\nMark twain\n\nPrisoner of Zenda\n\nScarlet Pimpernel",
            "Huckleberry Finn, The Moonstone, Animal Farm…",
            "Some of my faves, as someone who dislikes the classics in general:\n\nBrave New World by Aldous Huxley \n\nGiovanni’s Room by James Baldwin\n\nThe Pearl by John Steinbeck\n\nAs I Lay Dying by William Faulkner\n\nLolita by Vladimir Nabokov\n\nSlaughterhouse Five by Kurt Vonnegut\n\nThe Plague by Albert Camus\n\nThe Catcher in the Rye by J.D. Salinger\n\nThe Color Purple by Alice Walker\n\nSiddhartha by Hermann Hesse"
        ]
    },
    {
        "id": "1k4oyg8",
        "title": "Recommend me my first Steven King novel.",
        "score": 20,
        "num_comments": 122,
        "link": "https://www.reddit.com/r/suggestmeabook/comments/1k4oyg8/recommend_me_my_first_steven_king_novel/",
        "content": "Yes, I know I’m extremely behind.",
        "comments": [
            "Depends on what you want\n\nWant to feel hopeless? Pet Semetary\n\nWant a ghost story, both symbolic and literal? The Shining\n\nWant a classic spook? ‘Salem’s Lot\n\nWant a slow burn? Needful Things\n\nWant an epic? The Stand\n\nWant an epic that’s more complicated? IT\n\nWant something long but not so heavy as an epic?11/22/63\n\nWant something more realistic? Misery \n\nWant something that’s just generally awesome? The Green Mile\n\nWant something to make you think about it days afterward? Revival",
            "11/22/63",
            "The Shining",
            "Misery!",
            "Salem’s Lot!!",
            "Carrie or Pet Sematary are good “starter” books for SK",
            "Oh wow, let's go big or go home. \n\nThe Stand!",
            "The Long Walk (“Richard Bachman”) was my first! And to this day one of my favorites.",
            "Pet sematary.",
            "Carrie",
            "The Long Walk (it was originally a novella in a collection but it’s sold separately now too)",
            "The Girl Who Loved Tom Gordon. \n\nThat’s probably not a very popular opinion but it was the first book of his I ever read and it got me hooked…but that’s still my favourite of his to this day.",
            "My favorite \"classic\" King books:  The Shining, Pet Sematary.  \nMy favorite King book overall: The Green Mile.  \nWhere I started: The Gunslinger.\n\nI don't recommend starting with something ambitious like The Stand, or It, or The Dark Tower (unless you really dig the concept and want to really jump into King's overall cosmology, then go for it. Just bear in mind that The Gunslinger was one of King's very earliest and most experimental books, and not at all representative of his other work. I still love it, though).",
            "Desperation",
            "That is a boy difficult considering he has so many.  I honestly wpulf suggest you get some of his short stories.\n\n\nYou like it darker\n\nNight shift (his first collection)\n\nSkeleton crew\n \nThese are some of my favorites",
            "Misery 🙌",
            "I think Misery is a good choice - it’s great for a start and is very grounded which might be an easier in",
            "Pet Sematary; The Girl Who Loved Tom Gordon; Thinner",
            "My sister just finished Misery. Took her about 2 days!",
            "Lots of choices here. If you want to just dip your toe, maybe Carrie or Firestarter. If you want to walks down the stairs into the pool, The Stand. If you want to jump completely in over your head, The Dark Tower series.",
            "Heart of Atlantis\n\nUnder the Dome\n\nFirestarter",
            "I'd go all the way to his first story, The Long Walk.\n\nIt's both the pre-cursor to so many reality TV dystopian plots, and his first work, so you can see how he evolved over time. It's also a really good read.",
            "🗣 DELORES CLAIBORNE! One of my top 10 books. It is written differently than his other books but it is so so good! I read it in a day cause I couldn't put it down!",
            "It 🤡",
            "The Gunslinger",
            "Just not the Stand. I love Uncle Stevie and have failed to get through it four times now over 20 years.",
            "Start with one of his first two short story collections - Night Shift and Skeleton Crew\n\nMore bang for your reading buck. Some of the stories are wild and all over the place, and each one less than 20 pages usually (except the Mist)",
            "Misery.",
            "Start with Carrie, just like he did.",
            "The Dead Zone",
            "'*Salem's Lot*",
            "Misery and Night Shift (horror story collection)",
            "Carrie.\n\nThe appeal of King's work is he \"wrote plain fiction for plain folks\". That is his own words in \"Different Seasons\". He wasn't thinking of writing the greatest novel, he wrote the books for a comfortable read. A lot of it are about normal people facing something that might be supernatural or horrifying. \n\nThat's Carrie in a nutshell. It is shorter than most of his work, so you can get started on what to expect when reading other. \n\nMy favorites of his are The Shining and Misery.",
            "pet sematary",
            "Mr Mercedes",
            "I’d say 4 Seasons: 4 great stories and a fairly easy read. You may be familiar with the Body aka Stand by me.",
            "You like it darker (collection of short stories so p easy to get through)",
            "Christine was my first. I’d go with that or The Shining.",
            "I don’t think there is many bad choices here",
            "Read one of his books of short stories ( I forget the name of it but includes four that became movies",
            "My first was Different Seasons, no regrets.",
            "I just recently started reading King novels as well. my order of progression went:   \nDifferent Seasons  \n11/22/63  \nYou Like It Darker  \nShining \n\nI read the last three back to back to back. of the four I've read, 11/22/63 was my favorite, by far.",
            "The Stand",
            "If you can find a copy, Rage",
            "Salems Lot is a good book, and so is The Stand, but they are pretty dated by today's standards. That doesn't mean they're bad, just that you might not connect with them if you've never read his books. Depends on your tastes. They were super relevant in the 80s but not so much today. I listened to both as audiobooks recently and that was my takeaway. \n\nThe Dark Tower books are timeless and fantastic reads, especially the first three. They are his best work. \n\nI also recommend his anthologies, such as Night Shift, Four Seasons, Everything's Eventual, etc.",
            "It depends on what you like. I think these are all relatively fast reads that will keep your interest. \n\nLovecraftian cosmic horror - Desperation\n\nSupernatural horror - Duma Key\n\nPsychological horror - Misery\n\nCrime thriller - Billy Summers\n\nScience fiction - 11/22/63\n\nFantasy - Fairy Tale \n\nI would avoid Apt Pupil, Pet Semetery, and Revival unless you like super depressing and bleak stories. The are all great books but are difficult to get through. \n\nFYI..Rose Madder and Under the Dome were a bit rough for me due to excessive and graphic depictions of physical and sexual abuse.",
            "Different Seasons.",
            "What type of books do you like? He has good stories in every genre.\n\nMy personal favourite would be **The Long Walk**",
            "The Shining. I read it outside on a hot summer day and I got chilled. It’s so so so much better than the movie!!",
            "I'd start with ***The Shining***.",
            "My first was Pet Sematary. I read it aloud to my husband because he was too scared to read it himself. \nI love The Green Mile and Full Dark, No Stars. \nI love Joyland. He has so many hidden gems in his body of work.",
            "It",
            "Carrie",
            "The Shining definitely",
            "The long walk",
            "I’ve found Christine to be such a great, immediately compulsive read to introduce King. I read Night Shift first, which I would also recommend. Everything’s Eventual is another I’d throw out there.",
            "The Dead Zone ! And still love it",
            "Insomnia - the characters are pretty cool. I like Ralph",
            "The Long Walk (under his pen name Richard Bachman) \n\nRita Hayworth and the Shawshank Redemption\n\nThe Body",
            "The Stand",
            "IT",
            "1000000% misery. It just goes.\n\nStephen king is verrrryyyy wordy. I read misery and loved  it. Went to the stand and only made it half way.\n\nI have been slogging through The Shinning. It is finally picking up halfway through. This may be controversial, I don’t know. ",
            "The Stand!!!!",
            "The stand, of course.",
            "Cujo if you love dogs",
            "I started with Misery, and then consumed as much as I could after that.",
            "The green mile! One of my favorite books-",
            "The Long Walk",
            "the Stand!",
            "Read *Watchers* by Dean Koontz instead.",
            "Hello, as many others have said he writes a good selection of stories\n\nWant to feel hope? Rita Hayworth and the Shawshank Redemption.\n\nCreepy Lore-ish Thriller? The Outsider (the best one I read so far)\n\nEver wondered what it would be like to be gifted with being psyhic? The Dead Zone.",
            "My first King book was Cujo. Fairly easy read and a good representation of his style.",
            "I'm gonna start Cujo next. Worth it?",
            "It",
            "Steven King? Sure\n- HIT\n- Vet sematary\n- Mistery\n- Carlile\n- The Strand\n- The shitting"
        ]
    },
    {
        "id": "1kgf0qu",
        "title": "Non-fiction book recommendations that read like a great investigative piece",
        "score": 55,
        "num_comments": 83,
        "link": "https://www.reddit.com/r/suggestmeabook/comments/1kgf0qu/nonfiction_book_recommendations_that_read_like_a/",
        "content": "I love basically all of Patrick Radden Keefe's books, John Carreyrou's Bad Blood, Dopesick by Beth Macy, and Evicted by Matthew Desmond.\n\nBasically non-fiction books that feel like you're reading an expose into some societal or historical issue with amazing writing.",
        "comments": [
            "killers of the flower moon by david grann is an investigation into the osage murders of the 1920s. it also dives into the history of discrimination against the osage and the corruption that enabled the crimes",
            "Here's a few off my list that aren't recommended that often:\n\nTeam of Rivals by Doris Kearns Goodwin (President Lincoln's cabinet)\n\nJesus and John Wayne by Kristin Kobes Du Mez (evangelism in the US over the last 100 years)\n\nThe Billion Dollar Spy by David Hoffman (crazy details on cold war espionage activities in Russia)\n\n1491 by Charles C. Mann (a tour of the native populations in the Americas just before European contact)\n\nMidnight in Chernobyl by Adam Higginbotham (self-explanatory, very well written)",
            "**A Fever in the Heartland**, by Timothy Egan. It follows the rise and fall of the KKK in 1920s Indiana and how one woman’s courage helped dismantle its grip on American society. ",
            "I just finished Midnight in the Garden of Good and Evil and really enjoyed it, and I think it's perfect for what you're looking for. \nA New York writer spends time in Savannah Georgia and writes about the characters he meets and eventually about the murder that takes place. \nThe people are fun, the plot kept me hooked, but really, the city itself is the main character. \nIt's a lovely book",
            "In Cold Blood - Truman Capote",
            "Under the Banner of Heaven: A Story of Violent Faith, by Jon Krakauer\n\nThe Devil and Sherlock Holmes: Tales of Murder, Madness, and Obsession, by David Grann\n\nThe Day the World Came to Town: 9/11 in Gander, Newfoundland, by Jim DeFede\n\nDays of Rage: America's Radical Underground, the FBI, and the Forgotten Age of Revolutionary Violence, by Bryan Burrough\n\nWho By Fire: War, Atonement, and the Resurrection of Leonard Cohen, by Matti Friedman",
            "I’ll be gone in the dark by Michelle McNamara.  About the search for the golden state killer.",
            "Erik Larson writes very engrossing non fiction, highly recommend",
            "Say Nothing by Patrick Radden Keefe, about a disappearance during The Troubles.\n\nMidnight at Chernobyl by Adam Higginbotham about…Chernobyl. Both are incredibly good.",
            "Catch and Kill by Ronan Farrow (It’s about Harvey Weinstein and how his sexual abuse crimes stayed hidden and went on for so long.  Ronan Farrow is one of the best writers around and this book reads like a thriller novel.) \n\nKillers of the Flower Moon By David Grann (It’s about how Americans killed and swindled many members of a Native American tribe in Oklahoma.  It’s unbelievably shocking.  The author does an amazing job of explaining what happened in a narrative style. It also involves the beginnings of the FBI.)\n\nBad Blood by John Carreyrou (It’s about Elizabeth Holmes’s fraudulent blood testing company Theranos. She is currently in prison)",
            "Anything by Rose George, Judy Melinek, Caitlin Doughty, or Mary Roach.",
            "*Conspiracy of Fools* by Kurt Eichenwald is about the collapse of Enron and it reads a lot like a detective novel.",
            "And The Band Played On by Randy Schilts is the pinnacle of that genre. Impeccably researched, but it reads like a lurid thriller about corruption and incompetence. The author had access to a breathtaking range of sources and actually refused to be tested for HIV while writing the book because he wanted to remain as impartial as possible \n\nRed China Blues by Jan Wong is another of the greats. She was one of the first female westerners to attend a Chinese university during the Mao regime, stayed, grew disillusioned, then returned as a foreign correspondent and was on site at Tiannamen. The book covers 20 years of drastic social and cultural change and she writes with insight into her own role and self-deprecating humour\n\nBoth authors were journalists",
            "*The Jakarta method* by Vincent Bevins",
            "Helter Skelter by Vincent Bugliosi, maybe?",
            "Nine Minutes Twenty Seconds by Gary M. Pomerantz\n\nIt depicts a plane crash in all details. The persons involved, the minutes before and after the crash, investigations and the legal process afterwards. I read it like 20 years ago, but I still remember it as one of the most moving books I ever had.",
            "**The Devil in the White City: A Saga of Magic and Murder at the Fair that Changed America**, by Erik Larson.",
            "*Deaths of Despair and the Future of Capitalism* by Anne Case and Angus Deaton. This was written prior to Covid and while overdose deaths were still rising. It includes quite a bit about the perverse incentives of pharmaceutical industry and health insurance industry.",
            "Anything by Robert fisk - The Great War for Civilisation, or Pity the Nation: Lebanon at War, he was one of if not the best UK war correspondent.",
            "As someone who also loves Patrick Radden Keefe-\n\nBad City: Peril and Power in the City of Angels by Paul Pringle (2022), a non-fiction book by a long career investigative journalist at the LA Times which involves the LA Time itself getting implicated in the corruption at hand\n\nAlso, not exactly the same kind of 'investigate journalism' approach per se, but How the Word is Passed by Clint Smith (a journalist) certainly hits the mark of illuminating 'some societal or historical issue' and has very amazing writing, so might be worth having a look to see if it appeals.\n\n  \n\\[edited because I somehow accidentally made some of the text randomly big, which I think I fixed now\\]",
            "Cheap Land Colorado: Off-Gridders at America's Edge by Ted Conover was really good, especially the audio version. \n\nFrom Pulitzer Prize finalist and National Book Critics Circle Award–winning author of Newjack, a passage through an America lived wild and off the grid, where along with independence and stunning views come fierce winds, neighbors with criminal pasts, and minimal government and medical services.\n\n“In these dispatches, [Conover] invites readers to ride shotgun along an unraveling edge of the American West, where sepia-toned myths about making a fresh start collide with modern modes of alienation, volatility, and exile…. In a nation whose edges have come to define its center, this is essential reading.”—Jessica Bruder, author of Nomadland: Surviving America in the Twenty-First Century",
            "Five Days at Memorial by Sheri Fink",
            "Anything by Michael Lewis.",
            "The Warmth of Other Suns by Isabel Wilkerson. \n\n\nSandworm and Tracers In The Dark (two books) both by Andy Greenberg. \n\n\nDark Money by Jane Meyer. \n\n\nThe Undocumented Americans by Karla Cornejo Villavicencio\n\n\nBlood in the Water by Heather Ann Thompson\n\n\nSome People Need Killing by  Patricia Evangelista\n\n\nFire Weather: The Making of a Beast by John Vaillant",
            "Zodiac by Robert Graysmith.   Not precisely investigative, but it’s a well told journey through the case.",
            "Bag Man by Rachel Maddow",
            "Soldiers and Kings by Jason de Leon, Cobalt Red by Siddharth Kara",
            "the beast by oscar martinez. he spent months on the ground with migrants traveling to the us border. sometimes reads like fiction it’s so good \n\nthe unbreakable miss lovely by tony ortega. the story of pauline cooper and scientology’s organized campaign to gaslight and discredit her",
            "Under the Bridge by Rebecca Godfrey \n\nMidnight in Chernobyl by Adam Higginbotham \n\nAmerican Pain by John Temple \n\nDreamland by Quinones\n\nGoing Infinite by Michael Lewis \n\nThe Devil at his Elbow by Valerie Bauerlein \n\nMadoff by Richard Behar",
            "The Feather Thief by Kirk Wallace Johnson. Crazy intersection of a museum heist and fly fishing.",
            "False Report: A True Story of Rape in America by Ken Armstrong and T Christian Miller",
            "Framed by John Grisham  and Jim McCloskey",
            "People Who Eat Darkness by Richard Loyd Parry",
            "Mans Search for Meaning",
            "Annie Jacobsen has several",
            "A Civil Action is honestly thrilling.",
            "Doctor Dealer",
            "The Cadaver King and the Country Dentist by Radley Balko and Tucker Carrington. A man who’s been on death row for nearly 30 years because of the shoddy forensics this book digs into just had his conviction overturned: https://boltsmag.org/chris-duncan-louisiana-death-row-conviction-set-aside/",
            "Joe Cinque’s Consolation by Helen Garner \n\nEnrique’s Journey by Sonia Nazario",
            "I loved She Said by Jodi Kantor and Megan Twohey - about the #metoo movement by two investigative journalists (who won the Pulitzer for their reporting on the same topic)",
            "The Voyeur's Motel by Gay Talese",
            "Opus By Gareth Gore",
            "The Art Thief",
            "Tokyo Vice by Jake Adelstein. There's an HBO series on this as well",
            "the mother next door by the Andrea Dunlop might work for this",
            "Tokyo Vice by Jake Adelstein.  My first book about the Yakuza..brilliant reporting..it's been made into a series as well",
            "If you don’t mind a story collection, these are incredibly well written and edited : https://en.m.wikipedia.org/wiki/The_Best_American_Sports_Writing",
            "Fatal Vision",
            "The adversary, Limónov or Yoga, by Emmanuel Carrère",
            "oh, one of my favorites!  The Ghost Map.\n\n  \nFrom Steven Johnson, the dynamic thinker routinely compared to James Gleick, Dava Sobel, and Malcolm Gladwell, *The Ghost Map* is a riveting page-turner about a real-life historical hero, Dr. John Snow. It's the summer of 1854, and London is just emerging as one of the first modern cities in the world. But lacking the infrastructure—garbage removal, clean water, sewers—necessary to support its rapidly expanding population, the city has become the perfect breeding ground for a terrifying disease no one knows how to cure. As the cholera outbreak takes hold, a physician and a local curate are spurred to action—and ultimately solve the most pressing medical riddle of their time. In a triumph of multidisciplinary thinking, Johnson illuminates the intertwined histories and inter-connectedness of the spread of disease, contagion theory, the rise of cities, and the nature of scientific inquiry, offering both a riveting history and a powerful explanation of how it has shaped the world we live in.",
            "She Said by Jodi Kantor and Megan Twohey is a great read! It’s about the Weinstein case by the two journalists who were behind the New York Times investigation. It’s an excellent read and goes into a lot of backstory and detail about how far his influence reached.",
            "The Hot Zone!",
            "Chaos by Tom O’Neil",
            "Billion Dollar Whale 🐳",
            "Any of novelist Joseph Wambaugh’s non-fiction books:\n\nThe Onion Field (1973)\n\nLines and Shadows (1984)\n\nEchoes in the Darkness (1984)\n\nThe Blooding: The True Story of the Narborough Village Murders (1989)\n\nFire Lover: A True Story (2002)\n\nAlso:\n\nDavid Simon’s Homicide: A Year on the Killing Streets (1991)\n\nAnd, considering how unpleasant a person he is, I was surprised by how well Mark Fuhrman writes and how he is very detailed about evidence and investigative techniques: \n\nMurder in Brentwood (1997)\n\nMurder in Greenwich (1998)\n\nMurder in Spokane: Catching a Serial Killer (2001)\n\nA Simple Act of Murder: November 22, 1963 (2006)",
            "I think “Killing Lincoln” by Bill O’ Reilly would be a candidate.",
            "I think “Killing Lincoln” by Bill O’Reilly would fulfill that."
        ]
    }
]